{"id": "U4WAuxH6-QRhWV_ZFY_4sPABg3SiA9bTc0D7SRbVbeA", "title": "La nueva identidad", "body": "Cada vez que agarramos el celular estamos perdiendo dinero. Estamos brindando información voluntariamente a alguna compañía privada que luego la explota, manipula y monetiza sin nuestro consentimiento. \n\nEn la internet que conocemos los bancos digitales modernos (Facebook, Google, Apple, Microsoft y Amazon) aprovecharon el timing y sus recursos ilimitados de fondos de inversión para ofrecernos conveniencia a cambio de nuestra información. Es exactamente lo mismo que hacen los bancos con nuestro dinero. Sus valuaciones son directamente proporcionales a la información que almacenan de manera monopólica.\n\nDepende la red en la que interactuemos se pueden obtener diferentes facetas de nuestra identidad digital relacionada con nuestras conexiones, interacciones y contenido. Creemos que esta identidad es nuestra, pero de hecho no lo es. Cada plataforma es dueña de toda nuestra información digital y no podemos ejercer ningún derecho sobre esta.\n\nPor suerte web3 cambia el paradigma. En esta nueva era los usuarios tienen el control de su información, no existen bases de datos centralizadas que se puedan vender o explotar. El modelo de negocio no está basado en vender datos a publicistas.\n\nPor suerte web3 cambia el paradigma. Por primera vez podemos ser dueños de nuestra información digital, tener portabilidad y total control. No existen bases de datos centralizadas que se puedan vender a publicistas.\n\nPor ejemplo [Login.xyz](https://login.xyz/) está intentando hacer un puente entre web2 y web3 ofreciendo interfaces para integrar wallets con aplicaciones tradicionales. El login con wallet implica que nuestra información es pública, portable y está protegida por criptografía. Si interactuamos con cierta red y luego iniciamos sesión en otra la información acumulada es nuestra y podemos usarla en una nueva red.\n\n![](https://images.mirror-media.xyz/publication-images/LNIBuciNJL9tCq8dS2vmD.png?height=1206&width=2326)\n\nEn el proyecto [Lens](https://lens.xyz/) crearon un protocolo específico para lo social que permite a desarrolladores programar aplicaciones descentralizadas disponiendo de funcionalidades sociales básicas como subir contenido (posts), compartir, poner like, crear tu perfil y generar conexiones (el grafo social). Teóricamente, sobre Lens se podrían construir redes como Twitter o Instagram. Lo interesante es que toda esta información, independiente de la app que podemos va a quedar asociada a nuestra wallet. A diferencia de los modelos de negocio actuales, no van a poder explotar nuestra información para publicidad ni inventar algoritmos viciosos para mantenernos mirando la pantalla.\n\n![](https://images.mirror-media.xyz/publication-images/iJteO0AD43yiWDwQ3ya7F.jpeg?height=4096&width=8192)\n\n[POAP.xyz](https://poap.xyz/) emite un NFT (un Poap) de cada evento al que asistimos, entonces ahora somos dueños de por ejemplo nuestros certificados. Y si están en nuestra wallet, se convierten en parte de nuestra identidad, también como lo puede ser tener un token o un NFT. La propiedad está muy relacionada a la identidad y ahora con propiedad digital vamos a ver el concepto de identidad digital volver a nacer, replantearse, patear el tablero y dar devuelta las cartas.", "timestamp": 1656598408, "digest": "_atXkuBNCmWgPo7LoEIJpSOiuW06SDQml2xB8TUXZFs", "contributor": "0x7E0b0363404751346930AF92C80D1fef932Cc48a"}
