{"id": "TOcJjjMH8XqDuG0WCxrmzMfIUwt90XAoT1yEDdVb2ns", "title": "Ulysses First Mirror Dashboard", "body": "Hello World, This is my first dashboard on the mirror protocol i just discover this protocol studying with @andrewhong5297 the currents Data analytics tools on web3. \n  \n I gonna use this protocol to share my currents analysis and cases of study that i gonna work \n\n \n \n\n \n ", "timestamp": 1659033352, "digest": "EdZk2ENrAny3tilpvKNzyzUqXsnZXkcLY78qSfE8K9M", "contributor": "0xa7df1BD320457bad8be52855F8A884150cCE7daC"}
{"id": "iAs2y2i-ZMq0VDztygQWufnNMQhHFfx14X7mKgCLAsg", "title": "Own up if you f*ck up", "body": "Maybe you stumbled upon this while still actively considering to break the “big news” to your answerable party.  \n\nEasier said than done, looks better on paper than in person, but here’s some brownie points for owning up if you’re wrong, from a leader’s perspective.\n\n## You Take Everyone Into Consideration\n\nEspecially if you are in a position of authority, you already know what your mates are going to have to go through to blind rush a project. \n\nLack of sleep, absolutely hating what you used to love, refilling your 5th cup of coffee, being irritable at your partner, doubting your work quality. \n\nBeing among [the 73% of millenials](https://www.forbes.com/sites/sarahlandrum/2016/10/05/3-times-when-millennials-should-say-no-at-work/?sh=2f2524091e85) who find it hard to say “no”, more often that not we depend on figures of authority to promote the right culture. \n\n## Deadlines Are More Considerate Than You Think \n\nAssuming you already have the desirable traits of finishing your project under normal circumstances, things just *happen* in life. \n\nYou lose a loved one, your car broke down, your cat went into labour, in most cases clients are more than willing to accept a deadline extension on compassionate grounds.\n\nThis is why pay-to-complete-fast should be discouraged if the minus of the equation is having someone unwillingly stay up at odd hours. They didn’t sign up for that.\n\n## Your Quality Of Work Is Questionable\n\nTime is no state of matter, but one thing they do have in common is that you simply cannot squeeze a few week’s worth of work into 3 days. \n\nJust like a fruit when you cut corners, there’s only so much inefficiencies you discover before you start cutting the product itself. \n\nYou will start feeding your starving to do list with half baked work, in the same way a person who couldn’t care less about his job would. \n\n## The Balance Of Being Humble Yet Responsible\n\nI get it, this is not ideal for everyone if your project is a life or death situation. Surgeon, if you’re reading this please do get back to your operation and consider to have others on shift to step in next time. \n\nNor is something serious enough to own up, if its a university paper you have no interest about I’d give it a pass. ", "timestamp": 1659034898, "digest": "dxi6p5fzSVcTFGmrhG-hbPxwS52Cc4L79_ieLds5z4w", "contributor": "0x955866Ee0bD3B8B0BE4d4EA306670F34b90EF3ed"}
{"id": "N4WISA9E8rd69o34HG_TfK7TFqaHWIQBGbfd7JdPGSo", "title": "$ENIOLA 04: Building in a Bear Market", "body": "*Hey peeps, this is the first update post Launch House + NFT.NYC. Last month there was a focus on launching, launching and launching. For the most part, a unique blend of resources, connections and timelines were in-line to act as a launchpad for various projects (entrepreneurial and personal). It’s been well documented that current market conditions have put a spanner in the works for many start-ups, scale-ups and other builders. Some of my friends have lost the majority of their net worth, whilst others have now entered the job market. In these unprecedented times, the sentiment of many people on crypto Twitter is just to hunker down and build. But reality for the majority doesn’t allow for such basic and unthoughtful advice. All I can say is do what you can to get through the bear market. Get that job AND build, support your family AND build, take care of your body and mind AND build. To be comfortable building a startup in any market condition is some form of privilege in itself; something that builders and investors forget sometimes. Build if it makes sense. Do not be roped in by the simple platitudes you see online.*\n\nI think that’s my most extended introduction to any of my updates thus far → lets' dive in!\n\n### Month In Retrospect\n\n* I wrapped up a month in New York as part of Launch House, Founders House Summer 2022 Cohort (yes, it’s a long title). I had an amazing time there, built connections, had fun and learnt a lot. You can read [articles](https://eniola.mirror.xyz) and view [tweets](https://twitter.com/elijah_ajuwon/status/1528877678115586048?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1528877678115586048%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Feniola.mirror.xyz%2FA2MwquHQCIlQtTEsTyHJpvtMcDORoeHaisy0a-ZEetw) about my experiences.\n* I attended NFT.NYC for the first time as well, it was a good conference with amazing speakers from the biggest VCs and founders of some of the biggest web3 startups. However, I found that there was more value in the satellite events and after-parties, for me personally. I think I may end up applying to speak at the conference next year.\n* A demo for early.fans can be viewed on our [notion wiki](https://earlyfans.notion.site/early-fans-wiki-7e45427b91d74f29b2889e11b4120386). There you can get to grips with the looks and feel of the first iteration of our MVP.\n* We started having meetings with VCs, from both the United Kingdom and States. As mentioned before this is a numbers game. Each VC has different theses and methods. I have received varying advice from the firms; some of which conflicting but it’s important to build with users, make sure there’s a market and get some early traction. Someone will eventually take the first leap.\n* There were no proposals for $ENIOLA holders to vote on this month. Monthly proposals will make a come-back.\n\n### Biggest Takeaways\n\n* Right now I am unwavering. Even with these market conditions and personal circumstances, my first thought is what can I do to continue building. Do I get a job? Do I split the raise? Who do I partner with or reach out to? Should I relocate? My game plan may have changed but the goal hasn’t.\n* I want to feel small again. When I was in New York, I was constantly being reminded of how unremarkable and small I was. Now I know the language is dramatic and don’t worry I am not going through a quarter-life or identity crisis, it is just impossible for me to be comfortable with my achievements or goals. Some of my peers are doing amazing things. I know that comparison is the death of joy, but I what I took from this was the difference in my personal mentality and drive when around a certain type of individual. \n\n### What’s Next\n\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n\n*To view the redacted content please buy some $ENIOLA you can reach out to me or buy it on [Uniswap](https://app.uniswap.org/#/swap?chain=mainnet).*\n\n\n---\n\n### Final Thoughts\n\nTo the builders (in whatever capacity) reading this,c sondier your environment. When this type of discourse happens people typically focus on their friends and WHO they are surrounded by. However, what is equally important is WHAT are you surrounded by. What resources do you have access to? What infrastructure has been set up in your location? What ecosystems are you plugged into? The whats are as equally important as the whys.", "timestamp": 1659034956, "digest": "d3RTD4bbrAJZ1QZzCFnuZpQYhvcWujabklEYi4o6t-0", "contributor": "0xE314f925f05c8f5e4063Dd19684992196f5d89D9"}
{"id": "GQcOI9zqyI7sps8NdG6wS5LP_oqGjAXODpgqy2ZIOLw", "title": "Deploy your first smart contract to distribute your video on blockchain", "body": "Share is a protocol and dApp built on blockchain that enables creators to choose the price per stream of their audio or video content, distribute the content directly to consumers, make it accessible on any web application, and receive payments instantly when their content is streamed. Share has a wide variety of applications including music, video, and podcasts.\n\n*This article overviews the process to **deploy a VIDEO on blockchain with SHARE** and provides example information that you can use to test out the process.*\n\n\n---\n\n## Prerequisites\n\nIn the *[Share User Guide](https://docs.formless.xyz/share-protocol/guides/share-dapp-user-guide)* you can find the general requirements to use Share. This includes [selecting and setting up a Web3 wallet](https://docs.formless.xyz/share-protocol/guides/share-dapp-pre-release-user-guide/select-and-setup-a-wallet) and [connecting to the Share dApp](https://docs.formless.xyz/share-protocol/guides/share-dapp-user-guide/connect-to-the-dapp). If you haven’t already and are not familiar with some of the Web3 terminology and technology, please make sure you visit these sections and learn about what you’ll need to interact with Share.\n\n## Upload your video file and create a smart contract\n\n 1. **Video file.** Prepare a video file in MP4 format. MP4 is the most popular format for digital video. If you don't already have a video that you want to use for testing, you can use this [demo MP4 video](https://formless-eng.s3.us-east-2.amazonaws.com/share-testvideo.mp4).\n 2. **Website location.** Navigate to <https://share.formless.xyz/create> in your web browser. Here you’ll see a series of steps where you will input information that is used to create the details of your smart contract.\n 3. **Creator Name.** Enter \"My Test Name\". This is the name you use to identify yourself, e.g. your artist name or your real name. This can be anything you choose, for example, you can do things like \"KANYE X JAY-Z\" if you'd like to list multiple names. Your content ownership is uniquely identified through your blockchain address, not the name entered here.\n 4. **Title.** Enter \"My Test Video Title\". Similar to the name field, this can be anything you want. The content will be uniquely identified using its smart contract address. This title is purely for display purposes.\n 5. **Upload.** Select \"Choose File\" and locate the test video MP4 file that we prepared above.\n 6. **Artwork and previews.** Select “Custom Artwork” and upload an image file that meets the file type and size requirements identified on screen. This image will appear as a thumbnail and as a screen cap on your video. Select “Custom Video Preview” and upload a video file that represent a segment of your full video content and meets the file type and size requirements identified on screen. Users will be able to play this content prior to purchasing access to your content. If your content is free, there’s no need to add the Custom Video preview since all of your content will play for free. \n 7. **Royalty Splits.** You’ll see your wallet address auto-populated in the Primary Owner field. When you start uploading content that has multiple creators, you can select the “Split Royalties” box, add addresses of other owners, identify their proportional share of royalties, and they’ll also be added as content owners in your smart contract. For now, keep this unchecked and proceed with yourself as the single owner of the content. This means revenues will flow to your address when the content is viewed.\n 8. **Price For Access.** Enter “0.25”. This means that viewers will need to pay 25 cents to watch your new video. The payment won't require them to enter any financial information, it will automatically flow from their wallet on the blockchain seamlessly. In this example, we're using 25 cents, but the beauty of Share is that you can set this value to be anything that you want. It can be 0 for free content, or any amount you wish, even $1M if that's what you think it's worth. You know your audience and the worth of your content better than we ever could.\n 9. **Apple and Google Pay.** Select “Enable Apple and Google Pay”. This will allow consumers to purchase access to your content using Apple Pay and Google Pay, and they won’t need to connect a Web3 wallet in order to purchase access to your content. This is an optional feature and is only available for content that is priced equal to or above 17 cents. There are a few additional fees ($.30 + 7.9% of the transaction value) that consumers will have to pay for the convenience of using Apple or Google Pay, but depending on your use case and how you’re pricing your content it may make sense.\n10. **Access Grant Time.** Enter 1 DAY, 0 HOURS, 0 MINUTES. This is the amount of time that the viewer will have access to your content after they complete the instant micro-payment. This is also completely up to you. For example, you can set this to be 5 minutes or 5 months. Each time the content is viewed, Share will check the blockchain to see if the viewer still has access. Once the time is up, they'll need to pay again to experience the content.\n11. **Blockchain.** You’ll see \"Polygon Mainnet” auto-populated in the Blockchain field. This is the blockchain that we're going to use to store the contract for the content. As we noted earlier, we're using Polygon because it is fast, inexpensive, and fully compatible with Ethereum. \n12. **Cloud.** This is the backend infrastructure platform used to serve the content file globally. GCP is the default value, but this will be configurable such that you can specify your own server in the future if you'd like to. Please read the [Terms of Service](https://formless.xyz/terms) (ToS) with regard to hosting uploaded content. Share does not have the ability to modify or revoke smart contract assets deployed through the service, however we reserve the right to suspend content *hosting* associated with these contracts. This means if your contract violates the ToS, we will not serve the associated content, and it is your responsibility to update your deployed smart contract with a new URI which points to a Share protocol compliant host.\n13. **Review.** This displays the amount that it will cost to create and deploy the contract to blockchain. You’ll need to have at least this amount of MATIC tokens in your wallet for the transaction to process.\n14. **Deploy.** Select “Create”.  This will create your smart contract. You’ll see a message in your wallet asking you to verify the transaction. Once you’ve verified your transaction will process and result in your smart contract deployed on the blockchain. \n15. **Completion.** Congratulations! You’ve successfully deployed a smart contract on blockchain that is ready for distribution. You can select the link to view your content, or you can copy/past the link to share it with potential customers. \n16. **More.** Read about how you can [Send text messages with smart contract links](https://placholder).\n\n\n---\n\nWant more detail? Visit our [Creator Guide](https://app.gitbook.com/o/Ph5xno4MLS6IY0kdARee/s/vcxQC1Zn1P2Knw0WqAEa/\\~/changes/StIBaIJJO2fgStRVZAHG/guides/share-dapp-creator-guide). \n\nHave questions or need help? Contact us at [info@formless.xyz](https://mailto:info@formless.xyz) or visit us on [Discord](https://discord.gg/hgCpWt2bJq).", "timestamp": 1659035009, "digest": "bd7ymHa2uNXHbplm1VJY32qewbsw_moJ2yvVtvsLVAM", "contributor": "0x659dbD5089A5b6E3747b8C33D24385E8663181e0"}
