{"id": "fIaxpia79jTmLs520pQntzTpoXxEx3pw_IIHpQibm4c", "title": "What is web3", "body": "web3 is the child of web2 and bitcoin. It's a fork of Nakamoto’s blockchain that combines the speed and progress of our technology stack but the values and principles of web1.\n\n![](https://images.mirror-media.xyz/publication-images/819rNg8x_abPDEBZnO5jn.jpeg?height=563&width=1000)\n\nIn 1989 Tim Berners-Lee created the Internet as we know it, with the vision that it should be an open digital network available to all people. This vision allowed the creation of the first open protocols such as HTTP (web pages), SMTP (email), RSS (news), TCP/IP, etc. They were the pillars to build all the digital services and products that we know of.\n\nBut these protocols were limited in functionality and user experience, which led to the emergence of closed platforms that leveraged this open systems to create private networks. By offering better software experiences for free and with venture capital tactics they managed to grow very fast and attract millions of people to its platforms. This evolved and eventually they had so much information about its users that powerful players emerged and with them, an evil business model of personal information exploitation.\n\nEventually, the strategies of these products and services created networks that do not equitably distribute the generated value. They just extract and exploit information that they subsequently monetize.\n\nWeb3 and crypto is a movement that wants to better redistribute the value of our information through a new system based on open source and decentralization. What allows this movement is a new paradigm that proposes a new type of computer. It is a virtual computer that always works and can make commitments about performing actions (smart contracts). It’s maintained by all of us and no one can turn it off or manipulate it.\n\nThe main values ​​proposed by the web3 computational paradigm are the following:\n\n**Privacy**: Although everything in the blockchain is public, privacy refers to not giving our personal data necessarily whenever we use a service, since these data, apart from being private, also has economic value that corporations exploit with our consent or participation.\n\n**Portability**: Through tokens or nft we can now own digital assets. This implies that they are not on a 3rd party private server. This reduces the switching costs that are so high in web2 monopolies, for example, in theory you would be able to move your digital audience to another network. Greater portability means more services that compete among for better quality options and lower commissions. \n\n**Composability**: web3 is primarily about open-source code. These dapps will run forever and cannot be modified. The fact that they are really open invites other entrepreneurs and programmers to build upon them with the confidence that they will not will change because they don’t align anymore with the commercial strategy of a founder. The number of projects that never existed due to the limitations of these closed platforms is incalculable. With web3, hundreds of creative innovations will emerge. For example, there are already defi lending protocols that are open source and are on the blockchain, operating as protocols. In this way, any application will be able to make use of them and create better experiences for the user.\n\n**Identity**: The concept of identity in web3 is that it is ours and we have full control over it. We don’t have to delegate it to centralized entities so that they can exploit it. The idea is that your audience, your content and your data are yours and you can move, hide and modify it. Identity in web3 is now a cryptographic wallet that holds your assets, certificates, social graph and much more.\n\n**Ownership**: Thanks to NFTs we can own the non-fungible, that is, owners of absolutely everything that exists in the digital world. By being the owner, we are also part owner of the networks in which we participate and we have rights over that property. Rights to use it, sell it, rent it, and also gives us the right to vote and governance.\n\nWeb3 is about finance, it's about open economies, about owning the data, about owning", "timestamp": 1657624682, "digest": "17udvR2vN4P7xi-3v4n6Qb88N8zHBpDZhcChk2jeRRM", "contributor": "0x7E0b0363404751346930AF92C80D1fef932Cc48a"}
{"id": "m7uNG_08RTwv3gZJOEgY6pF53ZKjRe2d5PKW9b_SZ-4", "title": "Web3.0-知识学习资源", "body": "在2014年，dot波卡创建人提出web3.0概念\n\n在18年就接触区块链，但由于当于区块链应用还比较少，特别是数字货币处于炒状态，对于web3.0没有太多关注。\n\n2021年由于块链的火爆，开始正式进入区块链，因为这个时候区块链行业已不再只是虚炒了，而是有很多应用，而区块链技术也成为web3.0最重要的技术。\n\n一句话web3.0是一个基于区块链的互联网。\n\n从进入区块链开始，我开始了疯狂的学习web3.0的过程，所以我会把学习的好的资源分享供大家参考，我会不断的更新。\n\n**一、YOUTUBE上学习资源**\n\n**1、web3投资研究**\n\n鉴叔(J Club)\n\nVIC talk\n\nmr block 区块先生\n\n钻石手DiamondHands：专注于价值项目深度分享\n\nAll For Research\n\nMetaMania(专注于NFT）\n\n**二、开发相关**\n\netherscan.io  区块链浏览器，查合约地址、验证合约是否成功。\n\ndappradar.com\n\n智能合约开发框架：Hardhat(javascript) Truffle(javascript) Brownle(python)\n\n**二、web3.0工作相关**\n\nweb3.0时代的工作最大特点是可以远程。\n\n1\\.remote3.co\n\n[https://remote3.co/](https://remote3.co/)\n\n2\\.web3.career\n\n[https://web3.career/](https://web3.career/)\n\n在最后附上vic列的项目分类\n\nDefi系列-入门级去中心化交易所深度解读（uniswap&sushiswap） .\n\nDefi系列-借贷赛道的多维度发展和算法稳定币（Aave&compound&spell）\n\nDefi系列-Defi的造血机器（Curve&Convex）\n\nDefi系列-流动性管理解决方案（tokemak&ohm）\n\nGamefi系列-gamefi的发展历程和龙头项目（axie、星鲨）\n\nGamefi系列-gamefi游戏中的元宇宙（sand、mana、neos）\n\nNFT系列-NFT项究竟有什么价值？（punk、bayc、azuki、otherseide土地、Ape）\n\nDAO赛道系列-什么是DAO？目前web3.0中DAO的发展现状（ant、bitdao)\n\n底层基础设施系列-跨链（layer0、anyswap）\n\n底层基础设施系列-区块链存储（fil、ar）\n\n底层基础设施系列-l2协议（op、arb、polygon)\n\nSocialfi系列-Socialfi有什么价值？为什么我们需要web3社交（ENS）\n\nSocialfi系列-Socialfi的发展现状（lens、cyberconnect\\\\5degrees）\n\n底层基础设施系列-Web3.0世界的流量入口（galaxy、兔子洞）\n\nNFT交易平台--（Opensea、looksrare、x2y2)\n\nNFT借贷平台-（BendDAO、Jpeg、NFTX、NFTFI、FLOORDAO）", "timestamp": 1657624751, "digest": "cFywTcLSauNQjyAcTuJdIAKP-bsOBd5NsDfTOZi8SF8", "contributor": "0x8d5b2fb2610ca51fd336e8262519802c380EB16E"}
{"id": "FuFGrRRrz2-lhoGzd25BLkQ20Kos1Vo52RblJnADUUg", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs.", "timestamp": 1657624812, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
