{"id": "81TB3f2Li54QjEfZ2tIUTTB9EBwGPoz4lZAfunTTzsA", "title": "mirror", "body": "mirror", "timestamp": 1655692407, "digest": "FqXKWdWmafvPstVaTvBS7y-WZrCb4dpaiDvbf3MV0W4", "contributor": "0x4220F85618D0750AeFF84f4aa1cB2B60c6D21279"}
{"id": "dx9pBG5D7eAzqnZkUmLrnfYw_cVvHlzTLWgQsLPOao8", "title": "The web3 revolution", "body": "The Internet is evolving by leaps and bounds and with it a new way of looking at life. Undoubtedly Web3 will bring a technological revolution that will definitely change the way we see the internet.\nThanks to it, we can get closer to decentralization, blockchain and the crypto world.", "timestamp": 1655692511, "digest": "S_27Es_TQckN0d-hLwAHt1NvyL9LGEnEf52bGnVLlTc", "contributor": "0xEd80D5A03e833D05BF190e116f22E5e447b8E39a"}
{"id": "utzQoqqt4s0H4hZAtK8B9A7x6XeyQmC0TS5hdtIZqsc", "title": "mirror", "body": "mirror", "timestamp": 1655692553, "digest": "EyWdffQa2c8x8rHg3OITnqPPH9HvedD95QfZJWSy5rU", "contributor": "0xcaBEDb9d720cC5593c6631b273AfC5c78d8da0A0"}
{"id": "xd7ga93TTCgM7IO_AfTHuQFFB8S56v-1G9GdO1FUuqw", "title": "mirror", "body": "mirror", "timestamp": 1655692683, "digest": "vhCr5MRJRYC_Xb4MwTKjvSUnoDVils4pQ3Bhd4zxV4w", "contributor": "0xe718d5F83F8949FFAb0C21064190DDf07b8910dE"}
{"id": "QZbGNFfit3LDRPcoUkBqOLNbKVvsNNq1hmlBmU5TrIQ", "title": "test'", "body": "333333", "timestamp": 1655692932, "digest": "_bzxJJlCDn0K4YrAh33ntA03DLNxE9OCGeE7FflgD0A", "contributor": "0x96d15eC91bdA5C349736daf26b36a623C72123B8"}
{"id": "uAtfvR2hBUsvL-km8yhoLICwRzcBDmYfdZmjuplPoNQ", "title": "mirror", "body": "mirror", "timestamp": 1655692953, "digest": "LNHNv3sqx2uzBXr1JKC-4H7EdsDWqioSVFAGFKzFpqI", "contributor": "0x8266fed01c52218837F8CE3c49b2efed7bDEDa51"}
{"id": "FesQKK-3j-_UQGqgEcemlE_NlO9MnKq_cnVXsCz0vkI", "title": "Horizontal liquidity: how value crosses the chain", "body": "The essence of liquidity is value exchange. In recent years, the market share of ethereum has been gradually declining and more and more alt-blockchains are widely used. When a new public chain/L2 ecology is formed, users create the need to migrate assets from the original ecology to the new one, as well as to transfer information across chains. I refer to these cross-chain behaviors as horizontal liquidity.\n\nThe need for horizontal liquidity arises when people want to be able to do things between different blockchains that could otherwise be done in the same blockchain. What prevents people from doing so then is the impediment of horizontal liquidity. The value of blockchains lies in their tamper-proof, trustless nature, and these come from a decentralized consensus that makes every transaction trustworthy, thus eliminating deception. And the core of cross-chain lies in the consensus that can be reached and transmitted (even for atomic exchange, it needs to verify the credentials for single point consensus of both parties), which is the basic value of blockchain embodied.\n\nConsensus building and delivery requires that one blockchain be able to reliably access the state of another blockchain. Since each blockchain has its own rules, governance mechanisms, native assets, and data formats, information transfer and asset migration between blockchains is not naturally accessible. Therefore, we need a system to support the transfer of values between two or more blockchains that include assets, contract calls, proofs, or state information.\n\nThis system, which we often call a \"bridge\", relies on the following components to enable state access between blockchains:\n\n1. State monitoring. There is usually a role, such as \"Oracle\", \"Validator\" or \"Relayer\", which is responsible for monitoring the state on the original chain.\n2. Message passing/forwarding. After this role receives an event, it needs to transfer the message from the original chain to the destination chain.\n3. Consensus building. In some models, a consensus is needed between the roles monitoring the original chain in order to pass that information to the destination chain.\n4. Message signature. The actors need to cryptographically sign the message sent to the destination chain, either individually or as part of a threshold signature scheme.\n\nIt can be learned that the reliability of cross-chain migration depends entirely on how the above links work together. They need a verifier to ensure that there are no problems in each link, and the choice of this verifier is the main difference in the way the bridge works: some bridges use trusted systems, others use trustless systems.\n\n# Trusted Bridge\n\nSuch a bridge requires users to trust a third-party institution and allow the third-party institution to hold their funds. The most common type of bridge is that of a centralized exchange, such as the Binance Bridge.\n\nThe advantages of this type of bridge are obvious:\n\n1. Easy to use.\n2. Low cost. Most exchanges only charge a gasoline fee for simple conversions, no on-chain calculations.\n\nBut they also have more obvious disadvantages:\n\n1. No control. In the process of value transfer, users must give up control of their assets.\n2. Limited functionality. Mainly in two aspects, firstly, such bridges are only used to transfer assets and cannot be used for contract calls, proofs or state information transfer, and secondly, they can only be used to transfer CEX listed tokens.\n3. Licensing and trust risk. Users need KYC to use such bridges and need to fully trust the bridge developer and risk that the developer may disconnect the asset bridge at any time, such as [Binance suspends dogecoin withdrawals](https://member.fintech.global/2021/11/12/binance-suspends-dogecoin-withdrawals/#:\\~:text=Crypto%20currency%20exchange%20Binance%20has,version%20update%20on%20November%2011.).\n\n# Trustless Bridge\n\nIt's all about trust. De-trusting means that users don't have to worry about their assets being controlled by third parties, and it also means that such bridges can become public goods.\n\nSo what is trustless? John Adler and Mikerah Quintyne-Collins explain in their [research paper](https://arxiv.org/pdf/1904.06441.pdf) that \"*a blockchain system is trustless if and only if its state (all its state elements) is both valid and secure.*\"\n\nThere are several key words here, state, valid and secure.\n\n1. State. This can be understood as \"who\" has \"what\" at \"any time\", which is recorded by the blockchain.\n2. Valid. This means that the user is able to change the status of the funds for a limited period of time.\n3. Secure. This means that the user's funds cannot be stolen and frozen forever, and only the owner can change the status of the funds.\n\nIt is important to note that trustless does not mean no trust at all, but rather minimizing trust, which is also true for any public chain. A completely message-free cross-chain transaction would be for Alice on blockchain A to send 1000 USDC directly to her wallet address on blockchain B. Alice's wallet address on blockchain B would then receive it directly, just as in the real world I would put money from one wallet into another. This process is completely trustless because there is no third party involved, but this is impossible because different blockchains cannot directly access and modify each other's state directly.\n\nThus, [trust is a spectrum](https://blog.li.fi/li-fi-with-bridges-trust-is-a-spectrum-354cd5a1a6d8), and the degree of trust is different for different mechanisms. If the trust cost of the above example with no trust at all is 0, then the trust cost of a trusted bridge is 1. The trust cost of a trustless bridge is between 0 and 1, mathematically expressed as (0, 1).\n\nWhen it comes to trustless bridges, the first question we need to figure out is, \"[Who is the verifier of the system?](https://blog.connext.network/the-interoperability-trilemma-657c2cf69f17)\", [different design mechanisms](https://blog.li.fi/what-are-blockchain-bridges-and-how-can-we-classify-them-560dc6ec05fa) give different answers.\n\n1. External verification. External validators are not part of any of the related blockchains and are introduced by bridges with their own unique trust assumptions. Dependent on external validators or federations, security depends on the security of the external validator/federations and different collateral mechanisms (described in detail below), such as Thorchain, Anyswap, Biconomy, Celer, Synapse, PolyNetwork, etc.\n2. Optimistic verification. Optimistic verification relies on external verifiers, but by using honest observers to monitor operations and report fraud as verification. Its security depends on the optimistic mechanism, and since the attacker does not know at the time of the attack whether the fraud will be detected or not, this makes it impossible for the attacker to ever be sure that he will be able to successfully steal the funds, thus greatly increasing the economic cost of attacking the system, e.g. Nomad.\n3. Local verification. The two verifiers underlying the relevant blockchain verify each other. Relying on liquidity networks, the atomic exchange process can effectively make it impossible for the validators on each chain to collude and steal funds, however liquidity networks lack cross-chain messaging capabilities and can rely on optimistic or external validation bridges to enhance the functionality of the bridge, thus reducing security, such as Connext, Hop and other atomic exchange systems.\n4. Native verification. All validators at the bottom of the relevant blockchain are responsible for validating the system. Some native validation relies on light clients and relayers, where relayers are handled by oracle or node relayers, where the relayer transmits information from the source chain to the light client of the target chain, and the native validation node will verify the correctness of the information and trigger the corresponding smart contract, so the security depends on the relayer, such as Stargate, Cosmos IBC, Near RainbowBridge, etc.; Some native validation relies on ZKP and security depends on the relevant blockchain, such as Starkgate and other aggregation bridges.\n\n![Bridge's trust spectrum Source: Li.Fi](https://tva1.sinaimg.cn/large/e6c9d24egy1h3a7w545irj20v90fn0ul.jpg)\n\nFrom the above, it is clear that in terms of the degree of trustless, native verification > local verification > optimistic verification > external verification.\n\n## Native vs. Local verification\n\nNative and local verification are originally trustless to the same extent due to their reliance on the relevant blockchain's own verifier. However, native validation cannot support generic data transfer between chains due to the use of atomic exchanges, so some other trust assumptions are often introduced to support more functionality, e.g. Hop is native validation but introduces a fast arbitrary message bridge (AMB) to enable fast bridging of optimistic aggregated funds. The protocol even relies on an externally validated bridge if no AMB exists for a given target chain. Thus, the degree of trustless: native authentication > local authentication.\n\nAtomic exchange is characterized by implementing exchange operations inside a state update, typically including hash time locks and conditional transfers, etc.\n\n> **Atomic exchange across layers:** The naturally connected nature of the first layer across to the second layer allows them to easily perform conditional transfers since they are bookkeeping under the same set of books. Conditional transfers, where the first segment of an operation is triggered by the second segment, are an atomic exchange that is more straightforward than hash locks (HTLCs).\n> There is also a second interlayer spanning between layers. Some people will look at second layer spanning as distinct from cross-chaining, when in fact they have very few differences. The only difference between Layer 2 cross-layers and cross-chains is that they are previously connected through the Layer 1 network, which allows them to communicate through conditional transfers. However, this approach is simply too expensive, requiring each cross-layer to go through the first layer network, and suffers from slow speeds and congestion. As a result, layer 2 cross-layers are often viewed as different blockchains that are not connected.\n\n## Optimistic vs. External verification\n\nOptimistic verification and external verification both essentially have a set of third-party (non-related blockchain) nodes for verification. Beyond the many differences in technical details, the core difference lies in their cryptographic economics.\n\n* External verification (i.e., multi-signature, verifier, PoS, MPC, or threshold signature) cross-chain bridges utilize the honest majority assumption.\n* Optimistic verification uses the observer + fraud proof model, i.e. the verifier assumption of an honest person.\n\nTherefore, from a trustless perspective, optimistic verification requires significantly lower trust costs than external verification.\n\nIn contrast, among external validation, there are two main economic models.\n\n* Bonded: After malicious activity occurs, node collateral is forfeited, but the system does not guarantee to compensate users for losses, e.g. [Polygon PoS Bridge](https://docs.polygon.technology/docs/develop/ethereum-polygon/pos/getting-started/).\n* Insured: After malicious activity occurs, the node collateral is reduced, and the reduced collateral is used to compensate for the user's loss, e.g. [Axelar](https://axelar.network/).\n\nFrom this perspective, an insured external verification bridge can relatively minimize the level of trust.\n\n# Performance of trustless bridges\n\nDifferent authentication mechanisms also bring different security, speed, connectivity, capital efficiency, and statefulness correlations, which are commonly used [to evaluate bridge design](https://medium.com/1kxnetwork/blockchain-bridges-5db6afac44f8).\n\n* Security: trust and validity assumptions, tolerance of malicious actors, security and inversity of user funds.\n* Speed: delay in completing transactions, and assurance of finality. There is often a trade-off between speed and security.\n* Connectivity: The choice of target chains for users and developers, and the different levels of difficulty in integrating additional target chains. Good connectivity means a high degree of compatibility with public chains and not easily limited by differences in consensus algorithms and data structures of different public chains.\n* Capital efficiency: The economics around the capital required to secure the system and the transaction costs of transferring assets.\n* Statefulness: The ability to transfer specific assets, more complex states, and/or perform cross-chain contract calls.\n\nDifferent validation approaches have different trade-offs, each with its own advantages and disadvantages. Although there are some drawbacks to simply adding up the dimensions and calculating the total score for comparison, it seems that, as a rough guide, the total score ZKP > Light Clients & Relayers > Liquidity Networks = Optimistic > External Validators & Federations.\n\n![Performance of bridges with different authentication mechanisms](https://tva1.sinaimg.cn/large/e6c9d24egy1h3a7wgi6akj21150i6aby.jpg)\n\nExternal validations excel in terms of statefulness and connectivity because they can trigger transactions, store data and allow interaction with that data on any number of target chains. Usually such third-party nodes require pledge mechanisms for security, so the capital efficiency of such bridges is minimal. In terms of security, since there are many types of externally verified bridges and different externally verified federations have different consensus algorithm security, their security cannot be generalized, but due to trust assumptions and third-party mechanisms, once the bridge is breached, the user may lose all their money and it will ripple through all the applications associated with the bridge, and their security is the lowest overall.\n\nOptimistic verification, which performs well in terms of statefulness and connectivity, is justified in the same way as external verification. However, due to the mechanism of optimistic verification, it is more capital efficient than external verification but less than bridge designs that do not require the guarantee of a cryptographic economic mechanism. Its speed is also the lowest due to the verification window period. In terms of security, the cost of attacking an Optimistic cross-chain bridge with `n` verifiers is equal to the cost of compromising or hacking `n` verifiers. And relative to external verification, the cost of an attack with `n` verifiers for an external verification cross-chain bridge is equal to the cost of compromising or hacking `m` verifiers, where `m` < `n` . In addition, with optimistic verification, even if `n` verifiers are hacked the attacker is not guaranteed to steal the funds, as long as an honest observer \"catches the fraud\" and revokes the attacker's access to the funds. Therefore, optimistic verification is generally more secure than external verifiers, but less secure than local verification and native verification mechanisms, where an attacker cannot steal funds at all.\n\nLocal validation (liquidity networks) excel in security and speed because the atomic exchange mechanism using hash time locks makes it impossible for funds to be stolen, and local validation without the need for universal consensus greatly increases speed. They are also more capital efficient than bonded/insured external verifiers, as capital efficiency is related to transaction flow/volume rather than security. However, because locally validated systems cannot support common data transfer between chains, their statefulness is poor, which leads to the fact that they often need to introduce other technical support to achieve more functionality, such as Hop's introduction of the Arbitrary Message Bridge (AMB) and Connext's cooperation with Nomad.\n\nNative authentication performs very well in terms of security, capital efficiency and statefulness because it relies on the underlying trust and/or consensus mechanism of the domain to operate, and the blockhead relay system can pass any type of data without any pledge. Likewise, it must be customized for each type of domain. The Ethereum ecosystem is highly heterogeneous: ZK/optimistic aggregation, sidechains, and base chains running a large number of consensus algorithms such as ETH-PoW, Nakamoto-PoW, Tendermint-PoS, Snowball-PoS, PoA, and many others. Each of these areas requires a unique strategy to implement a natively verified interoperability system. In terms of connectivity, a native verification system using ZKP is a bit worse, since not every consensus model can be proven with zero knowledge. In terms of speed, ZKP cross-chain bridges have good low-latency properties and are also likely to be much cheaper than conventional blockhead relay systems because proving consensus does not need to happen on the chain.\n\n> In addition, LayerZero belongs to native authentication, and its innovation, even if small, is very important, introducing a prophecy machine to enable on-demand streaming of blockheads (instead of keeping all blockheads and reducing costs) and guaranteeing security due to the addition of an independent relay system on top of the prophecy machine.\n\n## Statefulness: Universal Messaging\n\nUniversal messaging is the ability to call any contract on different blockchains. So why does the cross-chain approach of locally validated networks not support generic messaging?\n\nIt is actually possible for a locally validated system to implement cross-domain contract calls, but only if the function being called has some form of logical owner. For example, it is possible to trustlessly call Uniswap's swap function across chains, since anyone with an exchangeable token can call the swap function. However, it is not possible to trustlessly lock and mint NFTs across chains in local validation - this is because the logical owner of the `mint` function on the destination chain should be the `lock` contract on the source chain.\n\nIntuitively, locally validated messages are sent from one contract on the chain to the same contract on another chain for function invocation through a single point of mutual validation, completing the transaction and state change within an atomic exchange process, and thus there is a logical problem of invocation; while messages of other validation methods pass the changed (fast) state through multiple points of validation, and there is no logical problem of invocation.\n\n## Connectivity: State Verification and Consensus Reaching\n\nAs already talked about, it is due to the different consensus algorithms of the different chains that break connectivity. How is this understood?\n\nTake the example of a transfer. Briefly, when a transfer occurs, a credential is generated at this point, and another chain learns that this is true than the transfer by verifying the change of credentials before it can initiate the next action. The process of generating this credential is the process of consensus algorithm, and the other chain needs to understand the credential (e.g., verify the hash) to simulate the way the credential is generated, and this is where different consensus algorithms can get in the way. At this point, the logic of ZKP is slightly different again, although the same generation algorithm can be used for ZKP, some of the consensus models are difficult to prove by zero knowledge.\n\n# A little reflection on horizontal mobility\n\nHorizontal liquidity refers to interoperability across chains to support messaging and asset transfer. Currently, there is no solution to the [trilemma](https://blog.connext.network/the-interoperability-trilemma-657c2cf69f17) of horizontal liquidity: trustless, scalability and generalizable. The NXTP proposed by Connext tries to build an interoperable network \"layer 2\" to solve this problem, based on the idea of the second layer of Ethereum, but I think the effectiveness of this solution remains to be examined.\n\nIn the scalability trilemma of Ethereum, it is verification that plays the role of a mortise and tenon structural connector, so it can be developed as a modular blockchain by breaking it down with verification as the mortise and tenon into executing (computation to verify), (verification result to build) consensus and data availability (to verify).\n\nRecently there have been voices talking about modular cross-chain bridges, which try to combine different cross-chain solutions and encapsulate them with the same interface, but this does not change the nature of the logic running under the package, and the problems that should exist remain. We need to find the mortise and tenon structure in the cross-chain problem to be able to disassemble a complex problem cleanly without breaking the original parts. Verification as a cross-chain mortise and tenon structure works because cross-chain is essentially cross-ledger bookkeeping, and the very core point is verification, but due to the differences in consensus mechanisms and data structures of different blockchains, another more core point is cross-chain message identification, because the prerequisite for verification is to identify these data messages (there is no identification problem in L2).\n\nSo how does one go about thinking about cross-chain message recognition as a cross-chain mortise and tenon structure? As mentioned above,\n\n* External verification, digesting cross-chain messages in an external validation federation by deploying our own smart contracts on different chains, so we have to trust this external validation federation and cannot reach trustless.\n* Local verification, where messaging is written in the contract as a form of logical structure (atomic exchange), which directly leads to its lower connectivity and very low statefulness, it can only deliver an exchange logic and not a generic ledger change type of message and cannot reach generalizability.\n* Native verification, messages are delivered directly in the original data structure, reach the target blockchain, and then the data stored in the original blockchain data structure is deconstructed, computed, and validated. This requires a codified medium in between to be able to understand and translate the data structure of the two blockchains. Different consensus algorithms pose a number of challenges, and even ZKP, which is the \"silver bullet\" for verification, encounters translation problems here. Therefore, it is difficult to make native verification scalable.\n\nThere are about two paths I can think of to solve this problem: one is the emergence of ZKP algorithms that support common consensus algorithms; the other is to build a message recognition middleware by non-intermediate consensus.\n\nSome immature thoughts. Feel free to discuss.\n\nMany thanks to Yang Peng and Xiang Wang for proofreading this paper.", "timestamp": 1655693194, "digest": "aFWuw4I8JpUKvinpR45-8mjvu2SAQxeviPT1IpFUwUU", "contributor": "0xCd7C1214359746E1A01Ef4aa8857C43a709062D1"}
{"id": "HVzyBYBXVksUgFsR86PE5HdiaijKPRipiInGJ5yBh4A", "title": "Horizontal liquidity: how value crosses the chain", "body": "The essence of liquidity is value exchange. In recent years, the market share of ethereum has been gradually declining and more and more alt-blockchains are widely used. When a new public chain/L2 ecology is formed, users create the need to migrate assets from the original ecology to the new one, as well as to transfer information across chains. I refer to these cross-chain behaviors as horizontal liquidity.\n\nThe need for horizontal liquidity arises when people want to be able to do things between different blockchains that could otherwise be done in the same blockchain. What prevents people from doing so then is the impediment of horizontal liquidity. The value of blockchains lies in their tamper-proof, trustless nature, and these come from a decentralized consensus that makes every transaction trustworthy, thus eliminating deception. And the core of cross-chain lies in the consensus that can be reached and transmitted (even for atomic exchange, it needs to verify the credentials for single point consensus of both parties), which is the basic value of blockchain embodied.\n\nConsensus building and delivery requires that one blockchain be able to reliably access the state of another blockchain. Since each blockchain has its own rules, governance mechanisms, native assets, and data formats, information transfer and asset migration between blockchains is not naturally accessible. Therefore, we need a system to support the transfer of values between two or more blockchains that include assets, contract calls, proofs, or state information.\n\nThis system, which we often call a \"bridge\", relies on the following components to enable state access between blockchains:\n\n1. State monitoring. There is usually a role, such as \"Oracle\", \"Validator\" or \"Relayer\", which is responsible for monitoring the state on the original chain.\n2. Message passing/forwarding. After this role receives an event, it needs to transfer the message from the original chain to the destination chain.\n3. Consensus building. In some models, a consensus is needed between the roles monitoring the original chain in order to pass that information to the destination chain.\n4. Message signature. The actors need to cryptographically sign the message sent to the destination chain, either individually or as part of a threshold signature scheme.\n\nIt can be learned that the reliability of cross-chain migration depends entirely on how the above links work together. They need a verifier to ensure that there are no problems in each link, and the choice of this verifier is the main difference in the way the bridge works: some bridges use trusted systems, others use trustless systems.\n\n# Trusted Bridge\n\nSuch a bridge requires users to trust a third-party institution and allow the third-party institution to hold their funds. The most common type of bridge is that of a centralized exchange, such as the Binance Bridge.\n\nThe advantages of this type of bridge are obvious:\n\n1. Easy to use.\n2. Low cost. Most exchanges only charge a gasoline fee for simple conversions, no on-chain calculations.\n\nBut they also have more obvious disadvantages:\n\n1. No control. In the process of value transfer, users must give up control of their assets.\n2. Limited functionality. Mainly in two aspects, firstly, such bridges are only used to transfer assets and cannot be used for contract calls, proofs or state information transfer, and secondly, they can only be used to transfer CEX listed tokens.\n3. Licensing and trust risk. Users need KYC to use such bridges and need to fully trust the bridge developer and risk that the developer may disconnect the asset bridge at any time, such as [Binance suspends dogecoin withdrawals](https://member.fintech.global/2021/11/12/binance-suspends-dogecoin-withdrawals/#:\\~:text=Crypto%20currency%20exchange%20Binance%20has,version%20update%20on%20November%2011.).\n\n# Trustless Bridge\n\nIt's all about trust. De-trusting means that users don't have to worry about their assets being controlled by third parties, and it also means that such bridges can become public goods.\n\nSo what is trustless? John Adler and Mikerah Quintyne-Collins explain in their [research paper](https://arxiv.org/pdf/1904.06441.pdf) that \"*a blockchain system is trustless if and only if its state (all its state elements) is both valid and secure.*\"\n\nThere are several key words here, state, valid and secure.\n\n1. State. This can be understood as \"who\" has \"what\" at \"any time\", which is recorded by the blockchain.\n2. Valid. This means that the user is able to change the status of the funds for a limited period of time.\n3. Secure. This means that the user's funds cannot be stolen and frozen forever, and only the owner can change the status of the funds.\n\nIt is important to note that trustless does not mean no trust at all, but rather minimizing trust, which is also true for any public chain. A completely message-free cross-chain transaction would be for Alice on blockchain A to send 1000 USDC directly to her wallet address on blockchain B. Alice's wallet address on blockchain B would then receive it directly, just as in the real world I would put money from one wallet into another. This process is completely trustless because there is no third party involved, but this is impossible because different blockchains cannot directly access and modify each other's state directly.\n\nThus, [trust is a spectrum](https://blog.li.fi/li-fi-with-bridges-trust-is-a-spectrum-354cd5a1a6d8), and the degree of trust is different for different mechanisms. If the trust cost of the above example with no trust at all is 0, then the trust cost of a trusted bridge is 1. The trust cost of a trustless bridge is between 0 and 1, mathematically expressed as (0, 1).\n\nWhen it comes to trustless bridges, the first question we need to figure out is, \"[Who is the verifier of the system?](https://blog.connext.network/the-interoperability-trilemma-657c2cf69f17)\", [different design mechanisms](https://blog.li.fi/what-are-blockchain-bridges-and-how-can-we-classify-them-560dc6ec05fa) give different answers.\n\n1. External verification. External validators are not part of any of the related blockchains and are introduced by bridges with their own unique trust assumptions. Dependent on external validators or federations, security depends on the security of the external validator/federations and different collateral mechanisms (described in detail below), such as Thorchain, Anyswap, Biconomy, Celer, Synapse, PolyNetwork, etc.\n2. Optimistic verification. Optimistic verification relies on external verifiers, but by using honest observers to monitor operations and report fraud as verification. Its security depends on the optimistic mechanism, and since the attacker does not know at the time of the attack whether the fraud will be detected or not, this makes it impossible for the attacker to ever be sure that he will be able to successfully steal the funds, thus greatly increasing the economic cost of attacking the system, e.g. Nomad.\n3. Local verification. The two verifiers underlying the relevant blockchain verify each other. Relying on liquidity networks, the atomic exchange process can effectively make it impossible for the validators on each chain to collude and steal funds, however liquidity networks lack cross-chain messaging capabilities and can rely on optimistic or external validation bridges to enhance the functionality of the bridge, thus reducing security, such as Connext, Hop and other atomic exchange systems.\n4. Native verification. All validators at the bottom of the relevant blockchain are responsible for validating the system. Some native validation relies on light clients and relayers, where relayers are handled by oracle or node relayers, where the relayer transmits information from the source chain to the light client of the target chain, and the native validation node will verify the correctness of the information and trigger the corresponding smart contract, so the security depends on the relayer, such as Stargate, Cosmos IBC, Near RainbowBridge, etc.; Some native validation relies on ZKP and security depends on the relevant blockchain, such as Starkgate and other aggregation bridges.\n\n![Bridge's trust spectrum Source: Li.Fi](https://tva1.sinaimg.cn/large/e6c9d24egy1h3a7w545irj20v90fn0ul.jpg)\n\nFrom the above, it is clear that in terms of the degree of trustless, native verification > local verification > optimistic verification > external verification.\n\n## Native vs. Local verification\n\nNative and local verification are originally trustless to the same extent due to their reliance on the relevant blockchain's own verifier. However, native validation cannot support generic data transfer between chains due to the use of atomic exchanges, so some other trust assumptions are often introduced to support more functionality, e.g. Hop is native validation but introduces a fast arbitrary message bridge (AMB) to enable fast bridging of optimistic aggregated funds. The protocol even relies on an externally validated bridge if no AMB exists for a given target chain. Thus, the degree of trustless: native authentication > local authentication.\n\nAtomic exchange is characterized by implementing exchange operations inside a state update, typically including hash time locks and conditional transfers, etc.\n\n> **Atomic exchange across layers:** The naturally connected nature of the first layer across to the second layer allows them to easily perform conditional transfers since they are bookkeeping under the same set of books. Conditional transfers, where the first segment of an operation is triggered by the second segment, are an atomic exchange that is more straightforward than hash locks (HTLCs).\n> There is also a second interlayer spanning between layers. Some people will look at second layer spanning as distinct from cross-chaining, when in fact they have very few differences. The only difference between Layer 2 cross-layers and cross-chains is that they are previously connected through the Layer 1 network, which allows them to communicate through conditional transfers. However, this approach is simply too expensive, requiring each cross-layer to go through the first layer network, and suffers from slow speeds and congestion. As a result, layer 2 cross-layers are often viewed as different blockchains that are not connected.\n\n## Optimistic vs. External verification\n\nOptimistic verification and external verification both essentially have a set of third-party (non-related blockchain) nodes for verification. Beyond the many differences in technical details, the core difference lies in their cryptographic economics.\n\n* External verification (i.e., multi-signature, verifier, PoS, MPC, or threshold signature) cross-chain bridges utilize the honest majority assumption.\n* Optimistic verification uses the observer + fraud proof model, i.e. the verifier assumption of an honest person.\n\nTherefore, from a trustless perspective, optimistic verification requires significantly lower trust costs than external verification.\n\nIn contrast, among external validation, there are two main economic models.\n\n* Bonded: After malicious activity occurs, node collateral is forfeited, but the system does not guarantee to compensate users for losses, e.g. [Polygon PoS Bridge](https://docs.polygon.technology/docs/develop/ethereum-polygon/pos/getting-started/).\n* Insured: After malicious activity occurs, the node collateral is reduced, and the reduced collateral is used to compensate for the user's loss, e.g. [Axelar](https://axelar.network/).\n\nFrom this perspective, an insured external verification bridge can relatively minimize the level of trust.\n\n# Performance of trustless bridges\n\nDifferent authentication mechanisms also bring different security, speed, connectivity, capital efficiency, and statefulness correlations, which are commonly used [to evaluate bridge design](https://medium.com/1kxnetwork/blockchain-bridges-5db6afac44f8).\n\n* Security: trust and validity assumptions, tolerance of malicious actors, security and inversity of user funds.\n* Speed: delay in completing transactions, and assurance of finality. There is often a trade-off between speed and security.\n* Connectivity: The choice of target chains for users and developers, and the different levels of difficulty in integrating additional target chains. Good connectivity means a high degree of compatibility with public chains and not easily limited by differences in consensus algorithms and data structures of different public chains.\n* Capital efficiency: The economics around the capital required to secure the system and the transaction costs of transferring assets.\n* Statefulness: The ability to transfer specific assets, more complex states, and/or perform cross-chain contract calls.\n\nDifferent validation approaches have different trade-offs, each with its own advantages and disadvantages. Although there are some drawbacks to simply adding up the dimensions and calculating the total score for comparison, it seems that, as a rough guide, the total score ZKP > Light Clients & Relayers > Liquidity Networks = Optimistic > External Validators & Federations.\n\n![Performance of bridges with different authentication mechanisms](https://tva1.sinaimg.cn/large/e6c9d24egy1h3a7wgi6akj21150i6aby.jpg)\n\nExternal validations excel in terms of statefulness and connectivity because they can trigger transactions, store data and allow interaction with that data on any number of target chains. Usually such third-party nodes require pledge mechanisms for security, so the capital efficiency of such bridges is minimal. In terms of security, since there are many types of externally verified bridges and different externally verified federations have different consensus algorithm security, their security cannot be generalized, but due to trust assumptions and third-party mechanisms, once the bridge is breached, the user may lose all their money and it will ripple through all the applications associated with the bridge, and their security is the lowest overall.\n\nOptimistic verification, which performs well in terms of statefulness and connectivity, is justified in the same way as external verification. However, due to the mechanism of optimistic verification, it is more capital efficient than external verification but less than bridge designs that do not require the guarantee of a cryptographic economic mechanism. Its speed is also the lowest due to the verification window period. In terms of security, the cost of attacking an Optimistic cross-chain bridge with `n` verifiers is equal to the cost of compromising or hacking `n` verifiers. And relative to external verification, the cost of an attack with `n` verifiers for an external verification cross-chain bridge is equal to the cost of compromising or hacking `m` verifiers, where `m` < `n` . In addition, with optimistic verification, even if `n` verifiers are hacked the attacker is not guaranteed to steal the funds, as long as an honest observer \"catches the fraud\" and revokes the attacker's access to the funds. Therefore, optimistic verification is generally more secure than external verifiers, but less secure than local verification and native verification mechanisms, where an attacker cannot steal funds at all.\n\nLocal validation (liquidity networks) excel in security and speed because the atomic exchange mechanism using hash time locks makes it impossible for funds to be stolen, and local validation without the need for universal consensus greatly increases speed. They are also more capital efficient than bonded/insured external verifiers, as capital efficiency is related to transaction flow/volume rather than security. However, because locally validated systems cannot support common data transfer between chains, their statefulness is poor, which leads to the fact that they often need to introduce other technical support to achieve more functionality, such as Hop's introduction of the Arbitrary Message Bridge (AMB) and Connext's cooperation with Nomad.\n\nNative authentication performs very well in terms of security, capital efficiency and statefulness because it relies on the underlying trust and/or consensus mechanism of the domain to operate, and the blockhead relay system can pass any type of data without any pledge. Likewise, it must be customized for each type of domain. The Ethereum ecosystem is highly heterogeneous: ZK/optimistic aggregation, sidechains, and base chains running a large number of consensus algorithms such as ETH-PoW, Nakamoto-PoW, Tendermint-PoS, Snowball-PoS, PoA, and many others. Each of these areas requires a unique strategy to implement a natively verified interoperability system. In terms of connectivity, a native verification system using ZKP is a bit worse, since not every consensus model can be proven with zero knowledge. In terms of speed, ZKP cross-chain bridges have good low-latency properties and are also likely to be much cheaper than conventional blockhead relay systems because proving consensus does not need to happen on the chain.\n\n> In addition, LayerZero belongs to native authentication, and its innovation, even if small, is very important, introducing a prophecy machine to enable on-demand streaming of blockheads (instead of keeping all blockheads and reducing costs) and guaranteeing security due to the addition of an independent relay system on top of the prophecy machine.\n\n## Statefulness: Universal Messaging\n\nUniversal messaging is the ability to call any contract on different blockchains. So why does the cross-chain approach of locally validated networks not support generic messaging?\n\nIt is actually possible for a locally validated system to implement cross-domain contract calls, but only if the function being called has some form of logical owner. For example, it is possible to trustlessly call Uniswap's swap function across chains, since anyone with an exchangeable token can call the swap function. However, it is not possible to trustlessly lock and mint NFTs across chains in local validation - this is because the logical owner of the `mint` function on the destination chain should be the `lock` contract on the source chain.\n\nIntuitively, locally validated messages are sent from one contract on the chain to the same contract on another chain for function invocation through a single point of mutual validation, completing the transaction and state change within an atomic exchange process, and thus there is a logical problem of invocation; while messages of other validation methods pass the changed (fast) state through multiple points of validation, and there is no logical problem of invocation.\n\n## Connectivity: State Verification and Consensus Reaching\n\nAs already talked about, it is due to the different consensus algorithms of the different chains that break connectivity. How is this understood?\n\nTake the example of a transfer. Briefly, when a transfer occurs, a credential is generated at this point, and another chain learns that this is true than the transfer by verifying the change of credentials before it can initiate the next action. The process of generating this credential is the process of consensus algorithm, and the other chain needs to understand the credential (e.g., verify the hash) to simulate the way the credential is generated, and this is where different consensus algorithms can get in the way. At this point, the logic of ZKP is slightly different again, although the same generation algorithm can be used for ZKP, some of the consensus models are difficult to prove by zero knowledge.\n\n# A little reflection on horizontal mobility\n\nHorizontal liquidity refers to interoperability across chains to support messaging and asset transfer. Currently, there is no solution to the [trilemma](https://blog.connext.network/the-interoperability-trilemma-657c2cf69f17) of horizontal liquidity: trustless, scalability and generalizable. The NXTP proposed by Connext tries to build an interoperable network \"layer 2\" to solve this problem, based on the idea of the second layer of Ethereum, but I think the effectiveness of this solution remains to be examined.\n\nIn the scalability trilemma of Ethereum, it is verification that plays the role of a mortise and tenon structural connector, so it can be developed as a modular blockchain by breaking it down with verification as the mortise and tenon into executing (computation to verify), (verification result to build) consensus and data availability (to verify).\n\nRecently there have been voices talking about modular cross-chain bridges, which try to combine different cross-chain solutions and encapsulate them with the same interface, but this does not change the nature of the logic running under the package, and the problems that should exist remain. We need to find the mortise and tenon structure in the cross-chain problem to be able to disassemble a complex problem cleanly without breaking the original parts. Verification as a cross-chain mortise and tenon structure works because cross-chain is essentially cross-ledger bookkeeping, and the very core point is verification, but due to the differences in consensus mechanisms and data structures of different blockchains, another more core point is cross-chain message identification, because the prerequisite for verification is to identify these data messages (there is no identification problem in L2).\n\nSo how does one go about thinking about cross-chain message recognition as a cross-chain mortise and tenon structure? As mentioned above,\n\n* External verification, digesting cross-chain messages in an external validation federation by deploying our own smart contracts on different chains, so we have to trust this external validation federation and cannot reach trustless.\n* Local verification, where messaging is written in the contract as a form of logical structure (atomic exchange), which directly leads to its lower connectivity and very low statefulness, it can only deliver an exchange logic and not a generic ledger change type of message and cannot reach generalizability.\n* Native verification, messages are delivered directly in the original data structure, reach the target blockchain, and then the data stored in the original blockchain data structure is deconstructed, computed, and validated. This requires a codified medium in between to be able to understand and translate the data structure of the two blockchains. Different consensus algorithms pose a number of challenges, and even ZKP, which is the \"silver bullet\" for verification, encounters translation problems here. Therefore, it is difficult to make native verification scalable.\n\nThere are about two paths I can think of to solve this problem: one is the emergence of ZKP algorithms that support common consensus algorithms; the other is to build a message recognition middleware by non-intermediate consensus.\n\nSome immature thoughts. Feel free to discuss.\n\nMany thanks to Yang Peng and Xiang Wang for proofreading this paper.", "timestamp": 1655693151, "digest": "aFWuw4I8JpUKvinpR45-8mjvu2SAQxeviPT1IpFUwUU", "contributor": "0xCd7C1214359746E1A01Ef4aa8857C43a709062D1"}
{"id": "moXUlxF4znOSbbW-F7nP2heNCPuSdOreFa2gPhhcS4k", "title": "mirror", "body": "mirror", "timestamp": 1655693240, "digest": "XMv9psswkY8UGDDPn0Vtgw7lReY8gyJBiQkkqPekHL0", "contributor": "0xAc3b763f7882b388CC049101ccF399015e3edb73"}
{"id": "nvdbfiKBKxFVebDKigWddHTRmND_Alkmyq631bYxJ1E", "title": "mirror", "body": "mirror", "timestamp": 1655693089, "digest": "c_4G2-FP1o6bNs8OEWjGsH-ptHxb2aQ557Eqts9v04A", "contributor": "0xc0A37440f36B678A3A4aA891Be2060c5A35c6520"}
{"id": "ux8UE58efc4JLVCiv-MFWlmvm8MeyRPF_tE-iH5pSfA", "title": "Greet the Gymbros", "body": "## Workout with Web 3.0\n\n*Are you a fitness freak? Maybe your healthy habits have being falling behind due to that NFT degen lifestyle? This project is probably one to keep an eye on…*\n\n\n---\n\nAt this point it’s probably moot to say that I heard about this project through a twitter space. It would’ve been one of the first twitter spaces that I listened to, falling sometime after discovering the *[Metabogans](https://mirror.xyz/0x6ca15C7F22e506210C013c639d505EC444989572/vCHv3edPrlfNnlYLoKG5g-DhuPQKx4EfaF1EIC_sryg)*, but before the launch of the *[Aussie Alpha Collective](https://medium.com/@NotRealAqua/list/aussie-alpha-collective-a4fbdb13c936)*. I’m not much of a fitness fanatic myself, but being based out of SE QLD and tying into a real-world business, it was an easy sell to support and mint myself a ‘**Gymbro**’.\n\n![My Gymbro, #7211](https://miro.medium.com/max/1200/0\\*rXg23al68Kdrum_4)\n\nGymbros are a project coming from Queensland’s Gold Coast built around integrating an NFT collection with a real-world gym and a merch line. They have a collection of 10,000 gymbros, each serving as membership to their gym when it launches. Each NFT also entitles holders to 2 free merch drops a year, 50% off their online store and a 1 in 3 chance of receiving a GYMQUEEN from their next collection. Their online store is already live with a variety of apparel on offer, including hoodies, shirts, shorts and more.\n\nIf you’re a gym junkie or someone who wants to add a bit more fitness to their lifestyle, this might be a project to look into. You can go ahead and check them out on ***[their website](https://www.gymbrosnft.com/)***.\n\n\n---\n\n*If you like what you read, go ahead and follow me here, or check out my **[Twitter](https://twitter.com/aquathickshell)** and **[DeSo](https://bitclout.com/u/RealAqua)** profiles to stay up to date with what projects I explore.*", "timestamp": 1655693168, "digest": "KLtX8jjVSqcIEm-SzQqotOsomDbF_RwRzRROQN6q-Dc", "contributor": "0x6ca15C7F22e506210C013c639d505EC444989572"}
{"id": "12lkz-bu7mv4Ju3Mb1f4Co_TKL0d0MBaoJ7-f_PvsGA", "title": "学习笔记-浅谈DAO类型&案例", "body": "## DAO的定义\n\n* DAO-Decentralized Autonomous Organizations是去中心化组织的一种组织形式，是一个由社区领导的实体，没有中央机构。它是完全自主和透明的：智能合约制定基本规则，执行商定的决策，并且在任何时候，提案，投票，甚至代码本身都可以公开审计。\n* DAO完全由其各个成员管理，这些成员共同对项目的未来做出关键决策，例如技术升级和资金分配等。社区成员会创建关于协议未来操作的提案，然后聚集在一起对每个提案进行投票。然后，达到某种预定共识水平的提案将被智能合约中实例化的规则接受并执行。\n\n## DAO的类型\n\n### Protocol DAO\n\n定义：\n\n协议DAO是一种DAO，旨在管理分散的协议，例如借贷应用程序，分散式交易所或其他类型的DApp。\n\n案例：**Maker DAO**\n\nMakerDAO是以太坊区块链网络上的原始DeFi应用程序之一，它使用智能合约使用户能够以定制的贷款利率和可偿还金额借出和借入加密货币。 \n MakerDAO使用MKR治理代币，因此持有者可以对Maker协议的更改进行投票，包括抵押债务头寸（CDP）的抵押品金额，年度借贷以及如果以太坊崩溃时关闭。\n\n[https://makerdao.world/en/learn/governance](https://makerdao.world/en/learn/governance)\n\n### Service DAO\n\n定义：\n\n作为筹款DAO的自然演变，服务DAO是资金和创新相结合的地方，为自己和他人构建有意义的项目和产品。\n\n案例：**PartyDAO**\n\nPartyDAO是一个分散的软件组织，成立于2021年5月，围绕构建多人加密产品的愿景。他们的第一个产品PartyBid V1是一个协议，用于作为一个群体一起购买NFT。\n\n[https://party.mirror.xyz/MFSokSaKwBD7KBCxHFRuHADZ2y8xSdSu-cNJykXJIVo](https://party.mirror.xyz/MFSokSaKwBD7KBCxHFRuHADZ2y8xSdSu-cNJykXJIVo)\n\n### Social DAO\n\n定义：\n\n社交DAO专注于DAO的自组织社区方面，将志同道合的个人（如建筑商，艺术家和创意人员）聚集在一起。 \n 社会DAO通过社会资本，共享经验，友谊和数字原生社区创造激励机制。\n\n案例：**Friends with Benefits**\n\n这是一个web3全球DAO，专注于建立社区和培养创造力。FWB是许多亚文化的发源地，是一个共生关系的生态系统，一个分散的创意工作室和一个活跃的群聊。 进入Friends with Benefits 需要75$FWB令牌，一旦被录取，会员就可以完全访问与建筑商，艺术家，创意人员联系并参加独家活动。\n\n[https://www.fwb.help/](https://www.fwb.help/)\n\n### Investment DAO\n\n定义：\n\n风险DAO汇集资金来投资早期web3初创公司，协议，链下投资，并获得传统金融中不可用的投资组合。\n\n案例：**MetaCartel**\n\n这是一个由创建者和运营商组成的生态系统，为项目提供赠款资金，并为早期分散式应用程序提供运营支持，主要由社区中的个人提供资金。自2019年7月以来，他们已经部署了超过90，000美元的赠款资金，并支持超过23个DApp寻找初始客户和试点机会。\n\n* 帮助早期项目获得客户和用户反馈，我们推动团队获得反馈并尽早启动\n* 帮助某些项目的品牌和视觉设计\n* 帮助制定社区发展战略\n\n[https://www.metacartel.org/](https://www.metacartel.org/)\n\n### Grant DAO\n\n定义：\n\nGrant DAO旨在促进非营利性捐赠，在整个web3生态系统中战略性地部署资本资产，并且是大型项目的慈善扩展，或者是DeFi空间中完全独立的实体。\n\n案例：**Aave Grant DAO**\n\nAave Grants DAO是一个由社区主导的计划，旨在为Aave协议的开发提供动力的想法和项目提供资金，重点是支持更全面的社区开发人员网络。 \n Aave Grants每季度分配指定数量的资金。符合条件的拨款提交包括但不限于 Aave 开发、集成、开发人员工具等。\n\n[https://aavegrants.org/](https://aavegrants.org/)\n\n### Collector DAO\n\n定义：\n\nCollector DAO的主要目的是让成员将资金汇集在一起，以便集体社区可以将国库资金投资于蓝筹NFT艺术品和其他收藏品，其中每个成员拥有与其个人投资相对应的份额。 \n 虽然不是每个收藏家的DAO都会得到回报，但对于投资者来说，在不冒大量个人资本风险的情况下，获得昂贵的NFT的财务敞口是一种新的媒介。\n\n案例：**Flamingo DAO**\n\n这是一个以NFT为重点的DAO，旨在探索可拥有的，基于区块链的资产的新兴投资机会。 \n Flamingo由会员管理，依靠DApp和相关智能合约来促进NFT的购买。\n\n会员将定期同意将Flamingo的部分资产分配到侧袋中。一旦搁置，会员可以向其他成员提议购买一个或多个NFT。如果提案通过（如下所述），会员本身或服务提供商将采取措施收购有争议的资产。\n\n[https://docs.flamingodao.xyz/](https://docs.flamingodao.xyz/)\n\n### Media DAO\n\n定义：\n\n相较于传统的内容以中心议程制作或受广告商影响的形式，媒体DAO通过创建由社区驱动的内容来重塑传统媒体平台。 想想社交媒体，但不是企业组织管理利润，媒体网络中的个人正在积极地赚取分散组织的利润的一部分。\n\n案例：**Bankless DAO**\n\nBanklessDAO是一个分散的社区，负责协调和传播无银行媒体，文化和教育。它的目标是推动以太坊，DeFi和比特币等真正无银行货币系统的采用和认识。\n\n[https://www.bankless.community/](https://www.bankless.community/)\n\n### Education DAO\n\n定义：\n\n教育DAO专注于将人们引入Web3，教他们有关生态系统，区块链和前端开发的知识，并使他们能够成为该领域的建设者。\n\n案例：**Developer DAO**\n\nDevelop DAO的存在是为了加速新一波Web3构建者的教育和影响。目标是 1. Onboard， Educate & Support Web3 Developers， 2. Foster & Build Web3 Tools & Public Goods。要获得开发人员DAO的访问权限，用户可以在公开市场上或从另一个DAO成员那里获得他们的创世NFT之一。\n\n[https://www.developerdao.com/](https://www.developerdao.com/)\n\n## Other References\n\n[https://www.alchemy.com/blog/types-of-daos](https://www.alchemy.com/blog/types-of-daos)\n\n[https://101blockchains.com/types-of-dao](https://101blockchains.com/types-of-dao)\n\n[https://cointelegraph.com/decentralized-automated-organizations-daos-guide-for-beginners/types-of-daos-and-how-to-create-a-decentralized-autonomous-organization](https://cointelegraph.com/decentralized-automated-organizations-daos-guide-for-beginners/types-of-daos-and-how-to-create-a-decentralized-autonomous-organization)\n\n> 本文为仅为个人学习笔记，集合翻译网络资源，相关原文内容索引如上所示。", "timestamp": 1655693343, "digest": "aRutyDomk7XvUrBNvyiStOdyxDgclEPsGNq8FF91rok", "contributor": "0x080b91258E988f643f7124237BC57dE08fCa3F9A"}
{"id": "NgiCI_w9e57jVRlYurXryjyUpInpVi6s7x-MEAPLJFE", "title": "Web3 Onboarding for the Crypto Curious ", "body": "### MetaMask is one of the leading cryptocurrency wallets on the market, with over 1M+ monthly active users across all supported devices and browsers. It is free to use, allowing you to connect and interface with any Web3 websites and applications. If you want to purchase NFTs or interact with exchanges, you will want to familiarize yourself with a wallet like MetaMask. \n\nIn this guide, [Digital Twin](https://digitaltwinlux.io/) will walk you through the process of how to install and set up MetaMask on desktop, as well as mobile for iOS and Android devices. Please note that these instructions may vary slightly depending on which browser you use. Regardless of your browser of choice, you can still follow these steps to learn how to install and set up MetaMask.\n\n## How to Install and Set Up MetaMask on desktop and Mobile\n\nHere is how to set up and install MetaMask on a desktop browser:\n\n1. Download and install the **MetaMask extension** for your browser \n2. Click on the “**Get Started**” button\n3. Select “**Create a Wallet**” and create a **password**\n4. Write down, store, or memorize your **Secret Backup Phrase**\n5. **Confirm your Secret Backup Phrase** to ensure you have it correct\n\nHere is how to set up and install MetaMask on mobile devices:\n\n1. Download and launch the **MetaMask app** from Google Play or the App Store\n2. Click on the “**Get Started**” button\n3. Select “**Create a Wallet**” and create a **password**\n4. Write down, store, or memorize your **Secret Backup Phrase**\n5. **Confirm your Secret Backup Phrase** to ensure you have it correct\n\n### Download and install MetaMask\n\nThe first step is to download the official MetaMask extension, add-on, or application. To set up MetaMask on a mobile device, you will need to visit either Google Play or the App Store. Desktop computer users will need to download the extension or add-on for their browser of choice. MetaMask is currently available for iOS, Android, Chrome (or Brave), Firefox, and Microsoft Edge. Here are the official download links for [MetaMask](https://metamask.io/):\n\n* [App Store (iOS)](https://apps.apple.com/us/app/metamask/id1438144202)\n* [Google Play (Android)](https://play.google.com/store/apps/details?id=io.metamask)\n* [Chrome (or Brave)](https://chrome.google.com/webstore/detail/metamask/nkbihfbeogaeaoehlefnkodbefgpgknn)\n* [Firefox](https://addons.mozilla.org/en-US/firefox/addon/ether-metamask/)\n* [Microsoft Edge](https://microsoftedge.microsoft.com/addons/detail/metamask/ejbalbakoplchlghecdalmeeeajnimhm?hl=en-US)\n\n![If you are adding the MetaMask extension on desktop you will be prompted with a notification similar to the above.](https://images.mirror-media.xyz/publication-images/lIBI5fwsnR0tj_1OJvaJ3.png?height=480&width=888)\n\n### Getting Started\n\nMetaMask has an on-screen setup tutorial for all users on every supported browser. Follow the instructions, read through the terms, and click “I Agree” to continue the setup process.\n\n### Create Your Wallet\n\nThe first step in getting set up with MetaMask is creating a wallet. Click on the “Create a Wallet” button. You will then need to create a password with a minimum of eight characters that you will use to log in to the browser extensions or add-on. \n\n### Secret Backup Phrase\n\nYour Secret Backup Phrase is a way to easily backup and restore your account at any time. It consists of twelve words in a particular sequence. It is essential to memorize this, write it down on a piece of paper and place it in a safe place, or store it in a password manager like [1Password](https://1password.com/) or [LastPass](https://www.lastpass.com/). \n\nWithout your Secret Backup Phrase, it will be impossible to restore your account. You can download the phrase and store it on an external encrypted hard drive or storage device for added security. We do not recommend copy and pasting it into a notepad and leaving it on your desktop. If your computer gets stolen, hacked, or someone finds the file, someone can easily log in to your MetaMask wallet.\n\nConfirm your Secret Backup Phrase on the next on-screen prompt when you have it safely stored. This step ensures you have the correct phrase on hand in case you need to restore your account. After confirming your Secret Backup Phrase, click on the “All Done” button. You have now created a MetaMask wallet and are connected to the Ethereum Mainnet. \n\nThose are the complete steps for how you install and set up MetaMask on PC and Mobile for Chrome, Firefox, Microsoft Edge, iOS, and Android.\n\n## How to find your Ethereum address in MetaMask\n\nAfter installing MetaMask in your browser and the initial setup process is complete, you can click the MetaMask extension or add-on icon from the toolbar. If you are on mobile, just launch the application. The MetaMask interface should now be visible to you, and you will see a string of numbers and letters under “Account 1” near the top of the window. That is your Ethereum address, and you can click on it to copy it to your clipboard.\n\n![](https://images.mirror-media.xyz/publication-images/w3fg0cTCy8G0rLJ-8eRvq.png?height=1190&width=704)\n\n## How to Sync Metamask Across Devices\n\nMetaMask allows you to sync your wallets across multiple devices. To sync your MetaMask mobile app to your MetaMask browser extension or add-on, follow these steps:\n\n1. Open your preferred browser and log in to **MetaMask**. \n2. Tap on the **MetaMask icon** from the browser toolbar to open the interface, and click on your icon on the top right. \n3. Select the “Settings” option, go to “**Advanced**,” and select “**Sync with Mobile**.” You should see a QR code.\n4. Open the **MetaMask mobile application**. \n5. Select the “Sync or Import” option and click on “**Scan QR code**.” \n6. Scan the QR code with your MetaMask mobile app.\n\n![](https://images.mirror-media.xyz/publication-images/E8npKt7T7W0OyWSMX4-GE.png?height=1178&width=1402)\n\n## Still need help? Watch this step by step video on how to setup MetaMask with your mobile device:\n\n[https://www.youtube.com/watch?v=xdKq4QE0e5I](https://www.youtube.com/watch?v=xdKq4QE0e5I)\n\n", "timestamp": 1655693368, "digest": "jcL2uELIgsAoz6RUCcsjGEL5dYjx3o7ZXkQp58IzQDc", "contributor": "0x60FF75FA638c62d3482DBD5C739962eF2E55A44e"}
{"id": "SFp3KGgRl68_43mq8UUxP7Yl3cQs1NXHNhMbi5321Og", "title": "mirror", "body": "mirror", "timestamp": 1655693384, "digest": "Jgld_V90t9aG5CoUYefiKpQ3TnUnX2fXE9RgK2qgoyA", "contributor": "0x90CcEf3d3b510f2561A0984Ef292A21F6009d35c"}
{"id": "5hG7lF4g9_kr2iHLHYw_F88i5Ze_fvULrdtKqAs_yJk", "title": "My second post", "body": "WTF?!", "timestamp": 1655693434, "digest": "VKd1CBoJ4zpS4hwPAIaF3G3qNSGrhX72vByR4js2n_k", "contributor": "0x7be53c45fA6567e26Ea9cC1E2636AB910bb75511"}
{"id": "a8g4WUhJnELvfN7Bjv0l_P6zakVJPJpLUuJQeBNVcj4", "title": "DAO建设——Across成长之路", "body": "![](https://images.mirror-media.xyz/publication-images/8U9ctDopURmz4JqevIEZO.png?height=750&width=1348)\n\n# Across 如何工作？\n\nAcross 是一个[桥接功能](http://across.to/)，并激励中继者向 L1 上的用户提供短期贷款。这些贷款会在两小时内从 L1 的流动资金池中偿还给中继者。一旦来自规范 L2 转移的资金结算，池就会刷新。交易使用 UMA 的[Optimistic Oracle](https://umaproject.org/optimistic-oracle.html) (OO) 进行保险，它充当争议解决层。\n\nOO 验证并验证用户转移资金和获得费用的保险公司之间的所有合同。目前，用户可以将 USDC、ETH 和 UMA 从 L2 Arbitrum 桥接到 L1 以太坊。[在此处](https://medium.com/across-protocol/across-protocol-is-live-and-you-can-be-a-co-founder-43d848a969d1)阅读有关发布的更多信息。\n\n通过提供即时、安全和具有成本效益的交易，Across 将成为生态系统基础设施的关键部分。该协议已提供给社区，以将其构建到整个生态系统中。虽然 UMA 仍在进行 Across 的开发，但社区已经紧密地融入了该项目。 \n 我们的宝贝 DAO 长大了！\n\n当被问及[Across](https://across.to/)的情况如何时，我发现自己用最能引起我共鸣的比喻来回应。启动协议并围绕它创建 DAO 的过程感觉很像抚养孩子的过程。Across 还很年轻，它经历了许多与蹒跚学步的孩子一样的成长痛苦。这并不是说事情进展不顺利。事实上，我会说事情进展得很好。\n\n最初创建 Across 的基金会 Risk Labs 开始了这一旅程，其使命更像是一个想法——建造最快、最便宜的 L2 到 L1 桥，因为它使用了 UMA 的[Optimistic Oracle](https://umaproject.org/optimistic-oracle.html) ，所以它也是最安全的. 这个想法滚雪球般地进入了[公平的发布会](https://medium.com/across-protocol/across-protocol-is-live-and-you-can-be-a-co-founder-43d848a969d1)，因此我们的婴儿 DAO 诞生了。我们甚至不确定这件事是否会奏效，更不用说 DeFi 社区是否愿意采用它并参与这个社会实验。但我们冲锋在前，今天回首往事，我们对这种盲目乐观的做法没有遗憾。\n\n一路走来，我们学到了一些值得在展望未来时分享的东西。\n\n## 跨越工作真的很好\n\n我们的目标是成为最快、最便宜和最安全的桥梁。到目前为止，我们在实现这方面的目标方面做得非常好，我们相信我们可以赢得“谁是最好的桥牌”的比赛。我们似乎能够以独特的方式迎合非常大的转会，这帮助我们很早就开始制定增长战略。\n\n## 我们不能停止建设\n\n风险实验室今天完全可以停止建设，等待社区开发人员完全跟上进度。如果我们决定只做今天所做的事情，这座桥将继续正常运行。但是我们非常喜欢我们的宝宝，我们希望看到它获胜。**Risk Labs 致力于在我们的 DAO 继续发展的同时，投入必要的资源来构建 Across v2。**我们希望看到社区开发者和我们一起参与这个过程。\n\n## 清晰的信息是关键\n\n公平发布背后的想法是社区将决定协议的所有权如何分配。但是，所有权不等于责任。当我们决定推进这个计划时，我们知道有些责任很难分配给社区。例如，智能合约工程是一种学习曲线非常陡峭且容错率很小的东西。我们*预计*社区需要相当长的时间来招募一支优秀的开发人员团队。\n\n从理论上讲，这很有意义。但在实践中，它变得不那么直观。所有权的激进分配 + 责任的逐步分配 + 不完善的信息传递 = 社区偶尔有正当的挫败感。我们很快就学会了这一课。\n\n在我们公开发布的一周内，我们经历了来自社区的创意请求的短暂激增，以重塑 Across 品牌。这不是我们预期的要求，因此我们从未花时间就谁负责品牌管理建立明确的信息。现在回想起来，感觉有点像一个时刻，你必须弄清楚如何告诉你的孩子，他们要到 18 岁才能纹身。你可以继续说，“因为我说过，”但是这个答案一直很糟糕。\n\n开个玩笑，我们有一个非常理解的社区，它最终成为我们退后一步并围绕责任逐渐转移建立一些明确的信息的机会。\n\n## 盲目乐观令人兴奋，路线图带来精神平静\n\n这让我回到了现在。随着我们进入 2022 年，Risk Labs 将汇总我们认为 Across 可以在第一季度和第二季度完成的事情的社区驱动路线图。该路线图将是社区和风险实验室努力的雄心勃勃的组合，并将包括正式推出 Across 代币。敬请关注更多详情！如果您想为 Across DAO 做出贡献，请加入我们的[Discord](https://discord.gg/across)。您也可以在[Twitter 上](https://twitter.com/AcrossProtocol)关注我们以获取更新。\n\n## 为那些想要好好笑的父母准备的奖金部分\n\n**第一阶段：想法**\n\n> *你有一个想法，你认为这是一个非常好的想法。你不知道自己要做什么，但你必须试一试。因此，您开始了这段旅程，并花了几个月的时间来计划您希望如何展开。*\n\n**第 2 阶段：新生儿**\n\n> *你刚刚给这个世界带来了一些美妙的东西，你兴奋得如痴如醉。你创造的这个东西很漂亮，但它也很乱，而且有很多活动部件。您仍然不确定这个婴儿的未来会怎样，但您会尽一切努力帮助他们成长为最好的人。你花时间让这个婴儿活着，你对你在这里看到的潜力感到敬畏。*\n\n**第 3 阶段：蹒跚学步**\n\n> *您的宝宝正在以惊人的速度成长。你总是对他们取得的进步感到惊讶。他们已经开始形成一种身份，他们学习新事物的速度比看起来要快，而且他们几乎完全在当下发挥作用。他们对这个世界有太多的感受，而且他们通常没有所需的工具来一次处理所有这些感受。自然，这意味着他们有时需要发脾气并重新组合。这可能会让您和您的孩子感到沮丧，但您知道这是他们学习生活中最重要的事情的时候，所以您尽最大努力引导他们按照他们的节奏度过这个阶段。*\n\n**第 4 阶段：青少年**\n\n> *你的宝宝不再是这样的宝宝了。他们已经学会了关心他们的基本需求，并且他们正在继续了解他们周围的世界。他们渴望新的体验，他们觉得自己已经准备好独自面对这个世界。在很多时候，他们不同意您的某些决定。您知道他们拥有在世界上取得成功所需的一切，但您仍然渴望保护他们。他们还没有准备好自己做。*\n\n**第五阶段：上大学**\n\n> *你的宝宝现在都长大了，准备好自己面对世界了。他们永远不会知道你在这一刻投入了多少时间和精力。您已经教给他们有效的沟通、资源管理以及如何为社会做出贡献。他们知道他们现在是谁，他们只需要不时的支持。你们都已经完成了达到这一点的工作，现在是时候放手了，看看他们会成为什么样的人。*\n\n145\n\n \n ", "timestamp": 1655693555, "digest": "4XbhbapZaawQ2DcOeJTxpmh8vaY3ri-pJG4Tgri22sk", "contributor": "0x7a71aA2B2adfA4Cccb84E2E7BC226dDbF90cccbb"}
{"id": "YA1gDd8PdjgMJxpXAOhMp286_PP5dsqJWyyEmPoTIbI", "title": "mirror", "body": "mirror", "timestamp": 1655693511, "digest": "wl_gQzBawJmRrjoL-LsiF9Q-6PEbpwZiqFhZhLMBcE8", "contributor": "0x47eE08eC8d39c6a286d41c9CA959Bb597AE941F8"}
{"id": "BAUlwws-lSbtOPZDYQ8hr43TPIqemELSc1vxakkEWQw", "title": "Greet the Gymbros", "body": "## Workout with Web 3.0\n\n*Are you a fitness freak? Maybe your healthy habits have being falling behind due to that NFT degen lifestyle? This project is probably one to keep an eye on…*\n\n\n---\n\nAt this point it’s probably moot to say that I heard about this project through a twitter space. It would’ve been one of the first twitter spaces that I listened to, falling sometime after discovering the *[Metabogans](https://mirror.xyz/0x6ca15C7F22e506210C013c639d505EC444989572/vCHv3edPrlfNnlYLoKG5g-DhuPQKx4EfaF1EIC_sryg)*, but before the launch of the *[Aussie Alpha Collective](https://medium.com/@NotRealAqua/list/aussie-alpha-collective-a4fbdb13c936)*. I’m not much of a fitness fanatic myself, but being based out of SE QLD and tying into a real-world business, it was an easy sell to support and mint myself a ‘**Gymbro**’.\n\n![My Gymbro, #7211](https://miro.medium.com/max/1200/0\\*rXg23al68Kdrum_4)\n\nGymbros are a project coming from Queensland’s Gold Coast built around integrating an NFT collection with a real-world gym and a merch line. They have a collection of 10,000 gymbros, each serving as membership to their gym when it launches. Each NFT also entitles holders to 2 free merch drops a year, 50% off their online store and a 1 in 3 chance of receiving a GYMQUEEN from their next collection. Their online store is already live with a variety of apparel on offer, including hoodies, shirts, shorts and more.\n\nIf you’re a gym junkie or someone who wants to add a bit more fitness to their lifestyle, this might be a project to look into. You can go ahead and check them out on ***[their website](https://www.gymbrosnft.com/)***.\n\n\n---\n\n*If you like what you read, go ahead and follow me here, or check out my **[Twitter](https://twitter.com/aquathickshell)** and **[DeSo](https://bitclout.com/u/RealAqua)** profiles to stay up to date with what projects I explore.*", "timestamp": 1655693650, "digest": "qxMo03vkc1nqMO9sFgsKGULGGagYGovfwj09l7gFkE0", "contributor": "0x6ca15C7F22e506210C013c639d505EC444989572"}
{"id": "EDMbGCBPuj0fwOnrjDRxnvfjbs9En-Vvggx1n1P9zwo", "title": "mirror", "body": "mirror", "timestamp": 1655693659, "digest": "X4VTPdHsrTb1X-kMO0HTsqCnClJ9NJMhVxUDks65ia4", "contributor": "0x11D67aDaf564CF6494c788F7FEf55ffBE0F942cf"}
{"id": "16yWO_tLAm_h-NzWoApYqBoPeoF0Vb7iCWKKcIdNtHM", "title": "A little dash of reality", "body": "**It goes without saying we are living through unprecedented times, at least from a crypto perspective.** \n\nBut even zooming out for a moment the current macroeconomic situation appears to be deteriorating in a way we haven’t experienced for almost a century following the Bretton Woods agreement which established the USD as the global reserve currency. Given this upheaval, it appears for the moment that the days of loose monetary policy, the backdrop to almost all of crypto history, are over. \n\nThe two exceptions to this pattern were brief periods in 2013 and 2018 when quantitative tightening was tentatively explored by central banks, curious 🤔. This is an interesting coincidence in hindsight given both of those periods coincide fairly closely with the last two crypto bear markets. \n\nThis year inflation-fighting central bankers have created significant volatility in global markets particularly in crypto, we have now seen several projects implode spectacularly over the last few months. If we are being honest it is likely this is just the beginning, when the easy money is switched off, many high-risk behaviours that were richly rewarded in the bull are exposed for the gambling they really were, and the subsequent pain that ensues is epic. We need to be realistic about the fact that many projects that have not managed risk well are likely to come under stress in the coming months. Projects that have been risk-averse and maintained a defensive footing are still going to face stress. Even the most defensive projects are not immune to failure in this environment.\n\nThe question each project must ask is how do we deal with this stress, how do we ensure it is discussed within our communities and in the broader crypto ecosystem? It is very tempting to project strength, but this temptation can lead you down a dark path where you are forced to go to greater and greater lengths to hide your growing weaknesses. This strategy inevitably creates opacity and confusion as project leaders try to spin the situation to create the illusion of security. Opacity and obfuscation are antithetical to DeFi. The reality is the only projects that can get away with this kind of behaviour, even for a short time, are centralised entities masquerading as DeFi. A true DeFi project simply cannot hide from the information available on-chain. That said, information on-chain can be hard to interpret and so it is possible, even for DeFi projects, to obfuscate and spin, we must resist this temptation and create a culture of openness and transparency.\n\nWhen we look at some of the recent incidents where founders attempted to quell fear right up until the moment of collapse, reactions tend to fall into two camps, the first is ‘these people were opportunistic psychopaths gaslighting everyone while extracting maximum value until the last minute’. The other end of the spectrum is, ‘these people were blissfully unaware of the risks they were incurring and were themselves shocked when it all fell apart.’ There is a middle ground between these two positions which is a little more generous to everyone involved in these catastrophes. The world is uncertain, it is extremely hard to predict the future and in the face of imperfect information hoping for the best and faking it until you make it are quite reasonable up to a point. The problem with this is you invariably begin obfuscating the truth and minimising risks. Is it any wonder then, that a person faced with such a situation often chooses self-immolation over coming clean and admitting they were hoping for a better outcome and they took too many risks that eventually caught up with them?\n\nIn my view, one of the best things about the Synthetix culture has always been our willingness as a community to confront risk with reasoned arguments and open debate, rather than obfuscation and opacity. Yet I believe the community can still do a better job of communicating risk. The complexity of the staking interfaces has forced most would-be stakers to have a better understanding of the underlying risks than they otherwise might have, but that is not enough. The reality is, staking SNX is high risk and complex, it is one of the most advanced activities you can do in DeFi right now. Come into the discord and watch a prospective staker ask why staking has to be so hard. Then observe as the community patiently explains that staking is high risk and they should ensure they understand their responsibilities before they stake. This has without a doubt limited the uptake of staking! But this is a trade-off the community has embraced fairly well. We can always improve though, there have definitely been times where the inflation-driven high APY from staking has been communicated without clearly calling out all the risks, but in a bull market attention is scarce and it is hard to blame the community for doing whatever it could to attract attention to the protocol and increase awareness given the high noise to signal ratio in bull markets.\n\nThat was quite the preamble, but now for the main point. This post will attempt to capture the current state of Synthetix as best as I can, I have solicited input from numerous people within the community as there are many initiatives and aspects of Synthetix that I am simply unable to keep track of at the level of scale and decentralisation Synthetix operates at.\n\nFirstly let’s look at the tech, Synthetix is running on a four-year-old platform architecture, which is kind of insane when you realise the original Havven contracts were deployed on an Ethereum network that was less than three years old at the time. While this legacy codebase is battle-hardened and well audited, we (either internally or via the community) occasionally find bugs that have been introduced over the years. The primary issue with maintaining this much legacy code is that modifying V2x is very high risk, there is a large amount of technical debt and many design decisions were made years ago by engineers who are no longer working on the project. But circumstances have forced us to respond to shifting market dynamics and recently more and more releases have been tacked on to this legacy code. This is unsustainable and it is time we said goodbye to V2x. The deprecation of V2x is close, but so long as the project is running on this code across two separate networks we are seriously constrained in what we can do and how much we can improve the protocol.\n\nEnter Synthetix V3, a completely redesigned version of the protocol running on an ultra-modern architecture that makes deployments and engineering orders of magnitude easier and safer. Unfortunately, while great progress has been made resources have been repeatedly diverted back to V2x to help with much needed releases and fixes that are inevitable as the market oscillates wildly at the end of an epic bull run. V3 is coming but until it is released the risk within the legacy system design must be considered when assessing the returns from staking SNX.\n\nNow let’s take a look at the economic health of the network. A naive observer would look at the entire history of Synthetix going back to March 2018 through early 2020 and say that based on price alone something seems to be going well. $2 SNX and a market cap of $500m+ looks great on paper. There is an issue though, between the time SNX last traded at $2 in June of 2020 through to today it experienced a 1,500% price appreciation and subsequent decline. With a network like Synthetix, while the incentives are structured to be able to absorb these kinds of cycles, unfortunately even the best incentives are not perfectly symmetrical and so the network is under far more pressure at $2 today than it was back before the start of DeFi summer. It is impossible to predict where the market might bottom from here. We are operating with a macro backdrop that has no equal except possibly the start of Covid, and even that looks like fun compared to what the next six months might bring to financial markets.\n\nGiven we can’t know where the bottom might be, let’s look at two key psychological levels for SNX, $1 and 50c. There is currently around $150m in debt backed by SNX in the network, at $1 SNX, in order to maintain a network ratio over 200% (the target is 300%, but during high volatility, we must expect that some of that buffer will be eroded) we need stakers to continue to pay down their debt even as they absorb liquidations to the tune of around $50m. Thankfully the CC’s were able to implement SIP-148 in time for the move from $5 down to $2, these socialised liquidations have already added significant confidence to the network.\n\nThis is critical to understand, Synthetix is an over-collateralised crypto-backed suite of stablecoins, it CAN implode. It hasn’t yet and this is a testament to the responsiveness of the community to difficult circumstances and a willingness to experiment with novel mechanisms to provide stability. But if BTC nukes to $3k tonight (an albeit unlikely scenario, but like what in the fuck is even happening right now, so who knows) it is extremely likely Synthetix and many other DeFi protocols would struggle to absorb this volatility. Leading to cascading liquidations and chaos. It is certainly possible the Synthetix network and other DeFi projects could recover, but what that would look like is an exercise for another time. The good news is anyone can inspect the health of the network and all of DeFi, of course, you still need to make some assumptions about the responses to incentives of individual participants but all of the data is at least available. \n\nIt is worth discussing governance for a second, I’m planning a much more comprehensive post on what passes for “governance” across much of crypto these days, but that post is still in draft. What we can say is that there is no opaque centralised body the Synthetix network relies on to “guard” the Synthetix protocol. It is incentives all the way down. We have a group of elected Councils that all work together to manage the risk of the network on behalf of token holders, and while these governance bodies have discretion they are ultimately responsible to token holders. So how likely is it that this $50m figure is available to pay down the debt as the collateral value declines? Looking at the major wallets in the ecosystem there is significantly more than $50m in stables at least in principle, available to address debt.\n\nBetween $1 and 50c it is likely a further 50m in debt needs to be absorbed, these numbers are approximations for a number of reasons. The primary one is that it depends on the percentage of the network that is liquidated on the way down, as well as what the price of ETH and BTC do, because the debt pool is skewed long, stakers profit when ETH declines which reduces the debt. This provides some cushion in a falling market. The largest holder of SNX and debt, the treasury council, is committed to servicing its debt which takes a lot of stress off smaller holders. The fact that none of the top twenty wallets have been liquidated even as the price of SNX has declined by 80% also inspires confidence in the commitment of large stakers to the network. But it is critical to understand there are risks here, any protocol or platform that tries to claim it is risk-free is absolutely bullshitting you, as we have all painfully experienced lately. \n\nWhether the rest of the stakers continue to pay down debt will be based on how confident they are the network will remain solvent. At the current SNX/ETH ratio 50c SNX would require ETH below $400, at those levels there will be major stress throughout crypto so predicting the behaviour of individual actors becomes more challenging. But fundamentally, provided there are sufficient well capitalised stakers in the network there is no reason to believe that the debt will not continue to be burned even if the SNX price continues to fall.\n\nThere is some good news though, the recent volatility has led to a significant increase in trading volumes, which means even ignoring inflation, if SNX falls below $1 and exchange volume remains constant, staking yields from sUSD fees generated by the protocol will be well over 20% APY. This should help provide confidence for the stakers who remain and continue to pay down debt as these fees can be put directly to servicing debt each week. The growth has been so profound that less than a week ago I predicted on twitter that Synthetix would flip BTC on daily fees generated, as of a few days ago that came to [pass](https://twitter.com/0x_____________/status/1537667133718646784/photo/1).\n\n![This is now out of date!](https://images.mirror-media.xyz/publication-images/WhCaVy7Q4lTHOf8X4DHKr.png?height=1448&width=1174)\n\nThe other aspect of the project that continues to inspire confidence and honestly gets way too little awareness outside the community is that Synthetix is one of the few protocols that has fully decentralised governance yet is able to maintain a rapid pace of iteration and experimentation. This is simply not even close to being priced in by the market. But as things slow down it will become increasingly clear that the investment in community governance made by Synthetix has created incredible value. This will only accelerate as V3GM launches and other protocols begin to adopt the Synthetix governance framework.\n\nAs the dust settles over the next few months, it will become clear which projects have employed good governance to manage risk and which were picking up pennies in front of steamrollers. Personally, I have made my [decision](https://twitter.com/kaiynne/status/1531432524991168512?s=20&t=DlM7Dhf354Vx3ul1rinl8g) as to how that will play out.\n\n![](https://images.mirror-media.xyz/publication-images/rY3xrjSibYAYZusZyQYKY.png?height=590&width=1178)\n\nWhile it is impossible to have certainty in this environment, one can still maintain conviction. Without conviction, you are dead in the water in crypto. Times like these will test even those of us with the highest conviction, it is worth remembering that it is ok to have doubts and you should always question your assumptions. That is how we move the space forward. \n\nI would like to thank the Synthetix community, Spartan Council members and the core contributors for the dedication, engagement and perseverance they have demonstrated during these challenging times. WMMI.\n\n \n ", "timestamp": 1655693754, "digest": "cHxVE_FTLbwU_VFJCA74mcsXqy_1VZLEqbOGCQJWoQk", "contributor": "0x42f9134E9d3Bf7eEE1f8A5Ac2a4328B059E7468c"}
{"id": "55n3rip6U4dLhLCNVJwrMKgc5b6iCLJr93ZAuAB0t18", "title": "CUN Weekly 6.13-6.19", "body": "![](https://images.mirror-media.xyz/publication-images/XBltC5LqyLUB7Am8w5WZy.png?height=285&width=1400)\n\n**CUN**\n\nCUN held daily quiz in both telegram and discord communities, increasing daily interaction among users.\n\n<https://twitter.com/CUNFans/status/1536173989550346240>\n\n\n---\n\n**NVWA**\n\nOn June 14 Tuesday, NVWA launched NFT series Tao Te Ching in Paintings by painter Mr. WANG Jiachun, including 1500 copies.\n\n \n\nOn June 15 Wednesday, NVWA launched NFT series Characters in Jianghu, with 3000 copies of 6 characters.\n\n \n\nAt 20:00 June 15 Wednesday UTC+8, Paul, the founder of NVWA presented in the AMA. He explained the design logic of Little Stones and Big Stones, as well we the perception of Little Stone DAO development in the future.\n\n \n\nOn June 16 Thursday, NVWA launched NFT series Away from My Ego by Mr. SHI Jiafeng. This series includes 300 NFTs.\n\n \n\nOn June 16 Thursday, NVWA opened the function to merge little stones to big stones.\n\n \n\nIn the evening of June 16 Thursday, NVWA held an AMA with other communities to interpret its latest progress and answer users’ questions.\n\n \n\nIn order to provide better service, NVWA has disbanded the WeChat community at 24:00 16 June UTC+8. All future customer services will be conducted through QQ community and customer service window in NVWA website.\n\n\n---\n\n**Infiniteland**\n\nOn June 13 Monday, Infiniteland announced that it will launch NFTs and gameplays. Also, the team will optimize the website for better user experience.\n\n<https://twitter.com/Infinitelandio/status/1536187505493483521>\n\n \n\nAt 10:00 June 14 Tuesday UTC+8, Infiniteland launched weekly whitelist registration, providing 100 whitelist spots for whitelist users to purchase lands in the initial sale market.\n\n<https://twitter.com/Infinitelandio/status/1536528942576058370>\n\n \n\nAt 10:00 June 15 Wednesday UTC+8, Infiniteland started weekly private sale for whitelist users. This time Satoshi region, the crypto center of Infiniteland is available in this event. \n\n<https://twitter.com/Infinitelandio/status/1536891294945267713>\n\n \n\nAt 10:00 June 17 Friday, UTC+8, Infiniteland launched an inviting contest in discord community, calling on users to invite and win NFT rewards. Users will have chance to win NFTs if they invite 5 or 10 new users.\n\n<https://twitter.com/Infinitelandio/status/1534718282716282881>\n\n \n\nInfiniteland is now hiring angels in Vietnam, Japan, South Korea and Turkey.\n\n<https://twitter.com/Infinitelandio/status/1536185320965672962>\n\n\n---\n\nWebsite: www.coopunion.net\n\nTwitter: twitter.com/CUNFans\n\nMedium: https://coopunionnetwork.medium.com\n\nTelegram: https://t.me/CUNOfficialEnglish\n\nDiscord: https://discord.gg/cunofficial\n\nContact: contact@coopunion.com", "timestamp": 1655693721, "digest": "7lmUq0XMjhIsZrkK0WfipGFVHsRpZVMJbG087oxUwFA", "contributor": "0x3Fb7Fb50CF141a4DaD7862EBa1f7986A31a7e669"}
{"id": "C2G96qUJKdIdFYlPAdBccKYO2umIJBgwEVsxx19Fabc", "title": "A little dash of reality", "body": "**It goes without saying we are living through unprecedented times, at least from a crypto perspective.** \n\nBut even zooming out for a moment the current macroeconomic situation appears to be deteriorating in a way we haven’t experienced for almost a century following the Bretton Woods agreement which established the USD as the global reserve currency. Given this upheaval, it appears for the moment that the days of loose monetary policy, the backdrop to almost all of crypto history, are over. \n\nThe two exceptions to this pattern were brief periods in 2013 and 2018 when quantitative tightening was tentatively explored by central banks, curious 🤔. This is an interesting coincidence in hindsight given both of those periods coincide fairly closely with the last two crypto bear markets. \n\nThis year inflation-fighting central bankers have created significant volatility in global markets particularly in crypto, we have now seen several projects implode spectacularly over the last few months. If we are being honest it is likely this is just the beginning, when the easy money is switched off, many high-risk behaviours that were richly rewarded in the bull are exposed for the gambling they really were, and the subsequent pain that ensues is epic. We need to be realistic about the fact that many projects that have not managed risk well are likely to come under stress in the coming months. Projects that have been risk-averse and maintained a defensive footing are still going to face stress. Even the most defensive projects are not immune to failure in this environment.\n\nThe question each project must ask is how do we deal with this stress, how do we ensure it is discussed within our communities and in the broader crypto ecosystem? It is very tempting to project strength, but this temptation can lead you down a dark path where you are forced to go to greater and greater lengths to hide your growing weaknesses. This strategy inevitably creates opacity and confusion as project leaders try to spin the situation to create the illusion of security. Opacity and obfuscation are antithetical to DeFi. The reality is the only projects that can get away with this kind of behaviour, even for a short time, are centralised entities masquerading as DeFi. A true DeFi project simply cannot hide from the information available on-chain. That said, information on-chain can be hard to interpret and so it is possible, even for DeFi projects, to obfuscate and spin, we must resist this temptation and create a culture of openness and transparency.\n\nWhen we look at some of the recent incidents where founders attempted to quell fear right up until the moment of collapse, reactions tend to fall into two camps, the first is ‘these people were opportunistic psychopaths gaslighting everyone while extracting maximum value until the last minute’. The other end of the spectrum is, ‘these people were blissfully unaware of the risks they were incurring and were themselves shocked when it all fell apart.’ There is a middle ground between these two positions which is a little more generous to everyone involved in these catastrophes. The world is uncertain, it is extremely hard to predict the future and in the face of imperfect information hoping for the best and faking it until you make it are quite reasonable up to a point. The problem with this is you invariably begin obfuscating the truth and minimising risks. Is it any wonder then, that a person faced with such a situation often chooses self-immolation over coming clean and admitting they were hoping for a better outcome and they took too many risks that eventually caught up with them?\n\nIn my view, one of the best things about the Synthetix culture has always been our willingness as a community to confront risk with reasoned arguments and open debate, rather than obfuscation and opacity. Yet I believe the community can still do a better job of communicating risk. The complexity of the staking interfaces has forced most would-be stakers to have a better understanding of the underlying risks than they otherwise might have, but that is not enough. The reality is, staking SNX is high risk and complex, it is one of the most advanced activities you can do in DeFi right now. Come into the discord and watch a prospective staker ask why staking has to be so hard. Then observe as the community patiently explains that staking is high risk and they should ensure they understand their responsibilities before they stake. This has without a doubt limited the uptake of staking! But this is a trade-off the community has embraced fairly well. We can always improve though, there have definitely been times where the inflation-driven high APY from staking has been communicated without clearly calling out all the risks, but in a bull market attention is scarce and it is hard to blame the community for doing whatever it could to attract attention to the protocol and increase awareness given the high noise to signal ratio in bull markets.\n\nThat was quite the preamble, but now for the main point. This post will attempt to capture the current state of Synthetix as best as I can, I have solicited input from numerous people within the community as there are many initiatives and aspects of Synthetix that I am simply unable to keep track of at the level of scale and decentralisation Synthetix operates at.\n\nFirstly let’s look at the tech, Synthetix is running on a four-year-old platform architecture, which is kind of insane when you realise the original Havven contracts were deployed on an Ethereum network that was less than three years old at the time. While this legacy codebase is battle-hardened and well audited, we (either internally or via the community) occasionally find bugs that have been introduced over the years. The primary issue with maintaining this much legacy code is that modifying V2x is very high risk, there is a large amount of technical debt and many design decisions were made years ago by engineers who are no longer working on the project. But circumstances have forced us to respond to shifting market dynamics and recently more and more releases have been tacked on to this legacy code. This is unsustainable and it is time we said goodbye to V2x. The deprecation of V2x is close, but so long as the project is running on this code across two separate networks we are seriously constrained in what we can do and how much we can improve the protocol.\n\nEnter Synthetix V3, a completely redesigned version of the protocol running on an ultra-modern architecture that makes deployments and engineering orders of magnitude easier and safer. Unfortunately, while great progress has been made resources have been repeatedly diverted back to V2x to help with much needed releases and fixes that are inevitable as the market oscillates wildly at the end of an epic bull run. V3 is coming but until it is released the risk within the legacy system design must be considered when assessing the returns from staking SNX.\n\nNow let’s take a look at the economic health of the network. A naive observer would look at the entire history of Synthetix going back to March 2018 through early 2020 and say that based on price alone something seems to be going well. $2 SNX and a market cap of $500m+ looks great on paper. There is an issue though, between the time SNX last traded at $2 in June of 2020 through to today it experienced a 1,500% price appreciation and subsequent decline. With a network like Synthetix, while the incentives are structured to be able to absorb these kinds of cycles, unfortunately even the best incentives are not perfectly symmetrical and so the network is under far more pressure at $2 today than it was back before the start of DeFi summer. It is impossible to predict where the market might bottom from here. We are operating with a macro backdrop that has no equal except possibly the start of Covid, and even that looks like fun compared to what the next six months might bring to financial markets.\n\nGiven we can’t know where the bottom might be, let’s look at two key psychological levels for SNX, $1 and 50c. There is currently around $150m in debt backed by SNX in the network, at $1 SNX, in order to maintain a network ratio over 200% (the target is 300%, but during high volatility, we must expect that some of that buffer will be eroded) we need stakers to continue to pay down their debt even as they absorb liquidations to the tune of around $50m. Thankfully the CC’s were able to implement SIP-148 in time for the move from $5 down to $2, these socialised liquidations have already added significant confidence to the network.\n\nThis is critical to understand, Synthetix is an over-collateralised crypto-backed suite of stablecoins, it CAN implode. It hasn’t yet and this is a testament to the responsiveness of the community to difficult circumstances and a willingness to experiment with novel mechanisms to provide stability. But if BTC nukes to $3k tonight (an albeit unlikely scenario, but like what in the fuck is even happening right now, so who knows) it is extremely likely Synthetix and many other DeFi protocols would struggle to absorb this volatility. Leading to cascading liquidations and chaos. It is certainly possible the Synthetix network and other DeFi projects could recover, but what that would look like is an exercise for another time. The good news is anyone can inspect the health of the network and all of DeFi, of course, you still need to make some assumptions about the responses to incentives of individual participants but all of the data is at least available. \n\nIt is worth discussing governance for a second, I’m planning a much more comprehensive post on what passes for “governance” across much of crypto these days, but that post is still in draft. What we can say is that there is no opaque centralised body the Synthetix network relies on to “guard” the Synthetix protocol. It is incentives all the way down. We have a group of elected Councils that all work together to manage the risk of the network on behalf of token holders, and while these governance bodies have discretion they are ultimately responsible to token holders. So how likely is it that this $50m figure is available to pay down the debt as the collateral value declines? Looking at the major wallets in the ecosystem there is significantly more than $50m in stables at least in principle, available to address debt.\n\nBetween $1 and 50c it is likely a further 50m in debt needs to be absorbed, these numbers are approximations for a number of reasons. The primary one is that it depends on the percentage of the network that is liquidated on the way down, as well as what the price of ETH and BTC do, because the debt pool is skewed long, stakers profit when ETH declines which reduces the debt. This provides some cushion in a falling market. The largest holder of SNX and debt, the treasury council, is committed to servicing its debt which takes a lot of stress off smaller holders. The fact that none of the top twenty wallets have been liquidated even as the price of SNX has declined by 80% also inspires confidence in the commitment of large stakers to the network. But it is critical to understand there are risks here, any protocol or platform that tries to claim it is risk-free is absolutely bullshitting you, as we have all painfully experienced lately. \n\nWhether the rest of the stakers continue to pay down debt will be based on how confident they are the network will remain solvent. At the current SNX/ETH ratio 50c SNX would require ETH below $400, at those levels there will be major stress throughout crypto so predicting the behaviour of individual actors becomes more challenging. But fundamentally, provided there are sufficient well capitalised stakers in the network there is no reason to believe that the debt will not continue to be burned even if the SNX price continues to fall.\n\nThere is some good news though, the recent volatility has led to a significant increase in trading volumes, which means even ignoring inflation, if SNX falls below $1 and exchange volume remains constant, staking yields from sUSD fees generated by the protocol will be well over 20% APY. This should help provide confidence for the stakers who remain and continue to pay down debt as these fees can be put directly to servicing debt each week. The growth has been so profound that less than a week ago I predicted on twitter that Synthetix would flip BTC on daily fees generated, as of a few days ago that came to [pass](https://twitter.com/0x_____________/status/1537667133718646784/photo/1).\n\n![This is now out of date!](https://images.mirror-media.xyz/publication-images/WhCaVy7Q4lTHOf8X4DHKr.png?height=1448&width=1174)\n\nThe other aspect of the project that continues to inspire confidence and honestly gets way too little awareness outside the community is that Synthetix is one of the few protocols that has fully decentralised governance yet is able to maintain a rapid pace of iteration and experimentation. This is simply not even close to being priced in by the market. But as things slow down it will become increasingly clear that the investment in community governance made by Synthetix has created incredible value. This will only accelerate as V3GM launches and other protocols begin to adopt the Synthetix governance framework.\n\nAs the dust settles over the next few months, it will become clear which projects have employed good governance to manage risk and which were picking up pennies in front of steamrollers. Personally, I have made my [decision](https://twitter.com/kaiynne/status/1531432524991168512?s=20&t=DlM7Dhf354Vx3ul1rinl8g) as to how that will play out.\n\n![](https://images.mirror-media.xyz/publication-images/rY3xrjSibYAYZusZyQYKY.png?height=590&width=1178)\n\nWhile it is impossible to have certainty in this environment, one can still maintain conviction. Without conviction, you are dead in the water in crypto. Times like these will test even those of us with the highest conviction, it is worth remembering that it is ok to have doubts and you should always question your assumptions. That is how we move the space forward. \n\nI would like to thank the Synthetix community, Spartan Council members and the core contributors for the dedication, engagement and perseverance they have demonstrated during these challenging times. WMMI.\n\n \n ", "timestamp": 1655693741, "digest": "cHxVE_FTLbwU_VFJCA74mcsXqy_1VZLEqbOGCQJWoQk", "contributor": "0x42f9134E9d3Bf7eEE1f8A5Ac2a4328B059E7468c"}
{"id": "hBKxtONTgvIseY75-SyN4zPoMFn1IKCsXBvO1njwFG4", "title": "Learn and earn at imToken 第二期活动满分答案汇总", "body": "**活动时间：**2022/6/18 19:00 - 2022/07/01 18:00（SGT）\n\n#### 活动规则：\n\n1. 参与答题且得分达到对应类目要求，即可获得 imToken 致敬款 NFT\n2. 活动结束后，随机抽取不同数量的**满分考生瓜分奖金池**（详情见各个答题子页面）\n\n**领取方式：**\n\n1. NFT 奖励：活动结束后的 3 个工作日内在 [Project Galaxy](https://galaxy.eco/imToken/campaign/GCaCTUtHFw) 领取\n2. Token 奖励：活动结束后的 7 个工作日内发放，奖励名单公布在 [imToken Discord](https://discord.gg/G8geW5zsqR)\n\n**答题地址：**\n\n[https://www.campaign.token.im/zh](https://www.campaign.token.im/zh)\n\n\n---\n\n# imToken安全\n\n**1.你被拉入一个电报群，并在群里看到有人在聊「XXX 搬砖套利」，很多群友也在分享已经通过搬砖套利赚了很多钱。这时你应该：**\n\n`马上意识到这是骗局，这个电报群里都是骗子，立刻退出这个群并举报该群`\n\n**2.有人向你推荐项目并告知该项目与 imToken 达成了合作，存 USDT 至 imToken 钱包参与该项目即可享有稳定收益。这时你应该：**\n\n`意识到这可能是骗局，在 App 里联系官方进行求证`\n\n**3.有人自称是「imToken 官方人员」并向你索要钱包助记词或者诱导你在「官方网站」中输入助记词，进而帮你解决问题。这时你应该：**\n\n`马上意识到他是假冒的官方人员，想要通过钓鱼网站骗取助记词，盗走你的资产。然后在 App 内联系 imToken 官方进行举报`\n\n**4.你收到了一条短信通知：imToken 因地区关系，将在近期关停旧版本，请在 XX 链接中下载国际最新版本。这时你应该：**\n\n`马上意识到这是骗局，因为 imToken 是去中心化钱包，不会通过短信或电话联系用户`\n\n**5.你在进行一笔转账，对方发送给你一个收款二维码或链接。你进入转账页面后，以下哪种情况说明你进入的不是骗子制作的假转账页面？**\n\n`转账页面右上角有扫描二维码的图标`\n\n**6.以下几种为常见的骗局？（多选）**\n\n`短信电话诈骗`\n\n`伪装收款码`\n\n`假冒 imToken 官方人员`\n\n`电报群搬砖套利骗局`\n\n\n---\n\n# imKey\n\n**1.imKey Pro 支持的连接方式是？**\n\n`蓝牙&USB`\n\n**2.以下描述不正确的是：**\n\n`imKey Pro 通过互联网连接 imToken，实现数据交互`\n\n**3.以下选项中哪个丢失，会直接造成数字资产损失？**\n\n`助记词`\n\n**4.以下哪种行为会降低助记词安全性？**\n\n`imKey Pro 离线生成的助记词导入热钱包使用`\n\n**5.目前，imKey Pro 支持哪些 Layer2 网络？**\n\n`以上都支持`\n\n**6.创建 imKey Pro 钱包时，需妥善备份以下哪些信息 ？(多选)**\n\n`PIN 码`\n\n`绑定码`\n\n`助记词`\n\n**7.以下哪些是 imKey Pro 使用的正确操作 ？(多选)**\n\n`设置高强度的安全 PIN 码`\n\n`准确抄写绑定码并妥善备份`\n\n`准确抄写助记词并妥善备份`\n\n`imKey Pro 第一次使用前需检查不可逆封条`\n\n**8.imKey Pro 支持以下哪些功能 ？(多选)**\n\n`离线生成和离线存储助记词`\n\n`基础的钱包功能，即收款和转账`\n\n`通过 imToken，实现 DApp 连接与交互`\n\n`支持主流的 Layer2 网络和 EVM 兼容链`\n\n\n---\n\n# Celer\n\n**1.Celer cBridge 是一个什么样的协议？**\n\n`以上都是`\n\n**2.下列关于 cBridge 的说法中，哪项是不正确的？**\n\n`转账手续费直接转到 Celer 团队`\n\n**3.cBridge 目前支持多少种不同的 Blockchain 或 layer2？**\n\n`超过 30`\n\n**4.Celer cBridge 上的两种桥接模型是什么？**\n\n`xLiquidity 和 xAsset`\n\n**5.Celer cBridge 有什么特性？**\n\n`以上都是`\n\n**6.下列关于 Celer 状态守卫者网络（SGN）的说法中，哪项是不正确的？**\n\n`验证者节点可以在网络中进行恶意行为而不会受到惩罚`\n\n\n---\n\n# WePiggy\n\n**1.关于 WePiggy 的官网，以下链接错误的是**\n\n`wepiggy.org`\n\n**2.WePiggy 一共部署了几条公链 / 二层网络**\n\n`12 条`\n\n**3.关于 WPC 的使用场景，以下说法错误的是**\n\n`分红`\n\n**4.WPC 总量为**\n\n`8,000,000,000`\n\n**5.关于 WePiggyV2 规划，以下说法错误的是**\n\n`固定分配流动性产出速率`\n\n**6.为了加强协议的安全性，WePiggy 独创什么功能提醒用户及时还款或补充质押物。**\n\n`清算预警`\n\n\n---\n\n# Nervos\n\n**1.CKB 链上的存储单元叫？**\n\n`Cell`\n\n**2.Nervos 现阶段的主网名称是什么？**\n\n`Mirana`\n\n**3.Nervos 是如何解决可扩展性难题的？**\n\n`分层架构`\n\n**4.在 Nervos Network 中有一个通用的跨链协议，它是____？**\n\n`Force Bridge`\n\n**5.Godwoken 是 Nervos 上兼容 EVM 的 Layer2 高性能框架，Godwoken 的扩容方案是？**\n\n`Rollup`\n\n**6.Godwoken 的安全性由_______来保障，通过 _______在 Layer 2 层确保高吞吐量和安全性。**\n\n`Nervos Layer1，Optimistic Rollup`\n\n**7._______是 CKB 上为了兼容 Ethereum（EVM - Compatible）的解决方案。**\n\n`Polyjuice`\n\n**8.CKB 的基础发行将在______年进行第一次减半？**\n\n`2023`\n\n\n---\n\n# O3-Swap\n\n**1.O3 Swap V2 的版本名是什么？**\n\n`O3 Interchange`\n\n**2.以下哪一个功能可以实现非对称资产的跨链兑换？**\n\n`Swap`\n\n**3.Gas Station 的主要作用是什么？**\n\n`兑换目标链的网络费`\n\n**4.以下哪一个网络不在 O3 Interchange（O3 Swap V2）首批支持列表？**\n\n`Solana`\n\n**5.首发的 LP 池子不包含以下哪个？**\n\n`LP-BNB`\n\n**6.O3 Interchange 的项目 token 是什么？**\n\n`O3`\n\n**7.O3 Interchange 推出的基于 AMM、Trustless 的跨链流动池模式名字叫什么？**\n\n`NPAPs`\n\n**8.O3 官方回购 O3 的费用来自哪里，回购后销毁的比例是多少？**\n\n`手续费收益，80%`\n\n**9.O3 Interchange 为什么被称为跨链 DEX？**\n\n`聚合了源链 + 目标链多个 DEXs`\n\n\n---\n\n# WOOFi\n\n**1.以下哪一个是 WOO Network 旗下的 Defi 平台？**\n\n`WOOFi`\n\n**2.以下哪个功能不是 WOOFi 的主要功能？**\n\n`Farm`\n\n**3.以下哪条公链 WOOFi 目前尚未支持交易？**\n\n`Solana`\n\n**4.用户从 WOOFi Stake 解除质押至少需要多久，可免于解约惩罚？**\n\n`7 天`\n\n**5.WOOFi 透过独家的算法在链上提供 CeFi 级别的流动性，请问做市算法名称是什么？** \n\n`sPMM`\n\n**6.哪些项目可以成为 WOOFi brokers？**\n\n`以上都可以`\n\n**7.在 Fantom 上，WOOFi 拥有超过 260 万美元的交易量和高达 1,031% 的换手率，占用资金为？**\n\n`30万`\n\n**8.以下哪一项是 WOOFi 优势特点?**\n\n`以上都是`\n\n**9.以下哪一项是 WOOFi 计划推出的新功能?**\n\n`以上都是`\n\n**10.WOOFi 目前交易手续費率是多少？**\n\n`0.025%`\n\n\n---\n\n# XY-Finance\n\n**1.XY Finance 上的一站式任意 token 跨链交换器叫________。**\n\n`X Swap`\n\n**2.XY Finance 现阶段没支持哪个币种？**\n\n`以上币种 XY Finance 都支持`\n\n**3.XY Finance 目前没有支持哪条链？**\n\n`Gnosis Chain`\n\n**4.XY Finance 如何确保最佳交易价格？**\n\n`XY Finance 有集成多个桥和部署多个 DEX 聚合器`\n\n**5.XY Finance 是如何运作的？**\n\n`XY Finance 只能支持单币种跨链`\n\n**6.以下哪项不是 XY Token 在 XY Finance 中扮演什么角色？**\n\n`XY Token 是桥接 Token，以确保用户获得即时的兑换体验`\n\n**7.在 XY Finance 中跨链交易需要多长时间？**\n\n`2 - 10 分钟`\n\n**8.在 XY Finance 上可以设定滑点？**\n\n`可以`\n\n\n---\n\n### 最后，欢迎感兴趣的朋友关注我：\n\n#### Twitter：\n\n[https://twitter.com/0xXXXXFin](https://twitter.com/0xXXXXFin)\n\n**Mirror：**\n\n[https://mirror.xyz/0x368aa1F6D0E63bd8E26D2F5e8d5422A9F7fd114E](https://mirror.xyz/0x368aa1F6D0E63bd8E26D2F5e8d5422A9F7fd114E)\n\n**Medium：**\n\n[https://medium.com/@XXXXFin](https://medium.com/@XXXXFin)\n\n", "timestamp": 1655693896, "digest": "STmf2H1Ek6K-FwW2N7eFmJiwBUhDhUM_fwzqtc1x8yg", "contributor": "0x368aa1F6D0E63bd8E26D2F5e8d5422A9F7fd114E"}
{"id": "yepJ9aCVdUFu-zrw2e9zwMeTzy0byPM0PQiVv2merAg", "title": "A little dash of reality", "body": "**It goes without saying we are living through unprecedented times, at least from a crypto perspective.** \n\nBut even zooming out for a moment the current macroeconomic situation appears to be deteriorating in a way we haven’t experienced for almost a century following the Bretton Woods agreement which established the USD as the global reserve currency. Given this upheaval, it appears for the moment that the days of loose monetary policy, the backdrop to almost all of crypto history, are over. \n\nThe two exceptions to this pattern were brief periods in 2013 and 2018 when quantitative tightening was tentatively explored by central banks, curious 🤔. This is an interesting coincidence in hindsight given both of those periods coincide fairly closely with the last two crypto bear markets. \n\nThis year inflation-fighting central bankers have created significant volatility in global markets particularly in crypto, we have now seen several projects implode spectacularly over the last few months. If we are being honest it is likely this is just the beginning, when the easy money is switched off, many high-risk behaviours that were richly rewarded in the bull are exposed for the gambling they really were, and the subsequent pain that ensues is epic. We need to be realistic about the fact that many projects that have not managed risk well are likely to come under stress in the coming months. Projects that have been risk-averse and maintained a defensive footing are still going to face stress. Even the most defensive projects are not immune to failure in this environment.\n\nThe question each project must ask is how do we deal with this stress, how do we ensure it is discussed within our communities and in the broader crypto ecosystem? It is very tempting to project strength, but this temptation can lead you down a dark path where you are forced to go to greater and greater lengths to hide your growing weaknesses. This strategy inevitably creates opacity and confusion as project leaders try to spin the situation to create the illusion of security. Opacity and obfuscation are antithetical to DeFi. The reality is the only projects that can get away with this kind of behaviour, even for a short time, are centralised entities masquerading as DeFi. A true DeFi project simply cannot hide from the information available on-chain. That said, information on-chain can be hard to interpret and so it is possible, even for DeFi projects, to obfuscate and spin, we must resist this temptation and create a culture of openness and transparency.\n\nWhen we look at some of the recent incidents where founders attempted to quell fear right up until the moment of collapse, reactions tend to fall into two camps, the first is ‘these people were opportunistic psychopaths gaslighting everyone while extracting maximum value until the last minute’. The other end of the spectrum is, ‘these people were blissfully unaware of the risks they were incurring and were themselves shocked when it all fell apart.’ There is a middle ground between these two positions which is a little more generous to everyone involved in these catastrophes. The world is uncertain, it is extremely hard to predict the future and in the face of imperfect information hoping for the best and faking it until you make it are quite reasonable up to a point. The problem with this is you invariably begin obfuscating the truth and minimising risks. Is it any wonder then, that a person faced with such a situation often chooses self-immolation over coming clean and admitting they were hoping for a better outcome and they took too many risks that eventually caught up with them?\n\nIn my view, one of the best things about the Synthetix culture has always been our willingness as a community to confront risk with reasoned arguments and open debate, rather than obfuscation and opacity. Yet I believe the community can still do a better job of communicating risk. The complexity of the staking interfaces has forced most would-be stakers to have a better understanding of the underlying risks than they otherwise might have, but that is not enough. The reality is, staking SNX is high risk and complex, it is one of the most advanced activities you can do in DeFi right now. Come into the discord and watch a prospective staker ask why staking has to be so hard. Then observe as the community patiently explains that staking is high risk and they should ensure they understand their responsibilities before they stake. This has without a doubt limited the uptake of staking! But this is a trade-off the community has embraced fairly well. We can always improve though, there have definitely been times where the inflation-driven high APY from staking has been communicated without clearly calling out all the risks, but in a bull market attention is scarce and it is hard to blame the community for doing whatever it could to attract attention to the protocol and increase awareness given the high noise to signal ratio in bull markets.\n\nThat was quite the preamble, but now for the main point. This post will attempt to capture the current state of Synthetix as best as I can, I have solicited input from numerous people within the community as there are many initiatives and aspects of Synthetix that I am simply unable to keep track of at the level of scale and decentralisation Synthetix operates at.\n\nFirstly let’s look at the tech, Synthetix is running on a four-year-old platform architecture, which is kind of insane when you realise the original Havven contracts were deployed on an Ethereum network that was less than three years old at the time. While this legacy codebase is battle-hardened and well audited, we (either internally or via the community) occasionally find bugs that have been introduced over the years. The primary issue with maintaining this much legacy code is that modifying V2x is very high risk, there is a large amount of technical debt and many design decisions were made years ago by engineers who are no longer working on the project. But circumstances have forced us to respond to shifting market dynamics and recently more and more releases have been tacked on to this legacy code. This is unsustainable and it is time we said goodbye to V2x. The deprecation of V2x is close, but so long as the project is running on this code across two separate networks we are seriously constrained in what we can do and how much we can improve the protocol.\n\nEnter Synthetix V3, a completely redesigned version of the protocol running on an ultra-modern architecture that makes deployments and engineering orders of magnitude easier and safer. Unfortunately, while great progress has been made resources have been repeatedly diverted back to V2x to help with much needed releases and fixes that are inevitable as the market oscillates wildly at the end of an epic bull run. V3 is coming but until it is released the risk within the legacy system design must be considered when assessing the returns from staking SNX.\n\nNow let’s take a look at the economic health of the network. A naive observer would look at the entire history of Synthetix going back to March 2018 through early 2020 and say that based on price alone something seems to be going well. $2 SNX and a market cap of $500m+ looks great on paper. There is an issue though, between the time SNX last traded at $2 in June of 2020 through to today it experienced a 1,500% price appreciation and subsequent decline. With a network like Synthetix, while the incentives are structured to be able to absorb these kinds of cycles, unfortunately even the best incentives are not perfectly symmetrical and so the network is under far more pressure at $2 today than it was back before the start of DeFi summer. It is impossible to predict where the market might bottom from here. We are operating with a macro backdrop that has no equal except possibly the start of Covid, and even that looks like fun compared to what the next six months might bring to financial markets.\n\nGiven we can’t know where the bottom might be, let’s look at two key psychological levels for SNX, $1 and 50c. There is currently around $150m in debt backed by SNX in the network, at $1 SNX, in order to maintain a network ratio over 200% (the target is 300%, but during high volatility, we must expect that some of that buffer will be eroded) we need stakers to continue to pay down their debt even as they absorb liquidations to the tune of around $50m. Thankfully the CC’s were able to implement SIP-148 in time for the move from $5 down to $2, these socialised liquidations have already added significant confidence to the network.\n\nThis is critical to understand, Synthetix is an over-collateralised crypto-backed suite of stablecoins, it CAN implode. It hasn’t yet and this is a testament to the responsiveness of the community to difficult circumstances and a willingness to experiment with novel mechanisms to provide stability. But if BTC nukes to $3k tonight (an albeit unlikely scenario, but like what in the fuck is even happening right now, so who knows) it is extremely likely Synthetix and many other DeFi protocols would struggle to absorb this volatility. Leading to cascading liquidations and chaos. It is certainly possible the Synthetix network and other DeFi projects could recover, but what that would look like is an exercise for another time. The good news is anyone can inspect the health of the network and all of DeFi, of course, you still need to make some assumptions about the responses to incentives of individual participants but all of the data is at least available. \n\nIt is worth discussing governance for a second, I’m planning a much more comprehensive post on what passes for “governance” across much of crypto these days, but that post is still in draft. What we can say is that there is no opaque centralised body the Synthetix network relies on to “guard” the Synthetix protocol. It is incentives all the way down. We have a group of elected Councils that all work together to manage the risk of the network on behalf of token holders, and while these governance bodies have discretion they are ultimately responsible to token holders. So how likely is it that this $50m figure is available to pay down the debt as the collateral value declines? Looking at the major wallets in the ecosystem there is significantly more than $50m in stables at least in principle, available to address debt.\n\nBetween $1 and 50c it is likely a further 50m in debt needs to be absorbed, these numbers are approximations for a number of reasons. The primary one is that it depends on the percentage of the network that is liquidated on the way down, as well as what the price of ETH and BTC do, because the debt pool is skewed long, stakers profit when ETH declines which reduces the debt. This provides some cushion in a falling market. The largest holder of SNX and debt, the treasury council, is committed to servicing its debt which takes a lot of stress off smaller holders. The fact that none of the top twenty wallets have been liquidated even as the price of SNX has declined by 80% also inspires confidence in the commitment of large stakers to the network. But it is critical to understand there are risks here, any protocol or platform that tries to claim it is risk-free is absolutely bullshitting you, as we have all painfully experienced lately. \n\nWhether the rest of the stakers continue to pay down debt will be based on how confident they are the network will remain solvent. At the current SNX/ETH ratio 50c SNX would require ETH below $400, at those levels there will be major stress throughout crypto so predicting the behaviour of individual actors becomes more challenging. But fundamentally, provided there are sufficient well capitalised stakers in the network there is no reason to believe that the debt will not continue to be burned even if the SNX price continues to fall.\n\nThere is some good news though, the recent volatility has led to a significant increase in trading volumes, which means even ignoring inflation, if SNX falls below $1 and exchange volume remains constant, staking yields from sUSD fees generated by the protocol will be well over 20% APY. This should help provide confidence for the stakers who remain and continue to pay down debt as these fees can be put directly to servicing debt each week. The growth has been so profound that less than a week ago I predicted on twitter that Synthetix would flip BTC on daily fees generated, as of a few days ago that came to [pass](https://twitter.com/0x_____________/status/1537667133718646784/photo/1).\n\n![This is now out of date!](https://images.mirror-media.xyz/publication-images/WhCaVy7Q4lTHOf8X4DHKr.png?height=1448&width=1174)\n\nThe other aspect of the project that continues to inspire confidence and honestly gets way too little awareness outside the community is that Synthetix is one of the few protocols that has fully decentralised governance yet is able to maintain a rapid pace of iteration and experimentation. This is simply not even close to being priced in by the market. But as things slow down it will become increasingly clear that the investment in community governance made by Synthetix has created incredible value. This will only accelerate as V3GM launches and other protocols begin to adopt the Synthetix governance framework.\n\nAs the dust settles over the next few months, it will become clear which projects have employed good governance to manage risk and which were picking up pennies in front of steamrollers. Personally, I have made my [decision](https://twitter.com/kaiynne/status/1531432524991168512?s=20&t=DlM7Dhf354Vx3ul1rinl8g) as to how that will play out.\n\n![](https://images.mirror-media.xyz/publication-images/rY3xrjSibYAYZusZyQYKY.png?height=590&width=1178)\n\nWhile it is impossible to have certainty in this environment, one can still maintain conviction. Without conviction, you are dead in the water in crypto. Times like these will test even those of us with the highest conviction, it is worth remembering that it is ok to have doubts and you should always question your assumptions. That is how we move the space forward. \n\nI would like to thank the Synthetix community, Spartan Council members and the core contributors for the dedication, engagement and perseverance they have demonstrated during these challenging times. WMMI.\n\n \n ", "timestamp": 1655693723, "digest": "cHxVE_FTLbwU_VFJCA74mcsXqy_1VZLEqbOGCQJWoQk", "contributor": "0x42f9134E9d3Bf7eEE1f8A5Ac2a4328B059E7468c"}
{"id": "ZvRWUUmjmhay8wzcYzinrf2_O6D4rgx2_jeLAgZlbJg", "title": "mirror", "body": "mirror", "timestamp": 1655693978, "digest": "RLUQj5ith9GqrP16Vz-tbizCfoDPws-gyO4nnl2C7gw", "contributor": "0x4a639AF850F8DB1626398759CA5c0C4EaFec6399"}
{"id": "EIC1zJH0XqOpt4BobR96oz_oUN4oDmBz9CyFWdXu0sU", "title": "每日国外区块链发展动态回顾-2022年6月18至20日", "body": "每日国外区块链发展动态回顾-2022年6月18至20日\n按：做这个系列源于：现在是按区块链名人或项目的推特号，从研究之日起，大约研究半年左右（根据其推文内容，有部分高产推主，可能只研究其当年的内容，大约每个专题8000-12000字就停止）其发展动态，摘选一些我认为重要、有价值的信息，这样重复下来，一个人物或项目研究毕后，基本要数月甚至很长时间不再看他的推文，这就忽略了一些高产、有价值、经常发布的推主最新的内容，也遗漏了他们对当前市场、行业及项目的分析和看法，这是可惜的；所以，我会在之前研究的推主中选择若干我认为会有精彩观点的推主（初步定30人左右，以后可能会调整）每日（基本仅限当日）推文，进行阅读并分享之，此为些专题系列的出发点；研究时间定为每日上午九点（中国比美国早12个小时）； 初步选定的这三十人（暂时是42个）为：Dovey Wan，Andre Cronje，Hayden Adams，SBF，cz_binance，VitalikButerin，Rune Christensen，Stani Kulechov，Robert Leshner @rleshner，Kain Warwick @kaiynne，Juan Benet，Gavin Wood，Anatoly Yakovenko @aeyakovenko，Dominic Williams， Daniel Larimer，... 第一次调整(2021年5月11日)：会删除一些不活跃的推特主；增加一些我重点关注可能亲身实践的项目每日资料，本次包括：IDENA; ETHSWARM BEE; ZKSYNC; ZK.MONEY; TORN; POAP.XYZ；Float Protocol，Index Coop，EPNS，MASK。 第二次调整（2021年6月9日）：删除ameen.eth @ameensol,PlanB @100trillionUSD；增加THORChain #THORNAMES，@THORChain； 第三次调整（2021年8月12日）；删除DeeZe，@DeezeFi；Eric Wall @ercwl；Jason Choi，@mrjasonchoi；Ethereum Swarm，@ethswarm；Mask Network([Mask.io](http://Mask.io)),@realmaskbook；Bored Ape Yacht Club，@BoredApeYC；DystopianPunks，@DystopianPunks；增加：Decentraland，，@decentraland；Unstoppable Domains,@unstoppableweb；The Sandbox，@TheSandboxGame. @TheSandboxGame. 第四次调整：（2021年11月）增加Project Galaxy，Ethereum Name Service，Arbitrum，Rarity Game，Project Galaxy，abracadabra.money，Coinbase NFT，Optimism，StarkWare，（mim稳定币）六个项目的观察。 第五六次调整：（2022.1.4）增加Arweave，Cosmos， Helium， 第七次调整：（2022.1.18），删除@FlootFamiliars，@RarityGame；增加Messari，NEAR Protocol,Dune Analytics\nDune Analytics,@DuneAnalytics,Free crypto analytics by and for the community\n本周排名前 10 的仪表板：1/ Crypto VC Funds (3AC, Wintermute, Jump) By @JamesCliffyz，2/ Yearn Governance - a Dive into Proposals By @Mausefalle25，3/ Growth Analysis 1inch vs 0x By @0xProject，4/ Opensea Seaport By @marcov_91，5/ Metaverse Mega Dashboard By @RZinovyev，6/ NFT Floor Price Analysis By @0xManny，7/ RabbitHole Credential NFTs By @gm3658/ ZkSync By @RZinovyev，9/ Dework By @PandaJackson42，10/ Lens NFT Polygon Overview By @superamscom\nDune Digest 的第 34 期已在您的收件箱中上线 本星期： - 加密风险投资组合 - @opensea 的海港 - NFTs 和 Metaverse rekt 吗？ - @iearnfinance 治理 壮举。 慄‍♂️ - @JamesCliffyz - @marcov_91 - @0xManny - @RZinovyev - @1chioku 检查它\nMessari，@MessariCrypto， Explore key trends, people, and projects to watch\n1/ 第 1 层很难以绝对值估值，因为它们在一个独立的系统中运行，仅以其本国货币产生流量。 那么我们如何才能得出准确的估值呢？ 让我们从@kunalgoel 开始探索本报告中的相对论。 2/ 关键问题是第 1 层不与法定交互作为其业务运营的一部分。 他们的收入和成本以原生代币计价。 随着代币价格以法定形式发生变化，区块链的盈利能力也会发生变化。 3/ 我们可以探索不同类别的第 1 层，并根据彼此和其他相关协议比较它们的估值。 相对估值可以帮助投资者建立对市场风险中性但仍能产生回报的多空头寸。 4/ 例如，将他们当前的头寸与 180 天的平均值进行比较；我们注意到，在最近的崩盘中，BTC/ETH 的上涨幅度比$DOGE / $SHIB高得多。 这种不匹配表明与$ETH和/或$DOGE相比， $BTC和/或$SHIB目前被高估了。 5/ 使用相对估值最重要的好处是它通过帮助创建 delta 中性策略来降低市场风险。 在不确定的时期，当市场极度波动时，相对估值仍然可以在有限的市场风险下产生回报。 6/ 相对估值可以帮助发现潜在的价值和价格不匹配，而不会产生个人偏见，并且对广泛市场风险的敞口有限。 欲了解更多信息，请浏览关于相对论的完整企业报告，来自 @kunalgoel 。\n1/ 15,000 多位与会者，400 多场演讲，100 多华氏度和 100 多场晚会， @consensus2022 在书中。 让我们在他最新的分析师报告中探讨@dunleavy89 的 2022 年共识回顾和要点。 淋 2/ @terra_money 崩溃后，监管成为每个人的首要考虑也就不足为奇了。 能用一两次迅捷的打击就能在我们的新兴产业中钉上钉子的一把锤子是美国这样的国家的惩罚性监管， 3/ 每个主要的 L1 或 L2 都有某种互动展位来展示他们正在做的事情。 消息在前面全速前进。许多这些协议的进展是显而易见的。 查看提出的路线图，它只会有所改善。 4/ 为了达到下一个加密水平，我们需要外部资金流入零售之上。长期以来，机构一直是这个目标。 这些人不仅在网络上，而且在参与。 5/ 尽管市场价格上涨，但人们的情绪依然高涨。 对话并非围绕市场展开。 在场的每个人都宣扬每次互动的主题是如何连接和扩展。 6/ @consensus2022 是一个充满活力的展览，展示了加密货币已经构建了什么以及我们仍然需要构建什么。 查看来自@dunleavy89 的关于 Consensus 的 2022 年回顾和总结的完整分析师说明。\n我们没有关于持股/资产的详细信息，但这是 Messari 为 3AC 提供的最后一个公开可用的筛选器。\n1/ 在为合并做准备时， @ethereum 正在转向“以汇总为中心的路线图”。 它计划结合最好的链上和链下扩展解决方案。 让我们在@0xallyzach 的这份报告中探索@ethereum 以汇总为中心的未来。 淋 2/ Rollups 是该领域最突出的第 2 层扩展解决方案。 它们可以按其验证和数据存储方法进行分类。 所有汇总都将链下的大量交易数据聚合成批次，并通过共识将结果发布回主网。 3/ 乐观汇总，如@arbitrum 或@optimismPBC ，假设所有事务从一开始就有效。 为了保护这些交易，它们提供了一个挑战期，验证者可以通过父链上的欺诈证明来质疑交易的合法性。 4/ 零知识 (ZK)-rollups 与@StarkWareLtd 类似，类似于 Optimistic rollups，因为它们结合了大量的链下交易并将批处理版本提交回主网。 然而，ZK-rollups 使用有效性证明来即时验证交易。 5/ 分片是一种水平的链上扩展解决方案，它增加了链可以有效处理的活动量。 每个分片将与检查数据可用性的节点子集一起运行。 6/ Danksharding 使以 Rollup 为中心的路线图变得可行。 它将以太坊变成了一个结算和数据可用性层，并将可扩展性置于第 2 层汇总的手中。 7/ Optimistic 和 ZK-rollups 的显着优势在于它们解决了@ethereum 的可扩展性问题，而不会影响安全性和去中心化。 有关更多信息，请浏览 ( @0xallyzach ) 中关于@ethereum 以汇总为中心的未来的完整 Pro 报告。\n\\*\\*NEAR Protocol,@NEARProtocol,Official NEAR Protocol account. \\*\\*\n从#Chicago开始，GM 和父亲节快乐。 今天中午 12-6 点去@NavyPier 看和收集@imnotart 托管的#NFTs的第一个@SailGP 集合。 #SailGP\nNEAR 协议和 SailGP 正在启动第一个 DAO，以使社区拥有 SailGP 团队的所有权和影响力。奖励：先看看本周末在芝加哥的独家@imnotart 画廊和体验。\nNEAR Foundation 一直专注于勤勉和保守的资金管理，我们有能力度过难关。现在是在 NEAR 上构建的最佳时机！\ncroissant，@CroissantEth，just a croissant in search of a 1000x\n无\n\\*\\*DeFi Airdrops，@defi_airdrops，Never miss any DeFi airdrop again! \\*\\* & \\*\\* @DawsonBotsford \\*\\*\nIt's a date $ZIG  <https://github.com/ZigZagExchange>\n我看到每个人都忘记了熊市有多长 这不是明天也不是后天结束\nPirate Guild Captain，@thegostep，alchemist、AMPL、FORTH\n无\nAftab Hossain，@iamDCinvestor，investor & project advisor\n我希望在熊市期间，对于创建或推广不可持续协议的参与者，以及不负责任地杠杆化并据称多次借用非流动性抵押品的基金，我们可以成熟，而不是“感到难过”， 我不同情那些想危害我们所有人的人\n是时候让熊市改变自我一段时间了\n这将是一个非常痛苦的时期，毫无疑问， 还没有触底的迹象，而且我们还需要数年才能再次看到历史高点 ， 但是 imo，关于加密货币永久死亡的谣言被大大夸大了，\n顺便说一句，我的大部分价格推文都与 NFT 无关。他们几乎总是关于 ETH 和可替代品， 我不交易 NFT，所以近期价格与我无关。我只定期寻找我想要积累的收藏品 ， 我简单的 NFT 方法是便宜地购买 grails & vault，\nwelp，看起来越来越像我可以再次进行世代购买......在某个时候， 如果他们在场，你最好相信我会毫不犹豫地扣动扳机 ， 不会在这里引用价格水平或任何东西。只是在寻找时间过去，以及真正疲惫的迹象\n我在@0xDecaArt 自由式画廊的第一次尝试，以@dmitricherniak 的 Ringers 为特色\n仇恨者将不愿看到一些 NFT 收藏家社区将成为迄今为止最活跃和参与度最高的加密社区在熊市期间， 即使在估值下降的情况下， 他们不会得到它。或者下一轮牛市之后会发生什么，\n应用程序创建者： 拜托，看在上帝的份上，不要让我每周都拿出我的硬件钱包来登录你的应用程序， 只是为了查看我的信息。甚至不进行链上交易， 如果您要这样做，请允许使用委派的热钱包登录地址 ， 现在的用户体验很糟糕，能在熊市中再次谈论这些东西不是很好吗？\n如果我告诉你，我有 95% 的信心在 10 年后持有重要价值的唯一加密资产是： ETH、部分精选 NFT、BTC 而已 ，， 之后，我的信心基本下降到< 50%，“哪些 NFT？”人们一直在问， 为什么会是 \\[myBags\\]，ofc\nDovey “Rug The Fiat” Wan, @DoveyWan\n在家看日落，同时检查 CT 卡通 pfps 在地球另一端的早晨在做什么 加密是一个有凝聚力、充满活力的伟大全球社区，没有其他人可以竞争\n刚刚和@xmargintrading 的@darshanvaidya 聊天 ， “你不必成为一个混蛋就能成功，即使你成功了也很容易适得其反”， 保持谦虚，保持敏捷。乐于公开批评并打正确的仗 ， 将继续支持谦逊和有能力的创始人，\n如果我们的行业在加密版本 LTCM+ 次贷之后维持并蓬勃发展， 无法想象会有多牛市 ， 没有美联储印刷品，没有政府救助， Cefi 将永远存在，我们可以在自我披露、社区审查、透明度方面的同行压力等方面做得更好，\nBTC 超过 60k：这次公牛将有所不同（在此处插入 supercyle 或其他 S2F 模因）， BTC 低于 20k：这一次的熊将不同（永远地妖城宏崩溃巴拉布拉布拉） ， 结果周期都是一样的，因为人类心理很少改变，\nGenesis 将承担损失，Galaxy 也可以，Babel rekt；资产负债表收缩， 这 3 家都是以矿工为重点的最大贷方，因此当这种流动性紧缩来袭时，来自矿工的净流入（他们曾经整理 BTC 以获得工作上限）将会增加 ， 将密切关注netflow，\nSaaS：作为一种服务的垃圾发布， 灵感来自@ercwl 绝妙的想法 ， 这应该是某处最大的 web3 Dapp，\n\\*\\*Andre Cronje, @AndreCronjeTech yearn.finance，@iearnfinance \\*\\*\n无\nHayden Adams, @haydenzadams\n很荣幸能花时间与 Johnson 专员谈论 DeFi 和 web3。 Kristin 作为法学教授多年来一直在研究 DeFi，并为她作为监管者的新角色带来了很多知识，得知她一年多前写了一篇讨论 DEX、AMM 和 Uniswap 的论文真是太酷了 <https://scholarship.law.wm.edu/cgi/viewcontent.cgi?article=3901&context=wmlr>\nUniswap LP 费用接近翻转@ethereum\n加密货币充满了权衡。 去中心化、规模、安全性、速度、用户体验等可以相互权衡。 最好的项目在它们之间无情地优化以获得预期的结果。 然后有些人只是采用世界上最糟糕的方法（通常是 CeDeFi）\n昨天与专员@CarolineDPham 进行了建设性的对话。她和 CFTC 对 DeFi、web3 非常感兴趣，并了解其好处和风险我从事加密工作是因为我认为我们可以让互联网和金融市场变得公平、透明、稳健且易于访问。 富有成效的对话对于实现这一目标至关重要\nSBF , @SBF_FTX\n1）感谢您的采访， @davidgura ！ ......他理解中央银行试图做的事情的困难，并指出它“夹在石头和艰难的地方”。 2）还有： 他说：“我确实觉得我们有责任认真考虑介入，即使我们自己不知所措，也要阻止传染。” “即使我们不是造成它的人，或者没有参与其中。我认为这对生态系统来说是健康的......”\n这里最重要的事情不是确保没有人会陷入困境——而是确保： 1）这不是毫无戒心的零售 2) 适当披露风险 3) 不会传染， 这基本上意味着--进入< >进入信贷是一回事，但拥有欺骗性信贷与零售是另一回事， 监管可以在这里提供帮助！ DeFi 也可以； FWIW 3AC/等透明的链上协议不可能发生\n如果@solana 在 2021 年的牛市结束后一劳永逸地解决了大部分验证者问题，那将是具有讽刺意味的；狗屎时机， 也完全有可能——afaik 有真正的解决方案来了，其中一些已经部署\nFTX 不受影响， 没有未偿债务/等。\nCZ Binance，@cz_binance\n从历史上看，如果每次出现“比特币已死”的头条新闻时，你都买入#bitcoin ，你会做得很好。 逻辑：当他们失去希望时，那就是底部。 NFA。不推荐这个或任何未来的策略。\n另一个错误的文章。当#Binance冷钱包增加时，意味着更多的用户存入#Binance 。这位记者似乎对交易所冷钱包的概念并不了解。  » 突破：币安买入下跌，增加 101,266 比特币\n学过的知识： 在牛市中，看基本面。 还： 在熊市中，看基本面。 出色地： 看基本面。\n2013 年，主要是#Bitcoin 2017，ICO（ #ETH ，ERC20， #BNB等） 2021 年，DeFi、NFT、许可证、粉丝令牌、支付、GameFi、元界(?)等等……\n庞氏骗局是用新钱还清旧钱。它不会持续的。 实用价值是当很多人将其用作工具时。 crypto被数亿人用于全球筹款、投资、跨境汇款、小额支付、DeFi、NFT……。 效用价值具有持久力。 波动率是市场规模的函数。市值较小的资产波动性更大。这实际上不是资产，而是交易社区的大众心理造成的。 股票同样波动，甚至更多。\nComme une lettre à @GroupeLaPoste  最具代表性的法国品牌之一正在@binance 上推出其#NFTs ) ：你呢？ 大多数人认为邮局是预电子邮件/互联网。现在，法国邮局在区块链中。采用。 #BNB\nvitalik.eth , @VitalikButerin\n人工智能很可能是由形状旋转器构建的，但目前这些东西的迭代似乎是最终的 wordcel。\n我一直在思考为什么这是真的，我可能会有一个解释。基本上，我认为这归结为最终目标（“我们最终想要的东西”）和我们实现这些目标的策略之间的混淆.....\nRune Christensen, @RuneKek，Founder of MakerDAO\nSNX 绝对爆炸式增长，他们是在构建新产品，还是它是核心衍生产品，乐观地达到 pmf？\nstani.eth, @StaniKulechov，Founder of @AaveAave\n@NFT_NYC 期间即将举行的令人兴奋的展览 - 现在回复\n按照 DeBridge 的示例，为您的 web3 项目创建一个非监管 Lens 配置文件，以使您的受众保持最新\n想象一下，几年后每个人都将使用 DeFi。难以击败开源、透明和可审计的财务\n有大量时间围绕@LensProtocol 建立生态系统\nCelsius 今天在@AaveAave 协议﫡上偿还了价值 27 mm 的流动性\n一般来说，DeFi 100% 按预期工作。\n这些在@LensProtocol 上不断增加的小型内容收集活动将对那里的许多创作者和开发者产生重大\n@AaveAave 协议的最佳效用是，当您需要流动性时，处置您认为长期的 web3 项目资产的压力较小，并且有效地释放上行空间。保持高健康因子\n主网 1 个月后有趣的数据分析 Lens\n1/ 嘿灯笼裤，是时候宣布镜头赠款计划的下一批获奖者了！ 整个领域的建筑商都提交了他们的申请，让我们看看谁将加入我们的第二轮：队列 1，树苗， 2/ Up first 是一家去中心化的时装屋，设计和制造链上奢侈皮具。是时候欢迎@AMHODAO 来到第二轮镜头奖得主的花园了！在此处关注他们的 WIP 项目https://amho.xyz 恭喜，Sapling！ 3/ 接下来加入我们的社交图浏览器和可视化工具是@CultivatorLens ！欢迎来到花园，Sapling 在此处查看他们的 WIP 项目https://lens-cultivator.vercel.app并继续关注他们继续建设/ 搭建web3视频和流媒体平台，欢迎@Gummys_io 来到本次Lens grants第二轮获奖者的花园！在这里查看他们的 WIP 项目https://gummys.io并留意更多建筑，5/ 加密、跨链、web3 钱包消息传递即@hashchatxyz ！欢迎，Sapling，成为第二轮 Lens 赠款的获胜者。在此处查看他们的 WIP 项目https://hashchat.xyz ， <https://twitter.com/LensProtocol/status/1537838792660467713>\nRobert Leshner，@rleshner，创办人 @compoundfinance\n独特的艺术：NFT， 版本：Fractional NFTs\nCompound was in fact created to prevent a Celsius situation.\nKain Warwick，@kaiynne，Founder of Synthetix\n它是如何开始的，它是如何进行的。 Tbf to Rune 虽然 Havven 事后看来非常愚蠢。 erc-20 内的转账费用是否与加密货币中的一些最糟糕的想法有关。\nJuan Benet @juanbenet, Protocol Labs, IPFS, Filecoin\nFilecoin x @brave， Coming soon... <http://brave.com/download>\n游戏欄 Web3， 建筑商、游戏玩家和大型开发商店继续探索虚拟世界中 NFT 等资产的机会。在#Filecoin位于奥斯汀的 NFT 之家从@GoGalaGames 获得“NFT 和区块链游戏”的一片土地\n特别感谢我们的 Funding the Commons 共同创造者，他们帮助我们推动了资助公共产品和开源技术的工作。 @protocollabs , @FFDWeb , @fiftyyears , @TephraLabs , 和@Gitcoin 。\n1/ 区块链非常适合提出透明、可验证的声明，并且有机会设计和构建关键的 Web3 环境工具。 这就是为什么我们很高兴地宣布与@gitcoin 合作的可持续区块链黑客马拉松！ ✨ <https://gitcoin.co/hackathon/sust> 2/ 在虚拟的可持续区块链黑客松上，您将有机会使用@IPFS 和@Filecoin 帮助为明天可验证的可持续网络奠定基础。  6 月 23 日 - 7 月 18 日 加入我们，构建更环保的区块链解决方案 - 立即申请：\n这简直太棒了 虽然很沮丧“我们必须从另一个星球上获取文件”并没有成功\nGavin Wood @gavofyork，Founded Polkadot, Kusama, Ethereum, Parity, Web3 Foundation\n今日无\nAnatoly Yakovenko，@aeyakovenko,Co-Founder of @solana protocol\n如果您没有使用最新的@solana 验证器软件，您将在下一个 epoch 被 nonce 功能激活分叉。\n为什么大多数 DAO 默认不是代理？ HA 系统需要 24/7 实时响应\n我没有足够的背景来发表深思熟虑的意见。我个人更喜欢没有治理挂钩或预言机的冻结智能合约。但金融是如此复杂，以至于 Defi 无法在这些限制下解决大量问题。\n@solana 自发布以来已经发布了 10 个主要版本，并且每个版本都比上一个版本更好。每个版本都让我们更接近一个单一的目标，单一状态机可以同步 10gbps 的吞吐量，尽可能接近物理允许的光速。 在纸面上，这是 512 个内核，今天几乎是现成的硬件。但要实现这一目标，还有很多艰苦的系统工作要做。目前 1800 个验证者消耗约 600mbps。这比纸上的要差 10 倍。\nQuic 还没有推出，但 1.10 有大量的性能改进。特别感谢@mangomarkets 殺\n1772 名验证者一致投票，没有分片或小组委员会。在物理学允许的范围内，世界将不可避免地拥有一台全球同步接近光速的巨型状态机。\n哑剧是沉默的极端主义\n虚荣地址的 MEV + 研磨将把任何 pos 变成 pow。\n令牌将成为 web3 的一部分，因为所有其他限制垃圾邮件的方法都涉及隐私损失。\nDominic Williams ∞, @dominic_w , Internet Computer @DFINITY\n区块链的阶段 ，#1 比特币✅ ， #2 莱特币、羽毛币... ❌ ，#3 以太坊（智能合约） ✅ ， #4 Bs“特殊用途”链❌ ，#5 庞氏经济学 DeFi...TVL！ ❌ ， #6 大多数事情都会被烧毁✅ ， #7 互联网电脑 ， 验证以下内容是否真实 - 团队 - Web3 技术。 - 社区 ， 简单的\n考虑创建一个专注于下一代区块链和 Web3 的新加密新闻网站， 无聊抱怨腐败的加密货币的“付费既得利益媒体”。不会改变。是时候创造更好的新闻来源了 ， 将报道互联网计算机、1000s ICP devs building等 ， 待定，严肃的加密货币记者请私信我\n互联网计算机区块链是一个新的公共计算层， 可以在链上托管 Web3 和所有其他系统和服务 ， 改变游戏规则的智能合约可以处理： - 聊天文本和媒体 见http://oc.app - HTTP 请求 ， 技术很重要。 愿景很重要。 影响很重要。\nDegen：“Dominic 一直在谈论技术……ICP 是骗局……谁需要技术。他们的营销很烂……” 多米尼克：\\[技术\\] \\[技术\\] \\[技术\\]... Dfinity 团队：\\[R& ;D \\] \\[R& ;D \\] \\[R& ;D \\]... ， #InternetComputer社区：\\[构建\\] \\[构建\\] \\[构建\\]... 真正的 Web3。 未来几年。 更多的来了。\n2015 年 2 月https://youtube.com/watch?v=8iEgjqIMtVQ&t=1105s “去中心化网络可以横向扩展，而且性能也非常高......我们最终将拥有比我们的一些中心化服务更快的去中心化网络” 今天实现：互联网计算机区块链。\n一切都来了：DeFi 蔓延，shitcoin 崩溃， 是时候与加密货币保持一致了： - 最佳研发;D团队 - 最先进的网络 - 社区 1000 名建设者 ， 只有 1 (ONE) 区块链运行不带云的 Web3 服务。比其他人早几年 ， 区块链的未来。 计算的未来。\nCrypto Leaks 曝光令人惊叹， 来自 Arkham Intelligence 案例的视频让你大吃一惊 但在报道 Akrham、ICPR、bs 法律行动和其他纯粹的反 ICP 骗局的加密出版物中...... 无涵盖了加密泄漏\nDaniel Larimer @bytemaster7，Cofounder: <http://eos.io>, <http://block.one>, <http://voice.com>, <http://steemit.com>\n我很兴奋，迫不及待地想与世界分享我们正在做的事情。很高兴有这么棒的团队。\n**Naval , @naval \\*\\*\n无\n\\*\\* Aaron Wright，@awrigh01，co-founder @TributeLabsXYZ, @TheLAOOfficial, @flamingoDAO**\n今天在价值存储方面： 朋克>比特币>以太\nEmin Gün Sirer, @el33th4xor， Founder and CEO @avalabsofficial\n加密会吃掉华尔街，然后它会吃掉世界。您的系统是否能够吸收所需的增长？\n阅读这篇文章，在你的脑海中播放“我们没有引发火灾”。顺便说一句，超级高兴#Avalanche是一个足够 0 的戏剧链，它没有在这个臭名昭著的大厅中被提及。\n谁还记得 The DAO hack？ 6 年前的今天，360 万以太币被盗。\nDo Kwon，@stablekwon，建造 @terra_money\n只持有将保持在 5 位数或 1 位数的信念，成为你想看到的改变 ， 加密货币的最后一个月有一些教训，这些教训将推动下一代建设者的崛起达到顶峰， 去中心化金融和去中心化货币抗议国家支持的暴力与金融主权， 波动性是信徒为实现主权而付出的代价 ， 清算不应使这些信念无效，创建对这些攻击更强大、更有弹性的系统， 迎接挑战 ， 或者投降——但要诚实，无论你是为主权的未来还是为更高的数字而战 ， 当前一个阵营的人数多于后一个阵营时，加密货币获胜，\nDeFi Dad ⟠ defidad.eth @DeFi_Dad\n本周主题：生存和发展。\n没有什么比 Ledger + MetMsk 无法正常工作而吓到你的了，而这只是一个软件更新，两者都需要。 提醒：如有疑问，请保持冷静并更新软件。\n熊市在精神上可能是毁灭性的。 有些人在 UST 失去了一切，有些人的钱被锁定在摄氏度，有些人下降了 90-99%，或者更糟糕的是，有些人不得不在乌克兰为自己的生命而战时不得不处理这一切。 善待彼此。这很重要。 在熊市期间，我们重新了解了其他人多么希望整个加密货币失败。 MSM、政府、嫉妒的家人和朋友——他们支持加密货币中一切事物的消亡。 从比特币到 DeFi 再到 NFT 再到 Web3，一切机会均等的愤世嫉俗者。 熊市提醒你我们有多少共同点。 自主权、交易自由、构建平等获取金融工具的技术以及确保拥有新加密资产的核心原则。 它支撑着我们的很多东西do. 由于自负、贪婪和嫉妒，牛市加剧了部落主义。它可以分散最初的使命，即为那些迫切需要访问具有数字货币和金融等应用程序的替代网络的人构建，这可以帮助他们过上更好的生活质量。 过去几周，尽管加密 TradFi 中失败的社会契约崩溃了，但链上交易（即以太坊、L2s 和比特币）的能力并未受到影响。 DeFi（真正的 DeFi！）一直在完美运行——Maker DAI、Aave、Compound、Uniswap 等等。 我的观点是，在艰难时期，请记住，我们在建立一个新的抗审查、无需许可、无需信任、数字原生金融系统方面取得了巨大进展。 与不确定的宏观世界相关的解除杠杆和价格并不能抵消所有这些进展。 除非我们建立一个可以留住新用户的社区，否则我们不会继续取得这样的进展。 因此，在其他条件相同的情况下，彼此友善是帮助我们成长的最简单方法。 rn，许多人可以用一些善意来度过这个艰难的时期。\n不需要调用底部来识别与$ETH的长期交易。 ✅每年为交易支付的数十亿美元 ✅ > 200M 独特的钱包 ✅ 46B 美元的稳定币 ✅ 40B 美元的 DeFi TVL ✅ Uniswap ATH 每月交易量 $111B ✅ NFT 中 OS ATH 每月 vol $4.8B ✅ ETH 即将通货紧缩 是的，我知道我们可以跌得更低，但我的目标不是触底。这不是对任何以特定价格购买的人的建议。 当 ETH 和其他代币被严重低估时，这只是一个提醒。 保持安全并保持偿付能力，我的朋友们。\n真实故事：早在 2020 年，Celsius 的 CEO 向用户误导什么是 DeFi 和什么是Celsius，我非常恼火，我在@DefiantNews 上为 DeFi 101 写了这篇文章，专门解决 CeFi (Celsius) 和 DeFi 之间的差异。 这并不难：不是你的钥匙，也不是你的硬币。\n我知道每个人都情绪低落，但想象一下在此期间打官司。请通过@PoolyNFT 或 Gitcoin Grant 在针对 DeFi 和 Web3 应用程序的重大案件中支持@lay2000lbs 和@PoolTogether_ 的辩护费用。 Gitcoin 上的每 1 美元与 19 美元相匹配！\n寻找新工作？ @MintStarsCo 正在招聘！ 基于@0xPolygon 的抗审查 OnlyFans 平台， 如果您受到#coinbase裁员的影响，这是一个值得考虑的好团队。\n如有问题，请联系@jessicavanmeir 。 @davidesilverman 我们必须让@MintStarsCo 插入@LensProtocol ，以便他们的创建者可以利用您正在构建的去中心化社交图谱。 ✊没有理由 MintStars 的创建者不会从将他们的追随者移植到 Lens 上的任何 dapp 中受益！\n为什么@CNBC 和@FoxBusiness 上的主人和客人不需要披露他们何时拥有他们正在评论的股票、商品、加密货币？ 每次采访我都会这样做——无论是从公开市场购买还是投资于私人融资。这并不难。\nChainLinkGod.eth , @ChainLinkGod， Chainlink Community Ambassador\n我们抨击 TradFi 的一切，现在都发生在 DeFi 和 CeFi 中， 即“说一套做一套”的问题 ， 从贷款违约和覆盖暂停到彻底的资产没收和破产 ， 命运爱讽刺，\nBancor的这一举动并不好， 承诺提供永久性损失保护，然后在最需要的时候撤销保险，这会伤害很多人 ， 3M $LINK在提款队列中，似乎这些提款都不会覆盖它们的 IL，\nBancor 已暂停无常损失保护， “随着市场稳定，IL 保护将在协议上重新激活。这是保护协议及其用户的临时措施。” ， 公告博客，blog.bancor.network/market-conditi\n如果您仍然将加密资产存放在中心化借贷平台上……为什么？ 除非您已经将这些资产作为损失注销，否则此时风险敞口的意义为零， 是时候将资产转移到深度冷藏库了，即使是 DeFi 收益也不值得冒险，\n人们在熊市期间提出了最奇怪、最令人费解的理论来解释为什么他们的互联网代币现在价值不高\nSolend 被置于一个非常棘手的位置， 他们的 dApp 的参数允许创建系统性的大保证金头寸 ， 1.7 亿美元的 SOL 抵押品和 1.08 亿美元的稳定币债务 ， 而且根本没有足够的链上流动性来清算这个头寸， 提议的解决方案是赋予团队紧急权力来接管该职位并清算 OTC， 然而，该提案及其获得批准的方式为 DeFi 和 DAO 开创了一个不好的先例 ， 老实说，这是我见过的“社区治理”较弱的尝试之一，DeFi 中的风险管理很难，我认为现阶段没有任何协议可以完善它 ， 但是 dApp 需要开始更深入地思考更糟糕的情况以及他们计划如何处理这些情况 ， 如果你的 dApp 允许某些事情发生，你必须假设它会，\n再一次证明，即使在极端市场波动期间，Chainlink 价格馈送也具有弹性， 全市资产成交量加权平均价格准确无误报告 ， 更新频率基于用户需求和底层区块链的成本，\n事实核查 1. Chainlink Price Feeds 跟踪资产的市场价格，而不是单个交易所的现货价格 2. 以太坊上的 ETH/USD 确实触及 892 美元的低点 3. Aave 不使用 Chainlink ETH/USD 提要，因为所有资产和提要均以 ETH 计价， Ty 用于更新和跟踪此事件的进展@DeFiyst\nChainlink 一次保护 DeFi 生态系统的黑天鹅事件\n像今天这样的日子是人们了解 DeFi 清算和价格反馈如何实际运作的日子， 请看在我的份上，先阅读文档，然后再对某些东西是否有效\n你今天的核心目标是生存，修剪有毒资产，积累蓝筹股，学习对冲下行风险的重要一课，并驾驭波动， gl 外面的朋友\n从根本上说，我们的处境比 2018 年的崩盘要好得多： - 99% 的项目 = 白皮书 - DeFi 不存在 - 稳定币 TVL 1B - 收入模型开玩笑， 现在我们有： - 真正的工作产品， - 建立核心 DeFi 原语 - 稳定币 TVL 180B - 真实收入模型，\n最近，每当有人问我“加密市场的情况如何”， 我告诉他们想象 2008 年的次贷危机，但没有政府救助 ， 贷款违约、不良资产、级联清算、破产，我们得到了一切\n不受欢迎的观点：今天#DeFi提供的当前收益率在很大程度上不值得冒险， 特别是在这些市场条件下，庞氏激励系统以前从未经历过这些类型的市场条件 ， 这也适用于 CeFi / CeDeFi，这自然是一系列风险，每个机会都需要单独考虑 ， 但目前的收益率感觉与所承担的风险水平不同步 ， 特别是如果您没有设置 24/7 全天候监控您的职位， 当您将资产存放在某处时，您是否考虑到： 智能合约风险， 治理风险， 死亡螺旋风险， 破产风险， 流动风险， 托管风险， 甲骨文风险， 资产风险， 地毯风险 ， 现在是时候重新评估您的风险敞口了，\nbanteg ,@bantg, yearn and woofy\n时间线上的人都在呼吁监管，底部在。\n几天后流式传输 YFI 回购研究 合约已被 MEV 机器人拾取并不断被清空，Chainlink 馈送紧张，无人手 DCA 完美运行。 了解它是如何工作的： <https://github.com/banteg/yfi-buy>\n您需要在五分钟内了解有关 Chainspace 的所有信息\n这是我见过的最有趣的造币厂之一\nRyan Watkins，@RyanWatkins_，Research @MessariCrypto\n如今，当我告诉人们我从事加密货币工作时，他们用悲伤的小狗眼看着我，就像我刚刚告诉他们我得了绝症一样“Are you ok?” 梁\n外面一片漆黑，但事实上，这次崩盘是献给那些致力于加密货币长期成功的人的最大礼物。 大规模采用即将到来，但我们必须消除所有阻碍加密经济增长和成熟的废话。 现在是开始的结束。 这就是我今天得到的所有hopium。 无论如何，感谢明年的世代购买机会。\n[balajis.com](http://balajis.com) , @balajis\n无\nMartin Köppelmann， @koeppelmann， @CirclesUBI, @gnosisPM\nOEV - 预言机可提取价值。\nDefi曾经被视为高风险。令人惊讶的是，这已经部分翻转了：许多人认为@compoundfinance 上的 DAI 现在比在贷款柜台上的 Tether 更安全。不难预测，在接下来的 2008 年银行危机中，Defi 将比银行更安全。\n在没有 32 个 ETH 的全部承诺的情况下，确定您是否想成为以太坊上的验证者的一个好方法是 Gnosis Beacon 链 - 相同的任务，但只需 1 个 GNO 进入成本。\n来自区块链怀疑论者对@darkforest_eth 等区块链游戏的有趣观点。 EVM 可以看作是游戏的“数字物理”，准确定义了什么是允许的，什么是不允许的。玩家自己可以在游戏时间通过智能合约扩展规则。\nwoki, GITer of COINs， @owocki； @gitcoin\n我有 97.3% 的把握。 Sybil Resistence 将成为下一个周期中重要的金钱乐高积木。 我想在“1 human 1 vote”设计空间上做一个月的greenpill剧集。 我应该穿上谁？\n我真的真的认为这可能只是所有的协调\nAndrew Køng @Rewkang ，of @mechanismcap @PleasrDAO\n看到前所未有的链上活动和交易所流入， 提醒价格趋于流动性，H/T @AYoonity @cryptoquant_com， These are $BTC exchange inflows \\*，购买整数支持只能工作这么久， 当我们在它之上巩固时会发生什么？价格走向流动性（2 万美元及以下）\n价格是流量的函数， 供需 ， 边际买家和卖家 ， 真的就是这么简单，卖家还没出精\n3 年前在这个周期的质押驱动牛市开始时写了这篇文章，解释质押如何反射性地推动价格上涨， 在熊市中，效果是相反的 - 较低的收益率 = 较低的做空成本和较低的持有动机 - >更大的抛售压力\n牛市的持续时间导致许多人屈服于生活方式的蠕变， 随着他们投资组合的价值下降，他们担心如果他们能保持他们已经习惯的相同生活方式，超过某个点 ， 然后他们开始销售 - 趋势加速，瓶子，手表，抵押贷款，昂贵的假期，汽车，奢侈的晚餐，船 ， 是时候勒紧腰带了\n当我们从 4 万美元开始长期挤压时，每个人都在谈论短期挤压\nJames Wang ， @draecomino\n加密货币价格下跌的原因只有一个——我们没有为世界创造足够的价值。\n我很高兴我从未将我的名字改为 .eth，将我的个人资料图片交换为 NFT，或者在这个周期的高峰期写了一个关于 web3/DAOs/metaverse 的 28 条推文线程。..CT 浏览我的推文历史，例如\n如果您将这个循环翻了三倍，请不要绝望。它发生在每个人身上。\n\\*\\*Arthur，@Arthur_0x，DeFi Investor. \\*\\*\n超级骄傲的DeFiance团队，在逆境中展现出真本事。\n所以实际上有可能在 5 天内睡不到 20 小时。\nQiao Wang ， @QwQiao\n6 个月前：“这次不同了。我们正处于一个超级周期，我们将永远不会有另一个熊市。” 现在：“这次不同了。加密永远不会恢复，因为这是第一次在没有 QE/ZIRP 的情况下存在加密。” 事后看来，后者看起来和前者一样愚蠢。\n有什么成功的加密公司开始远程拳头的例子吗？ ZapperFi 浮现在脑海中，还有其他的吗？\nZhu Su，@zhusu\n无\n\\*\\*Idena @IdenaNetwork ， Proof-of-Person blockchain. \\*\\*\n12,466 个经过验证的加密身份 这个时期的最大二次抵押奖励是 3,586 iDNA 滋  3 周后参加下一次验证仪式\n验证方将于今天 13:30 UTC ✨开始。 在验证之前补充您的质押以获得二次质押奖励的最后机会 跟随向导加入派对 <https://medium.com/idena/how-to-get-idena-invitation-easy-and-fast-ec1faace5cc7>\nzkSync，@zksync，The first EVM-compatible zkRollup (testnet in May).\n无\n**Aztec, @aztecnetwork, zk.money; Security shield for the internet of money. \\*\\*\n无\n\\*\\* Tornado.cash , @TornadoCash, Non-custodial anonymous transactions on Ethereum.**\n无\n\\*\\*POAP, @poapxyz, Proof of Attendance Protocol. \\*\\*\n无\n\\*\\*Float Protocol， @FloatProtocol， Floating, low-volatility currency for web3 \\*\\*\n无\n\\*\\*Index Coop， @indexcoop， a community-led initiative focused on enabling the creation and adoption of crypto index primitives \\*\\*\n回答一些关于$stETH二级市场波动和对$icETH的影响的最常见问题\nNFTX，@NFTX_，Magic NFT Machine\n@callyfinance 发生大事\n\\*\\*EPNS， @epnsproject， BUIDLing World's First Decentralized Notification Protocol on Ethereum \\*\\*\n你可知道？  推送通知可将应用参与度提高 88%，启用推送通知后，多达 65% 的用户会在 30 天内返回应用！ （来源：Localytics）\n一分钟#EPNS 87  1 分钟内的关键每周更新⌛️ – 为审计做准备的智能合约 v1.5  – 钱包到钱包的通信即将达到 QA！  – 新频率： @getstox � – EPNS 出现在@hashoshi4 的 Crypto Podcast ️ 在这里阅读更多：\n告诉我们您从事加密货币的时间，而不是实际告诉我们您从事加密货币的时间\n\\*\\*Panvala ， @PanvalaHQ， Panvala is a donation matching fund that we want to share with your community. \\*\\*\n我们的七月市政厅就在几周后！我们正在关注我们网络中的两个新社区- @cheerbotme @RegenCLT 注册以了解更多信息\nTHORChain #THORNAMES， @THORChain；\n协议可以安全地扩展和收缩是至关重要的。 THORChain 管理安全性和流动性，并且它具有将它们耦合在一起的新颖机制。 THORChads 只关心系统是否正常工作。它表明它确实如此。 向前。\n\\*\\*Circles，@CirclesUBI，Based on Trust - Powered by Communities. \\*\\*\n无\nOpenSea， @opensea，The largest NFT marketplace\n明天上午 9 点与我们的主持人@misslizzyart 、策展人@Swopes 和我们在@spatialxr 的朋友一起参加我们在炉边举行的六月节庆祝活动 今年是今天为黑人解放而斗争的 157 年。 我们将庆祝元节风格 <https://twitter.com/i/spaces/1Mnxn> 查看我们的@spatialxr 画廊，由@Swopes 策划\nCryptovoxels， @cryptovoxels， A virtual world on the Ethereum blockchain；元宇宙\n建筑师岛到处都是奢华的氛围。 此海滨物业是@wackozacco420 的签名。\n同时举办 IRL 和#metaverse派对，就像@highleyvarlet 刚刚做的那样。感谢分享！  <https://voxels.com/buy> ， <https://opensea.io/crvox>\n是真的！很快在 Meta Underground 见\n社区聚焦今天，美国东部标准时间下午 6 点（太平洋时间下午 3 点） @devils_lexicon 将围绕 Voxels 举行游行来庆祝 Pride。从冥王星岛的甜甜圈公园https://cryptovoxels.com/play?coords=S@6693W,314N开始，然后跟随游行队伍，在 Juicebox DAO 总部结束。 #Metaverse #PrideMonth\n您自己的#metaverse垫。 建立您梦想中的虚拟社区来居住。 在接下来的几个小时内，还有几场拍卖即将结束。 <https://voxels.com/buy> 或者您可以直接在下面购物和过滤： <https://opensea.io/crvox>\n我喜欢这个发电机。我将尝试让它预建你所有的非洲岛屿包裹。 <https://github.com/mxgmn/Blog/blo>\n在一些非洲主题岛屿上工作。马达加斯加、桑给巴尔、特内里费。 它们将是带有旧发电机的小岛，将于 6 月底到来。\n几场拍卖将在接下来的几个小时内结束。 <https://voxels.com/buy> 或者，看 <https://opensea.io/crvox>\nDecentraland，@decentraland， Explore an incredible virtual social world；元宇宙\n你看到新的传送器了吗？ 他们直接带你到@Mastercard 的骄傲广场， 我们很高兴与万事达卡合作并帮助欢迎他们加入@Decentraland 欄这是我们即将开展的元界广告合作中的第一个 ， 我们期待帮助更多品牌进入元界并为他们的场馆带来流量， 所有广告收入将用于购买和燃烧$ICE， 元界广告通过增加对 ICE 的效用和需求，直接使我们的生态系统受益， 这是我们为实现长期可持续性、发展 Decentraland 的经济以及让下一个数十亿用户加入元界﫡而采取的几个步骤之一，将传送器带到万事达卡的骄傲广场：[bit.ly/icestronghold](http://bit.ly/icestronghold)\n我们的第一个 Metaverse 广告投放和外部 ICE 接收器已上线：一个@Mastercard 传送器，可将流量吸引到@decentraland 中的万事达卡骄傲广场。 在要塞中查看： <https://play.decentraland.org/?position=-100>\nUnstoppable Domains, @unstoppableweb, Making #crypto payments simple and building #decentralized websites；\n因此，您找到了一个与您有共鸣的域名。恭喜！ 拾 但现在呢？ 只需几个简单的步骤即可解锁其所有奇妙的超能力！ 和我们一起来 Web3 vibe-shift 隸 <https://unstoppableweb.co/vibes>\n无论： 亮解决身份危机‍ 或者 巩固朋友的遗产 您可以在几秒钟内转移一个 NFT 域。 方法如下⬇️ <https://unstoppableweb.co/whytransfer>\n我们期待与我们最新的赞助商@saddlefinance @BitMetis @Bitski 一起参加 90 年代 Forever NFT NYC 活动！立即回复以进入候补名单： <https://90sforever.xyz>， 评论你将在舞池中的舞步睊\n计划@NFTNYC ?来看看我们自己的 BD 高级副总裁@sandycarter 周三上午 11:40 在爱迪生宴会厅谈论社交数字身份：对 NFT 所有权的追求易\n\\*\\*The Sandbox， @TheSandboxGame，The Sandbox is a virtual #gaming world where players can build, own, and monetize their gaming experiences.元宇宙 \\*\\*\n@TheSandboxGame 邀请您参加为期两天的文化对话和娱乐活动 @andymilonakis  <https://sandbox.game/nyc> 文化、多样性、时尚、Web3、媒体、娱乐小组 社区网络 研讨会 音乐， 查看详细时间表https://twitter.com/TheSandboxGame/status/1538277151967006727\n是的， @NFT_NYC 有很多令人兴奋的消息！\n万物#TheSandbox ，就在这里⬇️ 在@Reddit 上的社区内提出问题并找到答案 在我们的@Discord 中认识其他#metaverse爱好者 收听我们以社区为中心的@Twitch 流� 每个平台，都在一个地方⤵️  <https://linktr.ee/sandbox>\n我们正在使用@tokenproof 为我们的#NFTNYC活动安全地发行门票！ ️ 注册已关闭，土地、 @TheSnoopAvatars 和阿尔法通行证的所有者除外。这些人不需要门票或回复。 只需在http://tokenproof.xyz/enrollment设置@tokenproof ，将您的钱包与相关 NFT 连接并下载该应用程序。\n我们定期推出不同主题的 Game Jam，让创作者有机会测试他们的 Game Maker 技能并赢得$SAND和#NFT奖品！ 请参阅下文了解我们最新的 2 场 Game Jam：  <http://sandboxgame.medium.com/the-voxodeus-game-jam-5190016c1ac>  <http://sandboxgame.medium.com/the-smurfs-gam>\nArbitrum is live on mainnet!，@arbitrum，Arbitrum is an Optimistic Rollup built to scale Ethereum by @OffchainLabs\nArbitrum Odyssey 将于 2022 年 6 月 21 日星期二下午 1 点正式开始。 我们知道你们 arbinauts 很高兴能和我们一起冒险进入未知世界，我们非常渴望让你们加入！  但在我们继续之前，我们的太空工程师有一个小更新： 从美国东部标准时间 6 月 21 日下午 1 点开始，通过使用下面列出的任何桥接器/cex 将 ETH 转移到 Arbitrum，您将能够在一周结束后申领第一个 NFT。 最终使用将最多钱包连接到 Arbitrum 的桥的用户将获得奖励 NFT。  桥牌周结束后，您每周将能够完成来自 2 个项目的 2 个独立任务！ 随着奥德赛的进展，每周都会有更多的细节。而之前@hashflow 有自己的一周，他们决定加入桥牌周（奥德赛的第一周）。 有了这个新的发展，从民意调查中获得亚军，Hashflow 在第 3 周的位置是公平的。 欢迎@GMX_IO 来到奥德赛！ 同时加入我们的 discord 并查看 odyssey-faq 频道，了解所有与 odyssey 相关的问题！ 再次感谢@ratwell0x 、 @sugoiNFT 、 @ProjectGalaxyHQ 以及所有参与的团队，他们为实现这一目标所做的所有工作！\n您知道@arbitrum 节点不相互通信吗？ 由于 L2 是 L1 的严格状态函数，因此它们没有真正需要协调的理由。 有趣的是，这意味着攻击者不知道没有诚实的人保护汇总，挫败任何攻击。\nEthereum Name Service | ens.eth，@ensdomains，Your web3 username, a name for all your crypto addresses, & decentralised websites\n无\nProject Galaxy ∅，@ProjectGalaxyHQ，Powering on-chain credentials with #NFT modules.\n父亲节快乐！ 拾 为了庆祝所有让这个世界运转的父亲， #ProjectGalaxy创造了一种独一无二的 NFT OAT（链上成就令牌）来纪念这个特殊的节日。 确保您转发此推文以铸造 OAT！ <https://galaxy.eco/galaxy/campaig>\nProjectGalaxy刚刚收到明确为我们制作的独家 NFT！ 介绍#ElectricSheep — 来自@UltiverseDAO 的 Genesis NFT 集合。当持有者可以访问他们的社交游戏元世界上的各种实用程序时，请务必检查它们！ <http://es.ultiverse.io>\n还记得我们告诉你们我们新的 Discord AMA 机器人吗？ 好吧，本周我们将推出一个新的 Discord Member Bot！您现在可以添加成为 Discord 成员作为凭证，或者只是奖励那些已经成为成员的人。 还有谁喜欢 Web3 的 Participate To Earn 模式？\n\\*\\*MIM,@MIM_Spell，♂️IS A SPELL BOOK THAT ALLOWS USERS TO PRODUCE MAGIC INTERNET MONEY! $MIM $SPELL \\*\\*\n在过去的 24 小时内发生了很多事情。 $MIM正在通过另一个重要的压力测试。  我们决定在我们最新的媒体文章中解决这种情况\nAbracadabra 将实施挂钩稳定措施以解决$MIM挂钩不平衡 立即影响，我们的$yvDAI大锅利率将从每年 0% 增加到 1%。 ⬆️ 阅读我们最新的媒体文章\nAbracadabra 的旧仪表板现已恢复运行。 您可以在此处和链上查看所有借贷市场的所有抵押率⚙️\nCoinbase NFT，@Coinbase_NFT，Introducing Coinbase NFT\n无\n\\*\\*Optimism，@optimismPBC，An extension to Ethereum that provides scalability & a funding source for public goods. \\*\\*\n无\nStarkWare，@StarkWareLtd，Bringing STARKs to a blockchain near you.\n嗨，别再看图表了。看看这个吧。 我在 Twitter 上制作了一个（绝对不完整！）最相关#StarkNet项目的列表。 在这里找到它：<https://twitter.com/i/lists/1538305568066129920>\n旧金山， ✨斯塔克网络， ✨保存日期：6月26日， 我们将在旧金山举办#StarkNet聚会！ @EliBenSasson 和@ukolodny 将在那里谈论 STARK、StarkNet、星球大战、星际迷航和爸爸的笑话！ 过来打个招呼。 <https://meetup.com/starknet-san-f>\n在 STARK 方面构建✨✨ 今年夏天你不用去海边了 @encodeclub x StarkNet 在线黑客马拉松是您所需要的！ 6 月 27 日参加实践培训，持续到 7 月 14 日。 奖品等你来拿！\nArweave Team，@ArweaveTeam，We created the Arweave protocol\n无\nCosmos - Internet of Blockchains，@cosmos，The open, scalable, and interconnected economy of the future\n无\nHelium，@helium，decentralized wireless infrastructure.\n如果您错过了，请查看@laurashin 和@amirhaleem 之间关于@helium 的精彩#Consensus2022炉边聊天。万岁#ThePeoplesNetwork ！ ⚡️ <https://youtube.com/watch?v=pZeV_fT-jrg> #HNT $HNT\nHeliumHouse 2022 年是@Helium 社区多年来的第一次面对面聚会，当然，展示了大量开创性的新闻和信息， 主要主题之一是对 2 个新的潜在 DNP 加入 Helium、WiFi 和 dVPN 的讨论\nICYMI： #HeliumHouse ATX 视频现在都可用于您的周末流媒体： <https://bit.ly/3N1WGzO>", "timestamp": 1655694145, "digest": "A7zChDPp5XMqfD8hemU361OtxivVvvulT0g3hAFyICo", "contributor": "0x78c0A25CcC21604B3D117100DE7c9523f53236C7"}
{"id": "4EuEDIGY-cnpfZYSIbLWQ-w_9v8fySBuV-2ilZSItPI", "title": "mirror", "body": "mirror", "timestamp": 1655694253, "digest": "AX_N9tOpw84WKy2nCxz87fBnZjXBFgYMbVsCv5OnsFw", "contributor": "0xCf5670bdeB372bDfeaE431F58da94c6281321f04"}
{"id": "kgUcFuyVV5g1PH4eGq_3e7sydgoFrI6nt_ableCy1G8", "title": "专题研究N1007：2021年融资区块链项目研究之六Dibbs", "body": "专题研究N1007：2021年融资区块链项目研究之六Dibbs\n\n按：今日（2021年7月30日）在研究2021年上半年区块链行业融资数据时，决定要将今年融资的项目作一个专题研究：1、融资了，说明得到资本界看好，可能是一个好的方向和项目；2、通过研究它们，可以了解外界或圈内人对这个行业的判断，是一种研究区块链发展趋势的捷径和正确的路；3、之前的区块链人物、项目系列研究也基本是追一些热点或按版块研究，已有1000期；基本也将常见的项目和区块链人物研究的差不多；正好可以告一段落（前期落下的一些已计划的还要继续，在1000期以内）；4、基于推特是目前区块链信息最集中和更新快的平台，还依托于此来研究相应的融资项目。\n\n16 小时前， 链闻消息，据彭博社报道，球星卡 NFT 碎片实时交易平台 Dibbs 完成由 Foundry Group 领投的 1300 万美元 A 轮融资，Tusk Venture Partners、Courtside Ventures 和 Founder Collective 等参投，另外，球星 Chris Paul （CP3）、Kevin Love、Skylar Diggins-Smith、Kris Bryant、Channing Frye 等也参与了投资。\n\nDIBBS | There’s action in the cards @dibbs_io Trade and collect in the only real-time, 24-7 fractional card market. 翻译简介 Santa Monica, CAdibbs.app.link/twitter2020年10月 加入 110 正在关注 3,100 关注者\n\n置顶推文：Dibbs 令人兴奋的一天！我们的 A 轮融资已经完成，这要归功于令人惊叹的新投资者团队 @tuskventures , @foundrygroup , @cp3 , @kevinlove , @SkyDigg4 , @KrisBryant_23 , @channingfrye & @DeAndreHopkins .\n\n查看 @KimBhasin 的故事！ https://bloom.bg/2WrQNYg， 下午9:33 · 2021年7月27日\n\nshoheiohtani和 @KingJames 下跌走势图表和 @KembaWalker 和 @JoshAllenQB ， 请注意，自创建此视频以来，这些价格已经发生变化，并且随时可能发生变化。上午8:31 · 2021年8月5日\n\n一些疯狂的举动已经开始 @nba 自由代理。 @russwest44 到 @Lakers , @Klow7 到 @MiamiHEAT 和 @DeMar_DeRozan 到 @chicagobulls 只是几个。 在所有这些动作之后，谁是下个赛季的最爱？\n\n这些 @KDTrey5 和 @jaytatum0 明天 8 月 3 日，美国东部标准时间下午 1 点/太平洋标准时间上午 10 点，卡片会掉落。 @usabasketball 明天晚上 9:40 PST 将在四分之一决赛中迎战西班牙。他们会进步吗？\n\n美国女子体操队在这期间表现出色#olympics. @jadeacarey 和 @mykaylaskinner 是一个很大的原因。加， @Simone_Biles 明天回来参加女子平衡木比赛。\n\n埃尔塞贡多 @dibbs_io ，它自称为“唯一的实时分数体育卡市场”，本周获得了 1300 万美元的 A 轮融资，其中包括像这样的明星运动员 @CP3 和 @SkyDigg4 也参加。\n\n告诉我们你在 @nsccshow 没有告诉我们你在国家... 上午5:43 · 2021年7月30日\n\n谁为之兴奋#NBADraft?\n\n明天 7 月 29 日的掉落时间表： @Giannis_An34 美国东部标准时间下午 2 点/太平洋标准时间上午 11 点下降， @Zionwilliamson 美国东部标准时间下午 3 点/太平洋标准时间下午 12 点下降， @luka7doncic 美国东部标准时间下午 4 点/太平洋标准时间下午 1 点下降， 你看中哪张卡？\n\n谁看到了莉迪亚·雅各比，第一位来自阿拉斯加的游泳运动员 @TeamUSA 奥运游泳队，昨天带回家金牌？\n\n我们很高兴地宣布我们已经完成了 A 轮融资。很荣幸补充 @tuskventures , @foundrygroup , @cp3 , @kevinlove , @SkyDigg4 , @KrisBryant_23 , @deandrehopkins & @channingfrye 到我们令人难以置信的支持者名单。 现在下载食指指背往下指 https://bit.ly/3ycfC8w\n\n这些 @PatrickMahomes , @JoshAllenQB 和 @Lj_era8 卡片将于明天（7 月 27 日）美国东部标准时间下午 1 点/太平洋标准时间上午 10 点掉落。 你看中哪张卡？\n\n这 @Olympics 有一个激动人心的开始。 迄今为止的亮点： @jaggereaton ：获得男子滑板铜牌 @chasekalisz 带回家黄金，和 @j_litherland 带回家银 @S10Bird 和 @DianaTaurasi 带领女篮进入今晚的首场比赛。\n\n我们的#potw是一个容易的。 @Jrue*Holiday11 到 @Giannis*An34 对于比赛获胜的空中接力赛。 如果我们本周做对了，请告诉我们\n\n恭喜 @KonerkosBonerko 赢得本周的赠品！ 更多赠品即将推出……敬请期待！\n\n. @deandreayton 和 @ronaldacunajr24 下跌走势图表& 小弗拉基米尔格雷罗和 @giannis_an34\n\n起草后 @MarkGio05 , @jeberle_7 和 @YanniGourde ， 这 @SeattleKraken 下赛季有机会成为一支伟大的球队。 你认为他们在 @nhl 扩容草案？\n\n50分14篮板5盖帽 @Giannis_An34 在他领导的路上 @Bucks 自 1971 年以来的第一个冠军。 对于雄鹿来说，这是一个多么令人难以置信的赛季。\n\n这些 @MiaHamm 和 @alexmorgan13 卡片将于明天（7 月 21 日）美国东部标准时间下午 1 点/太平洋标准时间上午 10 点掉落。 你要哪张卡？\n\n这 @DevinBook 卡今天下午 4 点/太平洋标准时间下午 1 点掉落。 可以吗 @Suns 今晚将系列赛推至第 7 场？\n\n纪念汉克·亚伦的第 755 个本垒打#OTD 1976 年，我们来看看他的一些最好的牌。 你最喜欢哪张卡？\n\n帮助 @SlabStox 为 Camp Kesem 筹集资金，并帮助父母患有癌症的孩子免费参加营地。 使用下面的链接。收益的 100% 将用于 Camp Kesem。https://slabstox.com/shop/\n\n表现如何 @collin_morikawa 在#OpenChampionship本周末取得胜利。\n\n我们有过很多 @giannis_an34 最近有报道，但当他打出这样的戏时，我们别无选择，只能让它成为我们的#potw.\n\n为了纪念 @spacejammovie 首映，我们正在放弃这些 @kingjames 和 @dianataurasi 今天美国东部标准时间下午 3 点/太平洋标准时间下午 12 点的卡片。\n\n你有没有想过一张卡片实际上是如何进入 Dibbs 平台的？ 嗯，这是过程。\n\nWe appreciate it @ProductHunt", "timestamp": 1655694317, "digest": "KXPFNv5pBxrMbzXKmAWxGkxdXpOXq0jG9X3N09wDOu4", "contributor": "0x78c0A25CcC21604B3D117100DE7c9523f53236C7"}
{"id": "qte8ZJXGkAlao7zr6sippKQDD7cb0ly8IDlTlTn-fYQ", "title": "hello mundo", "body": "### hello people como estan", "timestamp": 1655694380, "digest": "EUjo7ashH5qOB_XqOU0tEsS41CnL-cGnI-6z_vkeulg", "contributor": "0xC051B1F4965dc433389bA8f87A4BA86ef9e64c80"}
{"id": "TNBxScAuf06ZEc7TzDBvi7kN1eGDJyXg4mMk9E9xVWw", "title": "Rabbithole兔子洞完整介绍及交互流程", "body": "一、项目简介\n\nRabbitHole（中文名兔子洞）是用户在实践中学习、赚取加密货币，建立链上凭证，以成为项目和协议的优质贡献者，并通过完成任务和项目获得相应的区块链操作技能的一个平台。\n\nRabbitHole的初始合作伙伴包括Polygon、Aave 、ENS Domains、Graph、Uniswap和Lido ，它们为 RabbitHole 及其贡献者提供代币激励使用Learn-to-earn“学习赚钱”模式。 反过来，RabbitHole 还为项目和协议提供了一种方法，可以根据他们的链上证书来识别、获取和吸引优质贡献者，从而促进更加精英化的Web3。\n\n二、融资情况\n\nRabbitHole 于 2020 年 5 月推出， 由Brian Flynn担任联合创始人兼首席执行官，目前团队共有20人左右。根据官网招聘信息来看，公司在扩展规模，大部分岗位都为技术岗，可以预见产品会继续迭代，这是一个快速发展的信号。\n\n项目的融资方面，RabbitHole 于 2021 年 6 月筹集了 360 万美元的种子资金，由Electric Capital领投，ParaFi Capital、Framework Ventures、Edge & Node、Chapter 1、Late Checkout、Balaji Srinivasan、Larry Sukernik、MonetSupply、Collab+Currency、Slow Ventures和Tony Sheng等参投。2022年2月，宣布获得A轮融资，融资规模1800万美元，Greylock与TCG Crypto共同领投。\n\n三、产品分析\n\n严格来说，RabbitHole兔子洞是比Galaxy银河更早的Learn-to-earn平台，而且前期人气非常高，另外，就是RabbitHole上面发布的任务都是非常的优质的，像早期的uni，ENS，都让参与的用户享受到了超高的空投回报。\n\n虽然官方反复说，鼓励大家做一个真正的Web3用户，不要寄希望于平台发币空投，但我们仍然有理由期待平台会推出治理代币之类的平台Token。即使不发行，我们也可以抱着了解、交互顶级项目的心态，参与平台推出的技能和任务。\n\n目前平台分为Skills技能和Quests任务两个板块。\n\nSkills又分为NFTs、DeFi和DAOs三个大的模块，每个模块下面有不同的任务内容。完成了所有的任务，可以得到该模块的NFT。比如在NFTs板块，分别有Zora，PartyBid，Mirror三个子任务，完成三个子任务后，就可以获得NFTs板块任务的NFT。\n\n![NFTs的任务内容](https://mirror.xyz/_next/image?url=https%3A%2F%2Fimages.mirror-media.xyz%2Fpublication-images%2FIH-93tLFJCrgkLt354wVw.png&w=3840&q=90)\n\nNFTs的任务内容Quests任务模块是不定期的有任务发行，比如前一段时间，发行了一个在二层网络上交互Uniswap的任务，完成任务的要求，可以获得对应的奖励。\n\n![发布的临时任务，有时间限制的，目前已经截止](https://mirror.xyz/_next/image?url=https%3A%2F%2Fimages.mirror-media.xyz%2Fpublication-images%2FZYp3AblsqzlT2pnEbdj_q.png&w=3840&q=90)\n\n四、交互流程\n\n1、首先大家连接了钱包后，记得要做BrightID的认证，在兔子洞主界面右上角，点击进入Setting，会看到BrightID是否做好了认证和绑定。\n\n![进入Setting，做好相关的设置，包括BrightID](https://mirror.xyz/_next/image?url=https%3A%2F%2Fimages.mirror-media.xyz%2Fpublication-images%2FaNDkizT5aI6rgOUTZGXMq.png&w=3840&q=90)\n\n![BrightID做了绑定，会显示Completed](https://mirror.xyz/_next/image?url=https%3A%2F%2Fimages.mirror-media.xyz%2Fpublication-images%2FoHKbacGsSfxen54WRm-Wp.png&w=3840&q=90)\n\n区块律动上有中文官方社区写的一篇BrightID的完整教程，大家可以去看看。\n\nSkills和Quests具体的交互流程，我在油管上特意录制了一个教学视频，大家直接去视频上查看。\n\n[https://youtu.be/qtGndPARdM4](https://youtu.be/qtGndPARdM4)\n\n以下是兔子洞的官方社交平台：\n\n官网：<https://rabbithole.gg/>\n\n推特：<https://twitter.com/rabbithole_gg>\n\nDiscord：<https://discord.gg/rabbitholegg>", "timestamp": 1655694541, "digest": "K_ZPliqxHrUIypj4b2aUXJ0BVXODrkXot_qnQWCGwwk", "contributor": "0xF56302b6c85b6aB9fa9Ec1741c5CCfdC9Fb30124"}
{"id": "AVMoGsJ9Qkb8d3pBmGvFceO59nIwgZiolZK6VqHsL2k", "title": "等待春天，有了坚强的理由", "body": "下村走访，多听到一次诉说，便让我多一份感慨：人生为何如此不易？要折磨得人如此憔悴，难道真的是“此事古难全”吗？\n\n当那些原本快乐的人，话匣不经意间为我打开的时候，当心扉敞开倾诉的时候，我总会感触到他们最柔软处的痛楚，让他们回忆起伤心的时刻，令我唏嘘不已。\n\n“捧在手里整整七个月啊！你想想看，那个刚刚开始跟着你呀呀笑，对着你咿咿呶语的娃娃，怎么能够说没就没了呢？”当那个性格有点男子刚强般的老太勾起失去孙儿的痛苦时，她的悲伤也是悲壮的。本来，老俩口格外的舒心：儿子名牌大学毕业，考取了省级机关的公务员，娶了一位在外资企业工作的无锡姑娘，很快一位可爱的小天使降临到了温馨的小家庭。一切是那么的完美、无缺。谁知命运作弄人，小孩说没就没了，而且一晃四五年过去了，媳妇再也没怀上。从此，每念及于此，一家人的心里便蒙上了阴影。当老人感伤地和我们说起这段灰暗的时光，我都不知道怎么安慰两位难过得呜咽的老人。\n\n还有一位老太太更是因为孙儿的失去，从此大儿媳再不肯原谅她，婆媳间形同陌路。老头不愿去指责媳妇，因为她说，“毕竟她失去了心爱的孩子啊，而且我这个大儿子大媳妇也差点离开我们，我怎么不能理解她心里的痛结呢？”原来25年前，因为使用炭炉不慎，大儿子一家三口全部煤气中毒，虽经奋力抢救，还是没有能够挽回4岁孙儿幼小的生命。媳妇责备公公婆婆，怎么先抢救他们呢？为什么不先救救孩子。“谁不想救呢？他爷爷恁是驮着孩子跑了几里路，想换回孩子一口气，到底孩子又不是溺水的，我们没能抓住孩子啊！”满头华发的老人一边说着，一边眼泪簌簌地掉下来。我不知道，这个原本可以幸福的大家庭，老人膝下三个孩子应该和美的小家庭，就因为这个“疤”，25年间不知有多少次，总是毫不留情地弄伤弄痛一家人的心。\n\n最后一位受访者，满满的只有委屈。他们夫妻俩只是个但求日子风平浪静的工薪阶层。妻子说，我们每天每日的不敢耽误一天上班的功夫，就希望好好挣点工资，看着孩子成长、结婚、过日子就好，谁知还有警察找上门。都怪孩子的舅糊涂啊，怎么就沾染上害人的毒品了呢？搅和得一家鸡飞狗跳的，孩子的外婆生病了也没人照应，我们也被人在后面指指戳戳。\n\n听完一个个受访者的诉说，心里久久不能平静。为什么疾病、死亡、苦难要降临世间呢？\n\n傍晚，一位文友送来残障青年作家王忆的诗集《等待春天》，静夜阅读王忆那“朴实无华、毫不张扬、毫不做作”（曹文轩语）的诗句，忽然让我明白人生坚强的理由。因为王忆告诉我们：我们的未来，可以等待春天！\n\n“我总是想着，有一天，等到那一抹暖阳照在了心底，等到天边划过你灿烂的笑容，也许，那便是我等待的春天，我也总是想着，等到冬日暖阳，等到春暖花开。”\n\n“好在，他们还坚强地活着！”走访回来的路上我只能这样宽慰自己。现在我知道了，面对心底巨大的悲伤、痛楚、困惑，因为生活还得继续，因为内心有春天值得等待，所以人们还是展示了更多微笑的面容。更多的时候，等待春天，让我们懂得把伤痛深深的埋藏，选择坚强。\n\n是的，茫茫人海，因着等待春暖花开的春天，而让我们觉得一切还没有那么坏。于是，我们选择坚强，继而重拾顽强生活的勇气，为美好的未来展开春天般温暖的笑脸。\n\n岁月无情，人心弥坚，等待春天，勇往直前。", "timestamp": 1655694708, "digest": "MozW4C2INJPFPQrtKjjO7y-0zbFfJ-89D_v08UvleI8", "contributor": "0x970A49b663Fc8Db67d36eD62f49B5bd7CB296703"}
{"id": "bAXatvaV8aJ1ksXzaf5LkvWfA_Yt5K6JGIx4ZNblj3Y", "title": "Littlemami Label Whitelist Result", "body": "0x872068e789B865960e5cd68B43539444e90E3eee\n0xec538b8b0D1F96AcA1cD89822AC53a052D762176\n0xE412906CaaaCD918397940533372B146e19340c4\n0x7A63aBBD9eDD789006E7F6e3f51eF7aBE016E207\n0x73cb0A55FA9D22F14F79B9b4C1c594F6F7E423b7\n0x363bE738b2D05b1547e15f138C3e8cCaB423A85B\n0x08a75a75f8bB48f11a2f99Ec5c76E159a5a5CDc7\n0x4011b78D1EcFEdfe5e06215FF3A06eEdcdcb328d\n0xeBDab4B427a80471f245c897AEFD559609824899\n0x62066DF1479B1BE0C709378E4e89d141b4C1de94\n0x2ec9D004Fb2860fCfc0a41960cE0715274527c93\n0x2ff22E41447bE8AcAdBFaB0c95968263DA15dd1a\n0x47eb34e3a72185e574bee149fc7ef2ae80f3258c\n0xCD2488821ffC4036B0Bd633114Ae5E677eA42232\n0xF9c8Cb9dc1826eD3cE7Ccd02fee91b309EA021F9\n0xEF236d9EC6Fd0C41fF43D66527911D15b4ad9a0B\n0xA8982CFb86E26CE894B275CF45965B10C1C3BE60\n0x767Cbe11707E63Fc36835bF6658CeAC9b7E7a871\n0xF5E32dC309299fbB3E9D60BaD3CD5B4D9cA7F727\n0xf8c0c5AC440fDF9872244448E596CD7C0A1561F6\n0xA683Ce059D7456A114391EBE60A6cba164E1d030\n0x16534A694EaCe037B5bF27cAD68d18DfFc61ff8F\n0xe763955eff9C994c3BC667B79b6BedbbC98B3A73\n0xae4d98972b7A80eBD3EbCeEb7C76fA56e3e5ac81\n0x2E32C7815a96dc1A2a1787F9013b0169A242d714\n0xaC030319DA30E6141177F2E04524A7a76bD576D8\n0xf35b602b21d6af30baef884e2c4aab75430d810e\n0x2f2D2ec37c14C590D260A9D0fA775022396E602E\n0xc1119388abd5e81df211B2dBA685053559eBD4aC\n0xDDC52AFf1808286FE343CDe4B517A675cea11988\n0x23CA50e9e5C1BdD1d12aa7CB49Ce81D257BBE4a3\n0xcAC6D41259847eDBfD4358d93581417FeB43fDA2\n0xB957bc46d8dB4D78E3da0ED8e6e12bd38b8a41d7\n0x4Fe55d694061c3B40466adEB41FE844694E938AC\n0xd22475523C3DcbED90f62c9706f36bEd6ce94bfe\n0x4e38F34b049b0B7577abc743b98319b0F3f79bBB\n0x491B0cd48aF0ac739db0CA2AC5bBBe7E7f4d0AF3\n0xCD173E7EDC7091a26c4b2A37C55b6d3fcee8e924\n0xeDfF408Aac2da8ECdC698E80e6dF84155bA4D250\n0x8a2036a20a62f86c07b7ed400fa38944e3c2999f\n0x72279Be414D6A09A83844aebeB9453352129Cf18\n0x8Eaf9A6D676e3168098E4b04797BF10029a6B935\n0x8c160ae51957B016B2F87a2826db39EB676B684d\n0x812D0F5B5F4C70e40480266b86c4Aa5EFAc301CB\n0xF4ACBd25880d5f604D5c1b5A54eD942782B4F038\n0x84BD30b28f001cf5AC114d662A39261adf2d0f7b\n0x9a5Fbec6B9917301023aB5944579b5195a09cAA5\n0x8074284EDfFf743B048b496C1d7b1b88bCaE1374\n0x9c2a03b49b1Cb07b83339564F2eBAfE554E7D988\n0x9B9CE5dB8D246B0A9A2A76471254f542354ac864\n0x44d0f9D204Dc1Eb775481C3fa4C94D2B5Ad34792\n0x22fb332982A7081EDDB4990F4808DAe1F77A90E3\n0x84d0C556f15B9b5E8b98b59c494B3F7a0115D7a7\n0x1aEd39Fb9F5a7CF56E412f4e44594Db7e68FBcf4\n0x2F82d62AEb82c44cFE43AA9043F832599678Dfe6\n0x3499CA45a20bCfa881F130EDb814713cfF494169\n0x52A98cdC044DA2780E355B307ced2B1eA47c380F\n0xA1D7C160077C7883935e4DF900b9db4ad404FF03\n0xB3D7fCAAFB39A21ddAB128fD5eb65f77eB44A8f1\n0x08da385Da9AfF04110E14F7556eF2795f2ff5D78\n0x9Fd93EE7910F47A15D3cb81c703c2b3828184e48\n0x9cC43a6b945592c758fE35b7C47e7343CF57465B\n0x0aF72831ce8E1Be3298d31f81a9a691b8cb83559\n0x3d9af902234B91e94F7fd5d9734A23b596730646\n0x2B2D4c4DBfFabe70a2cb834212cA8716DAfC4fac\n0xEAa211f8EB9e155aFdc4314A8C94934809B763D7\n0xE2AD254D664c43DC453C93313847A01444Aa5179\n0xa28B87D4DA6c011674F9bc9666eb7Ab047C68024\n0xA443c10dA4590A089f53C500015A3d8C064d842A\n0x55FE46E7Fb88C3B89a46F8A4a6eBe9Ef8bf049D0\n0x9D11727DF06BFe53C424443b6F5bf1c7EbCE4a93\n0x9f9A6e91031b4824e72e78e6f9b2170BD3889Ee5\n0x369cef786ad07586906ac4E3c6a2cEFb72153917\n0x583109173217Ad07E0d9Cdd682BD2A0f29e58493\n0x38433451F2236eE5dFc57C0A15C10EB427841b60\n0xc674915aFA8090cE95baF809f33Ac13B49C435AD\n0x132ca0eC2E723FF72881CF6c531095ED08Ff82af\n0xAfef69bdF645A610744788F08Ae769b918c42793\n0x242edaec1907F51e4eE7cf78F92b66fFaFA99474\n0x943319019daA17d8E0d13c29dE0C5c258ecaa206\n0xe3DF219820486B04f501BBaD580bcbaAe453e9E8\n0x3533c6664096c9A10792061f70cB85A7C8fd763d\n0x690ac38d33CdDeb234d1e6c3C71095bDB6EA717F\n0x1010431a4Af473CAbe91187ab20CF95dAc730690\n0xC009B6Fa371A5C2803255BE54AeB83Ae3F6842b4\n0x0b6561e2AF036114071CD8bc85445f4E224834c2\n0x96b8Ab502F30377d0964c2cc1f961209509fBC17\n0x6C108F8a1FBb2B4B8B6d0C142217866F0D982a11\n0xf3F897D5826F6dDAc27547f481c6a17b5fC2D75d\n0xA443c10dA4590A089f53C500015A3d8C064d842A\n0xfE739a6a83eebD698bCd516430C752DA6989adb5\n0xb39B08E820Bf95055Ca2e4901b075a6E414b0694\n0x1963b54774489BfaD2e6a5722e24aE4FdC009f24\n0xd15F655E84aE3705393b9285A2cf80D465767ff4\n0x65bc6f27A9B3A9AF16bfe9Ea1a6d7D61E87c93fC\n0x78aA537457A55Cfd720beE531160784b065C8D09\n0xC4725eAa893603E03B374A4218E29d48Be3b129c\n0xe00E3Ab15F238020d69E715A019b1287B4769b98\n0xBe16Bc273ff67d6CCaa72555A0E265b083078137\n0xDb6A2de3Dc6bb1f2172DA356f929f992D76107aB\n0xa680294c136deD0b3E4ba4d9Ffe70A4191A8ccC9\n0x65034b4A3e9a87bFBb394d5DdD3DaEDB1A50D748\n0x1F1952F30FdBeE45C6ea1D793108e04d2567D8e9\n0x27D6A2a33D6d8BbB74c364cB5C0A2f1c4080b839\n0x48937c1Be5899B4d9f8eb760f1FE4c46983CeF00\n0x2c993a9E5c77Aab421D5BD66A6fF37Cb5A1A4c35\n0x6da4e74007A4Eb1FAC81d8d85BD089f04e59F464\n0x836Bfc5Afe687feB0B56c1dE9e6893fA70b4ccda\n0x81468e57Aeb91DB04C5c3945E76Ae0848096B239\n0x764aeCCfcf8ACF205b8eEF519Ca003d126BC35dC\n0xC53804Dd8E07Ad3168e389bE91e3F09083704550\n0x73D86b938F480aBc2022E1DF89E1dEb0Dd6Bc4ed\n0xcA2749B3C68D7C3CD7D7b806db5b69aC593532eC\n0x9b0F69A182B8ED8F64B9d96B8e2fdEafEa740E3c\n0xE947a586EBeFe01b9644133e89C1e38d7EeA6946\n0x2c993a9E5c77Aab421D5BD66A6fF37Cb5A1A4c35\n0x9b0F69A182B8ED8F64B9d96B8e2fdEafEa740E3c\n0xf9fFA54e94504093ceb9002B27Cf25Ba90b65d84\n0x4C166C8AE4ACC2C334397196624177Cb8876Be27\n0x26E35b04c832628102C0DDf4f350b0E27E1e9810\n0xacF73eC6afA8777CE8C7cdF075Ba0084Ae953951\n0xE4D0fC91cFEAA8C3737A0cE1e20ea65ba3BcfE6E\n0xB4b4a2F8fD5bDDaD87408bD4EA98a73684695B35\n0xf86e0E620E18a88382B9EA474e4b7da061809bd3\n0xe27f584aeb99bD5777501393225FaA2110dC9C3A\n0x75Be9A75B06744A17F436CDDa6cd3C5d22975ecE\n0xAbB52309433c8A34E39DCBD90D81852007a1c269\n0x11949cB737f5F8CAF5633C28397B09065218ed9C\n0xA0759FcbcD1bE5D0731bFB24fdB820a73aC8383C\n0x491B0cd48aF0ac739db0CA2AC5bBBe7E7f4d0AF3\n0x583109173217Ad07E0d9Cdd682BD2A0f29e58493\n0x9523C23a2766Cd2E3c3bBd27c1E492fbccEEcC59\n0x77FDBF364e16dd1D2416D4CB0A6a8C4994BBA2Ec\n0x9f9A6e91031b4824e72e78e6f9b2170BD3889Ee5\n0x6C108F8a1FBb2B4B8B6d0C142217866F0D982a11\n0x2B2D4c4DBfFabe70a2cb834212cA8716DAfC4fac\n0x5A652F957C808A6570fd9Dd1FaF7C7A919B1e5ac\n0xDe9a9425b3CE28f66719eA606B1d1FDda210A94d\n0x6D7CD57ED0f4dcc99AC5C07Ea4721327A4C88B07\n0xE06c087534Ce2B02E0e4f9Ac285341b88734ec9C\n0x00F3e52AEBbB6e4Aa6a3b9c69EC13fC623cf09dc\n0xC6FF29dfc63Cb0F1c2b511c9ae8E0c070843668D\n0x978923b244cC1E8586104118b55F295b41DBb140\n0xA8D69b858427C5EE27eF01765070712B6Ab734e2\n0x82154c00D43359965AAf4eC1e25912d03c87153C\n0x18AF1E859FE784Fb743b6b6EAf0B218Cd78E687F\n0xd5AD56324dF02636ed15bd9393cc1FDc8aA418eB\n0x4331979F97bA37F89315ce7cB0807d6D4446EB82\n0xECfeB4030c23A202d8aCf86DdB33a94D56534e8C\n0x1797bD5618Ba6aDdf158Fc9F5ab3B58de838a2B1\n0x99348D690DE2E481cd1Ef33F2dB5c2Cce9dd6c25\n0xBd5297C562bB87c4195f191653e7b271182952d8\n0xe87C30F71800c63528BE8A87F134FF0BB8888888\n0x74816c29ABd655AD3F853907A35Ee16c723046fB\n0x5ab52107aaAe59000C4f5B7B8427c8a4e69641D7\n0x9292FCbc6F931Fe4AF4454009c54AeEE6B887f9f\n0x592d10Ca8583B772d09f57a66a1428B0E8eD1B24\n0xbD749CD97e34E338Bc379b0c3F0a966b67Ca3dFb\n0x64Af1501Cde02752dF353bEfC9dc0142650A5D60\n0x166b3C4274ae037acce1760Acd3CBC958b4Af00f\n0x8c3e3Fd5076f85a52e233712C8dA871aa71F1d65\n0x72260915897a0d1ADAE48b440a3eEd5CddE7B5fb\n0xcc7d5046F12de95325f3d78eD29C6d4AA5cfA112\n0xfdF15839C7f75a56b92F5BEd7BDc727e1bde862F\n0xb39842801A5d10C62eCcbAfb94311A1400904F6C\n0x6C067926dece192631B92F43A5aC3E29B5d02b0D\n0xeB63534a8b0FA491057d0FA74A6F694C009d07cd\n0x00F98Ba606119f4A6e6591af38648878bA505C05\n0x8C702A9a6e0cd14a53251C630743c4F5327eddE8\n0x8241D2C5b1C5cD4f4B5551A3FaF846Cd841E9188\n0x0d7f7A10dB4f92D0F367C4CA4b518F0D9d73306F\n\n0x7D9F4fa542Be3574D72f8E0df6E481E2eB664156\n\n0x739EF385C2bd1c366f33A6996b994c35EE34c58f\n0xE4c316A953BE67A367eC0afe5257F0AbA9d3bB61\n0xbD8071F63f9Db8725d8597909A31eFa0c92E2e99\n0xB0cF724E9f83bDB9D96A6B28bBAa824023D52702\n0x066CCDCddb2b07A41c54050dbf14Ca4c6f6560dC\n0x1fb3622c25eB298e11B51672C09941516Ffbe2cf\n\n0xb2d4Acb9eC4faa07a7a5EE2365De75577C2d3D0E", "timestamp": 1655694740, "digest": "ssflemu-OFo0T-GYFY29qIuYmZf0oD6lmNGk8cXU9gU", "contributor": "0x8249Cf5B3b6df54a6A218561968388148A43b603"}
{"id": "pdVLFuMialxnSBvPL7R2984yhsDh8Jyom8z8VFlBxmg", "title": "Test Title", "body": "Test body", "timestamp": 1655694827, "digest": "rUqByh6Ha6XuPvdAsdJ6fXMGKFuiZvPswJadafBn_q4", "contributor": "0x8169254afdDF6614A7abBc84BE37d80e74932870"}
{"id": "SyjHX2-jUlQhgPXDD-XfJ_y5JFk3pke8CQGhWnwNKNw", "title": "夏日四则", "body": "初夏初夏羞怯地来到世间，像小孩子。小孩子见到生人会不好意思。尽管是在他的家，他还是要羞怯，会脸红，尽管没有让他脸红的事情发生。小孩子在羞怯和脸红中欢迎客人，他的眼睛热切地望着你，用牙咬着衣衫或咬着自己的手指肚。你越看他，他越羞怯，直至跑掉。但过一会儿他还要转回来。这就是初夏。\n\n初夏悄悄地来到世间，踮着脚尖小跑，但它跑不远，它要蓬蓬勃勃地跑回来。春天在前些时候开了那么多的花，相当于吹喇叭，招揽人来观看。人们想知道这么多鲜花带来了什么，有怎样的新鲜、丰润与壮硕。鲜花只带来了一样东西，它是春天的儿子，叫初夏。初夏初长成，但很快要生产更多的儿子与女儿，人们称之为夏天。夏天不止于草长莺飞，草占领了所有的土地，莺下了许多蛋。夏天是一个昏暗的绿世界，草木恨不能长出八只手来抢夺阳光。此时创造了许多阴凉，昆虫在树荫下昏昏欲睡。\n\n人早已经历过夏天，但初夏第一次度夏。初夏走进湿漉漉的雨林，有人问它天空为什么下雨，初夏又扭捏一下，它也是第一次见到雨。这些清凉的雨滴从天空降落，它是从喷壶还是筛子里降落到地面？天上是不是也有一条河？初夏由于回答不出这些问题而脸红了，比苹果早红两个月。初夏坐在河流上，坐在长出嫩叶的树桩上。初夏目测大地与星空之间的距离。它寻找春天剩下的花瓣，把它们埋在土里或丢在河里漂走。初夏藏在花朵的叶子下面等待蜜蜂来临。初夏把行囊塞了一遍又一遍，还有挺多草木塞不进去。要装下这么多东西，除非是一列火车。\n\n仲夏夏天好似乐曲里的中板，它的绿、星斗的整齐和蛙鸣呈现中和之美。夏日与夏夜的节奏匀称，它的肢体饱满。夏天的一切都饱满，像一池绿水要漫出来。庄稼和草都在匀称之间达到饱满。夏日的生命最丰富，庞杂却秩序清晰。生命，是说所有生灵的命，不光包括庄稼和草，还有几千种小虫子。有的小虫用一天时间从柳枝的这一端爬到那一端，而它不过活十天左右。小虫不会因为一生只有十天而快跑或慢爬，更不会因此哭泣。每一种生物对时间的感受都不一样，而“百”和“年”只是人发明出来的说辞。小虫的时间是一条梦幻的河流，没有“年月日”。命对人来说是寿，对小虫来说是自然。虫鸟比人更懂缘起性空的道理。\n\n夏天盛大，到处都是生命的集市。夏天的白昼那么长，仍然不够用。万物借太阳的光照节节生长。老天爷看它们已经长疯了，让夜过来笼罩它们，让它们歇歇。有的东西——比如高粱和玉米，在夜里偷着“咔咔”拔节，没停止过生长。这是庄稼的梦游症。在夏日，管弦乐队所有的乐器全都奏响。电闪雷鸣是打击乐，雾是双簧管，柔和弥漫，檐下雨滴是竖琴，从石缝跳下来的山泉水也是竖琴。大提琴是大地的呼吸，大地的肺要把草木吸入的废气全吐出来。它怕吓到柔弱的草，缓缓吐出气。这气息在夜里如同歌声，是天籁地籁人籁中的歌声。\n\n许许多多的草木只有春天和夏天，没有秋天，就像死去的人看不见自己墓地的风景一样。\n\n夏夜深邃。如果夜是一片海，夏夜的海水最深，上面浮着星星的岛屿。在夏夜，许多星星似乎被海冲走了。不知从哪里漂来新的星屿，它们比原来的岛屿更白净。\n\n夏天流行的传染病中，最严重的是虫子和青蛙所患的呼喊强迫症。它们的呼喊声停不下来，它们的耳朵必须听到自己的喊声，听上去如同赞美夏天。夏天如此丰满，虫与蛙的呼声再多一倍也不算多，赞美每一棵苹果和樱桃的甜美，赞美高粱谷子暗中结穗，花朵把花粉撒在四面八方。河床满了，小鸟的羽毛干干净净，土地随时长出新的植物。虫子要为这些奇迹喊破嗓子，青蛙把肚子喊得像气球一样透明。\n\n雨下在夏至的土地上到了夏至，雨水不再是陌生人，它们像投奔故乡的游子，踩着云彩回到夏至的土地上。\n\n夏至，雨的声音大过河水声、庄稼拔节声、蛙声。雨说给土地的话，要在夏至这一天一夜说完，土地根本没有插话的机会。对雨水而言，春秋冬三季造访土地只算做客，夏至才回到自己的家。\n\n草毛了，从春天开始，草在雨水的定额里断断续续生长，属于计划经济。而到夏至，草逢豪雨，尽情挥霍，一边喝一边生长，还有余裕的水分洗一洗脚丫缝儿的泥。水有的是，草在风里甩去袖子上的水。白天，城里的草呆观街景，在夜里像冲锋一般疯长。以往如城堡一般的云朵全向夏至投降，化为宽大的灰筛子筛雨，减轻天空的重量。\n\n二十四节气里边，夏至是第十个节气。公历6月22日前后，太阳到达黄经90°，此为天文学之夏至点。这一天，按照旧学说法，阳气极至，阴气始至，太阳北至。夏至之时好像十二时辰中的午时，11点～13点，阳鼎盛而催阴生。这个月，属十二生肖的午马当令，奔腾暴烈，下点雨只是小意思。卖弄一点中医学说，午时或者夏至，归于十二正经中的心经。心为火脏，刚烈蓬勃。火与心、马与午、夏与阳，都说生机勃发之至，乃至夏至。\n\n大地母亲一手拢过雨水的子女，一手拢过草木的儿孙。这时候，大地最高兴，像看见满院子孩儿乱跑，天真无邪，比秋天的成熟还好看。\n\n七月有权利炎热七月有权利下小雨、大雨和暴雨。野草在汪洋中露出绝望的头颅，它的手在积水里写了无数个水字，却没一个字浮出水面。七月悬挂着骄阳的火炉，把土壤晒得开裂，蚂蚁得到纵横四海的地道。野蜂在七月结成网，吮取所有植物的花粉，让大地变成蜜地。野蜂改变了七月份每一个早晨的气味，在青草的苦味和河流的腥味里加入透明的甜。空气如同黏稠的漩涡，不知去哪一棵树上结晶。\n\n七月在每天的傍晚都戴上玫瑰色的草帽儿，帽檐宽至天际。地上的花朵与西山的晚霞共同跳一支舞。它们的舞步在风里燃烧，草帽里露出窟窿，露出隐藏在里边的星星。", "timestamp": 1655694797, "digest": "-qknb3DFYGm0oAJWD3f6naI4WKOWosrtkAO0J3l5f0I", "contributor": "0x986255feb8f44E52B0Bf8F84211B12952198738D"}
{"id": "-1I5rolQRF_gFA0Lv5GtokZkShT1mGmR_iHzTID5rbQ", "title": " 区块链跨链赛道中的种子选手—Connext\n", "body": "对链上的朋友们有一定的了解和圈内各公链的参与度，受链上各公链的生态圈的了解和了解的项目的不同性质，同时导致加入不同环境的不同公链上不能进行代币的交换，直接链行业的最大尺寸是雨生态区块链本身本身的。于是，链行业的技术发展者们马不停蹄地进行了牛蹄的雏形，就在最近一年，就可以同时多的跨链项目和技术发展后春暖花开。这一系列的趋势和趋势也出现了。\n\n```\n而Connext，这是众多跨链项目中非常引人注目的赛道种子选手。\n\nConnext的使命是为全球用户市场打造简单、可扩展和安全的下一代 dapps 和协议。 Connext专注于解决可扩展以太坊的关键用户体验\n```\n\n和信任障碍，这促使我们去年在以太坊生态系统中建立了第一个完全信任最小化的桥梁，迄今为止已完成超过 700,000 笔交易和 1.3亿美元 的交易量。通过项目方最近宣布的Amarok 升级（并与 Nomad 合作），很快将成为第一个也是唯一一个在不引入可信交易对手的情况下实现 链间通用通信的网络。项目方相信这一突破将推动围绕信任最小化跨链应用程序 ( xapp ) 开发的新一轮创新。\n\n通俗来讲，对于我们普通区块链参与者来说，Connext不仅提供了不同公链之间代币的跨链交易，同时也提供了以太坊二层链之间代币的 跨链转账交易（解决了二层链转回一层链时间超过一周的弊端）。况且，总体交互GAS费很低且跨链转账速度较快，一般交互后几分钟内其他 链地址就能接收到对应代币。\n\n```\n项目代币：\n\nConnext项目方将在ERC20链上推出其项目治理代币（令牌）：NEXT。\nNEXT 是一种 ERC20 实用程序和治理令牌，可为网络的公平利用提供动力。NEXT 令牌的目的不是提供安全性，而是在Amarok升级后维护路由器的操作公平性。\n路由器，即 Connext 的节点，质押NEXT 参与网络，并从网络中获得一定比例的工作份额作为回报。NEXT 通过确保所有路由器遵守关于公平交易排序的相同规则集\n```\n\n来保持这些网络，被系统跟踪网络行为者的，解决路由器的NEXT将推动前行的发展。还有生态程序社区的，NEXT管理下的金。是主要贡献者通过前行的发展。\n\n```\n此外，令牌已部署，但尚未公开。\n```\n\n当前的代币的高级详细信息： 下一个标准：ERC20 总供应币量：1B 以太坊上代币的代币数量：0xd63014F367aFe2eb006FD3dD6C0110A9dCE42dC 状态：随着未发布方发布的代币发布，将发布更多代币发布和技术治理的信息。\n\n如果方代币的成功投出方的项目方空投出3个生态部分，空代币的项目成功投出方，方代币的成功投出方，方代币的成功投出方的贡献者，人物代的成功贡献者：五位出方活动者、网络活动者、组织者。主办者与活动领导者。贡献者空缺。\n\n下一个参与者，可加入官方 Discord.gg.", "timestamp": 1655695164, "digest": "ythSHEwowQ0HQ9MPi968qoHwu1BGBoEorSCm1Pl8Yho", "contributor": "0x5D359400cef3870504448c2ABEFfFe1cef18D171"}
{"id": "cveU4ls4P2LVTodp0tWPejjFGQypPCVzSS07SrYxBbg", "title": "mirror", "body": "mirror", "timestamp": 1655695007, "digest": "-N0JfkVqa8aAXHP6Hrl4ei2OHLVmyUrQTU56iBP2oaM", "contributor": "0xCe6F0D667B3C330FEdD7d72746BaF5a1dd367151"}
{"id": "DBrUjhsBPsFXBoMp3Qs2kRETPSNjL5T5noFAoeKFIgI", "title": "mirror", "body": "mirror", "timestamp": 1655695157, "digest": "leVGCcHxNiMhqdcF47Qf0b2a9TbXqvHTeWp-qe9Uwds", "contributor": "0x30363E870336F94FbfBd1969e696a80Ee7C0622c"}
{"id": "sVC7vsIYorK-FPSSFMbJOG0tQbmXD73cUREMYdVCzB0", "title": "Test Title", "body": "Test body\n\n![](https://images.mirror-media.xyz/publication-images/NrYOG9GWJ69LRnCQRUZZ2.png?height=860&width=860)\n\n", "timestamp": 1655695170, "digest": "rUqByh6Ha6XuPvdAsdJ6fXMGKFuiZvPswJadafBn_q4", "contributor": "0x8169254afdDF6614A7abBc84BE37d80e74932870"}
{"id": "UYANcPvX8Y8ffogub35kep9kP3yTcm9-Xfpz1kqefkQ", "title": "Test Title", "body": "Test body", "timestamp": 1655694996, "digest": "rUqByh6Ha6XuPvdAsdJ6fXMGKFuiZvPswJadafBn_q4", "contributor": "0x8169254afdDF6614A7abBc84BE37d80e74932870"}
{"id": "wVfoXvfeZGHGaKIE3SE4clPQNz-G7NAGS66WbXudfrY", "title": "mirror", "body": "mirror", "timestamp": 1655694870, "digest": "6q6PeZ2iHCSyAX65Xe7SAWd6hpLKtKZIFJTJP1d6U7k", "contributor": "0x0854abC5DB1F2E150E5b9ED40421a8Ca3d759a15"}
{"id": "xGgvEZ1wJnoQrr6CV0viyavgrz-NcUVDO2fWCBFZI1o", "title": "一文带你了解Coinlist打新", "body": "**Coinlist**是一个合规代币融资平台，由协议实验室Protocol Labs、AngelList建立，利用未来代币的简单协议SAFT合规制造新型证券，且该证券完成以符合现有规则。Coinlist获得众链投资的区块链也风投，包括**TwitterJack Dorse**目前的**TwitterJack Dorse**资金平台大概是产品服务，募捐教育，慈善币圈赠品等参与发行；而在做创始人，公司的代在上链参与前，为各种投资人项目早期的机会。\n\n![](https://images.mirror-media.xyz/publication-images/vQp-8lMyDyQfnmTdIQuw2.png?height=427&width=1080)\n\n**1.CoinList 是什么？**\n\n对项目方而言，投稿人的包括：将人员的新项目在平台上公开展示，以便方决定是否为项目方决定；为项目方提供合规调查职尽未来调查等服务，以便项目方提供服务认定人是否为合格者的录入和分析币，帮助我们完成币的情况和了解销售情况；完成币后的代交易配置（功能），我在交易时的数据会详细介绍**。选投资项目时在过去2年的时间里，共有3000多个项目联系，最终只有12个合作**伙伴，在决定合作方的时候，正在思虑合作方的时候，会与合作方进行审核，但会立即发布。\n\n**2.为什么会重视Coinlist**\n\n首先，很多重量级是在 Coinlist 独家完成 ICO 的，Filecoin、DFINITY、Algorand、Nervos 等，如果你要参与这些项目的公售，也就是 Coinlist 一个管道。行售的。\n\n热门币种，目前第一时间上线的，价格合适的币种，项目可能上线的同时下一个重要的币种，同时投下一个重要的币种，并且如果下一个加密货币此法种3500。\n\n![](https://images.mirror-media.xyz/publication-images/HBSD02gy4YRsCOl1LKPH3.png?height=985&width=1080)\n\n**3.Coinlist成功的原因**\n\n**合法合规**：那些不会在台下投的公司共同出资，通过参与的项目是**有其他资金的项目，可以说是另一种等级的代路、不情况。**\n\n**独家这些ICO**在过去有大型的区块链公司独家：Coinlist开启代募资金，象Filecoin、Dfinity；是Coinlist项目早期想要参与的投资，你通过，无法在其他地方已经拥有的交易。平台：Coinlist除了可以协助做代开放募资外，目前也有自己的参与版公开Coinlist Pro，专为做募资的区块链项目服务，即将在第一时间上线交易平台。\n\n**与机构**的关系支持由各种加密货币列表和押金系统都支持：Coinlist 和押质系统都由一个加密货币列表和押质系统做一个加密货币清单，Bison Trails 和 Bitgo 加密货币清单。而 Coinlist专业的市场市场支持，它们是由货币，其团队和来自高盛，另一家Citadel，未曾是美国市商，但西格玛却是加密货币做加密货币\n\n**早期的投资机会**：而对虚拟货币的比较好的朋友，加入的方式不外乎就是通过一、验证市场来。骚”的话，最后都沦为在捐钱的菜；而市场通常也只限定一级给机构、创投、资本参与，**而Coinlist就提供了一个让散户也能参与早期投资的好地方。**\n\n**4.CL打新能挣钱？**\n\n可以查看到该种币种筹募平台的币种公募平台目前**18位全球ICO排名第1的币种**\n\n![](https://images.mirror-media.xyz/publication-images/uVqudlRLZWrj-z6XGs9i1.png?height=869&width=1080)\n\n**5.CL打新回报率到底如何？** \n\n币价最高时的回报率来计算，回报率从160%-1360倍不等。\n\n202年在Coinlist众筹SOL目前是ETH的第三大公链，最终达到180倍的倍数**！**\n\n2021年3月在Coinlist公募的CSPR最终**达到1359倍！**\n\n在CL的打项目中，10倍以上的回报率**高达67%**以上！\n\n众筹，能抢到CL宝的一个典型应用，众筹项目，让你点击赢取所有城市名牌的众筹！\n\n![](https://images.mirror-media.xyz/publication-images/xl6jxujx7Aqu4eHSRdWTj.png?height=1022&width=1080)\n\n让我们一起做时间的朋友吧！", "timestamp": 1655694993, "digest": "makx2xfCgzVvrrxYFbYXYG6DC__dfQzSivDNPRTL47A", "contributor": "0x784bcb3BEe13Ef9EBc217463592Ca03c9eCc2bB5"}
{"id": "5exdZWSIUTLCfUfOHhbyySvDHU94Eui3OJQymQqa1mA", "title": "Hello World", "body": "Testing", "timestamp": 1655695268, "digest": "QYK0YYw6UFQp8UlNQUpxlohrYJuTvECdouh4TYeUzmQ", "contributor": "0x047F606fD5b2BaA5f5C6c4aB8958E45CB6B054B7"}
{"id": "EpNCA31GC-f07MpiGIiweDfJZBk5oK9ZgWf-5ZKplmo", "title": "Endstate Announces $5.5MM Seed Round", "body": "![Endstate Seed Round Investors](https://images.mirror-media.xyz/publication-images/v9dmOfPP1g94VgPbfiDLr.png?height=1080&width=1080)\n\nThe name “Endstate” reflects our belief that the end state of product ownership will be achieved when all physical objects of value have a digital counterpart. Endstate will lead the evolution from a “single-state” world to an entangled world. In our view, items that exist in only one dimension are as primitive as the telegraph or a car you have to crank to start.\n\nStarting with sneakers, we combine NFTs with proprietary technology to definitively link physical products to digital assets. And we’re not going to the Endstate alone. We’re collaborating with athletes, artists, creators, and brands to bring their stories to life by uniting the physical, the digital and the experiential. With every collaboration we’re building towards a future where physical and digital are completely entangled.\n\nChanging product ownership forever means that we cannot stop at sneakers. Working to grow Endstate into a boundary-defying brand means building out expansive experiences in 3D, AR, apparel, and collectibles of all kinds.\n\nToday, we’re proud to announce $5.5 million in funding from a world class group of institutional and angel investors who share our ambition to usher in the future of product ownership:\n\n**Archetype Ventures**: top-shelf credentials and huge network in the crypto space, we couldn’t have asked for a better lead.\n\n**Accomplice Ventures**: track record speaks for itself - the ultimate resource as we work to grow Endstate into a global brand.\n\n**Castle Island Ventures**: some of the most outspoken advocates and greatest thinkers in the crypto space. As a Boston-based, web3-native company, we had to have them in our round.\n\n**Road Capital**: early bitcoin advocates, legendary investors and operators with far-reaching connections.\n\n**CMS Holdings**: supported us since the beginning. Not just the best follow on crypto twitter, the CMS team are the people you want in your foxhole.\n\n**Permit Ventures**: two decades of investing experience and the best sneaker collection on our cap table.\n\n**John Capodilupo**: world class founder, engineer, and technologist leading the field of health tech and wearables, helping us navigate the intersection of physical and digital.\n\n**Antonio Bertone & Alex Drane**: unmatched creative talent. Created and led global brands at the bleeding edge of fashion and apparel.\n\n**Jerod Mayo**: investor, businessman, and Super Bowl champion with a legendary work ethic (will also help raise the team’s average bench press).\n\n**Will Ahmed**: founded and scaled one of the most innovative tech companies in the world. An invaluable resource on all things business, performance, and culture.\n\n**Peter Bell**: decades of operational and investing experience at the early stage. Mentor extraordinaire.\n\nRaising this seed round will help us reach the Endstate sooner -- accelerating our product development and innovation roadmaps, and allowing us to continue to hire world-class talent.\n\n![Endstate Drop 0 Colorways](https://images.mirror-media.xyz/publication-images/PUp-P9fOe2bJ9zKQYeDDy.jpeg?height=4154&width=5815)\n\n–\n\n*Endstate was founded by Bennett Collen and Stephanie Howard out of a lifelong passion for sneakers and a deep understanding of the power of blockchain technology, specifically NFTs.  Bennett is the former founder/CEO of Cognate, which was acquired by GoDaddy in 2018 for its pioneering use of smart contracts/NFTs to represent trademark rights, and Stephanie is a legendary designer known for her work at Nike, New Balance, and Reebok, including one of her most notable designs - the New Balance 850.*", "timestamp": 1655695201, "digest": "iizYnUu5zyZE5403Tu54tG0CGnbbH_IIOgLVB8ukTAs", "contributor": "0x0c5c2E6A4cE269106bA9ae1eA397b02B9643111d"}
{"id": "Kap_96DI9jiV4dVHvw1QZFexpSoHX6ii3r2zRF-D-X8", "title": "mirror", "body": "mirror", "timestamp": 1655695311, "digest": "MqCPBcn-R6IFoXcZlePiww-uS1JJ3todWRqlUCoMNoY", "contributor": "0x0a5Dd94dA2157a458f1e732E820b7894E90a4ec4"}
{"id": "Y6DDBrSuiOqf8fhanu9HlCGeESdIe9XzeA4p439WhKo", "title": "走不过边境的树", "body": "我在俄蒙边界见过一棵树，姿态奇特。那一片戈壁寸草不生，像矿石一样大小均匀的白石块分布在干燥的红土上，土像晒过的烟草叶子一样红。这里只有一个植物，就是这棵树。它的树皮灰白，主干在一米多高处向后倾斜，像人的腰向后弯。仅有的两根树枝向前伸出，远看，如一个人捧献哈达。不知什么人在两根树枝之间系了一条丝制的白哈达。风已扯烂了哈达，碎片在风中飞。\n\n蒙古国的东方省在树的背后，它献哈达的方向朝着俄联邦的布里亚特共和国和更西一点的贝加尔湖。早上，这棵树的影子很长，两根树枝在地下的影子分得很大，像伸开双臂的巨人的怀抱。树在头顶长了一小簇叶子，如一个帽子，那是这里唯一的绿色和叶子。在影子里，这些圆圆的树叶是巨人的头发。\n\n我把一条蓝绸哈达系在前伸的两根树枝上。哈，好得很。早上，旭日像一个红探照灯在东方的地平线举起半轮，土地变得更红，石头半红半白，牛群在如同燃烧的河边饮水。我想起一位和胰岛素有关的科学家的名字——牛满江。\n\n我觉得这棵树通灵，它身体后仰如唱长调。长调的尾音很长，人须把肚子里的气吐尽，身子要尽量后仰，哈扎布就是这样。这棵树的树枝是弯曲的，所谓虬枝，好像伸了很多次（或很多年）才伸出去。我想象树冠下面的树皮是它的脸，皱纹早就刻上去了，还应该有一双眯起的眼睛（仰面歌唱不可能睁大眼睛），是蒙古人细而小的眼睛。眼睛下面是一个鹰钩鼻子和唱歌的嘴，胡子在高颧骨下面翘起来，像灰鸟的翅膀。\n\n布里亚特——贝加尔湖西岸，是许多蒙古人最初的故乡。一位住在乌兰乌德山上的大萨满师说，他的祖先曾生活在贝加尔湖岸边，敌不过入侵的沙皇军队才退到了如今蒙古国的东方省。\n\n贝加尔湖像海一样辽阔但比海安静。我早上沿着湖边的公路跑步，见到踉跄的醉汉。公路两边无村庄，不知醉汉从何处走来。他们耷拉着脑袋，像寻找自己走过的脚印。贝加尔湖的丰满把天比小了，天在湖的衬托下显出窄，云朵也少。贝加尔湖最深的地方有六十米，里面不知藏有多少神奇的生物。我看湖似无所见，找小的东西看，那就是鸟。我坐在岸边一尺厚的松木椅子上看鸟，两三只白鸟飞来，长而尖的翅膀如握着闪银光的刀鱼，盘旋远去再回来——其实飞回来的是另一拨鸟。我觉得鸟最容易让人想起故乡，而它离自己的故乡最远，它的翅膀让它终身流浪。蚂蚁一生所走的路都没离开故乡。我想象这些白的鸟、黑的鸟是我的祖先，他们不知从何处迁徙到了贝加尔湖。这是多么好的地方啊！他们一定这样想，可以祖祖辈辈住下来，之后又迁走了，就像鸟。鸟找不到一个好地方吗？为什么老飞？它要去的地方叫——宿命。\n\n我想象这些鸟在空中发现了我，它们以为发现的是我的祖先，我至少在相貌上像他们。水鸟用两把银白的长刀划破腥味的空气，橘红的爪子贴在肚子上。它们盘旋，看我有没有翅膀和红爪子。我身上勉强可以称之为翅膀的东西只有耳朵。鸟越飞越低，降落到离我头顶不高处翅膀再挑起来，鸣叫声如——哦哦嘎，似乎要带我走。哦哦嘎是什么暗号？我对鸟也说——哦哦嘎，让它慢慢体味吧。\n\n我如果能够跟鸟一起飞就好了，我先飞回家看我爸我妈，告诉他们贝加尔湖的见闻，然后说——哦哦嘎。他们大为惊讶，上上下下看着我。我再说一声“哦哦嘎”，我爸会缓缓地说，贝加尔是蒙古语自然的意思，那是我们很久很久以前的故乡。哦哦嘎，我说。鸟的翅膀会扇动游人全部的思乡之情，俄蒙边界那棵树分明想回家，它的家也在贝加尔湖的边上。这棵树可能是人变的，也可能是鸟变的，总之它想回故乡。最为触目的是这棵树离边境线只有十来步，但它过不去了，只好伸出双手，只好仰面高唱。\n\n在南西伯利亚，说树会变成人、人会变成鸟丝毫引不起别人的惊讶。布里亚特的导游晓布告诉我，他家一只黄母鸡被大风刮进了山里，三天三夜之后回到了家，羽毛变成了紫色，但比薰衣草的颜色浅。这只鸡下的鸡蛋里面包着一只鸽子蛋。他说，在巴扬（纽扣手风琴）的纽扣上洒一点燕麦蜜、一点羊尿、一点贝加尔湖的水，它的音色就像老人一样嘶哑，半夜里会自动演奏图瓦民歌。\n\n假如把燕麦蜜、鸡蛋里的鸽子蛋、羊尿和黄眼睛人的牙都堆在这个手捧哈达的树的脚下，能不能让它行走？我把这些蛋、尿和蜜喝下去，身上背起巴扬，能不能见到我的祖先？大萨满师说他们来过了，来看我。我仿佛见到了他们——十六世纪的军官和医生，他们和我的脸型一样，气味一样，板牙一样。他们聪明，但会突然办一件愚蠢的事，我就这样，好在意归心窍，平静如初了。\n\n我舍不得这棵树，在黄昏里，它的形影让人不忍离去。你献给贝加尔湖的哈达不要再捧着，让风把它吹进湖里吧，而飞过此地的鸟也会把此景告诉贝加尔湖。", "timestamp": 1655695343, "digest": "A5GliwW8IjUh2KMYDEeFQnc9684wRlb_MiW5Ybf5SN4", "contributor": "0xe0599b401741061ff54FB4aBc2D6FbA7f40766F6"}
{"id": "_0CoRve8_xgec6rtbLacy4cf6CR5yobjNznF70u846k", "title": "mirror", "body": "mirror", "timestamp": 1655695442, "digest": "9kuy-m9yo28FTX16EVeo-x5x5QB8SUUYZx9Ex7gNxpA", "contributor": "0xA19DDa96dc209d1B49cA30B9a7286b38D3419052"}
{"id": "6NmUN7vQ5tBRsinBOxd7gT7oySyk8d1PxQzWbbe0TYY", "title": "Hello World", "body": "Testing.", "timestamp": 1655695515, "digest": "D9dFQq4DrgmjQefqujiwB04q0yPwrhrJCWwVGIFntFo", "contributor": "0x4B5922ABf25858d012d12bb1184e5d3d0B6D6BE4"}
{"id": "dVnG57uzzI3st_zzF0oBVuIDgbOeV3sUzcrsOk_QgKQ", "title": " 区块链跨链赛道中的种子选手—Connext\n", "body": "对币圈有一定了解和参与度的朋友们都知道，区块链各条公链受制于本身生态的局限性和排他性，导致同时加入了不同生态下的\n项目代币因为身处不同公链下就不能进行代币的交换，直接大大的限制了区块链行业本身的技术发展。于是，行业从业者们马不停蹄的改良\n生态和技术。最近一年，越来越多的跨链交互项目如雨后春笋般的冒了出来。这预示着行业的一大进步和发展，也预示着下一个热点和风口\n的来临。\n\n```\n而Connext，这是众多跨链项目中非常引人注目的赛道种子选手。\n\nConnext的使命是为全球用户市场打造简单、可扩展和安全的下一代 dapps 和协议。 Connext专注于解决可扩展以太坊的关键用户体验\n```\n\n和信任障碍，这促使我们去年在以太坊生态系统中建立了第一个完全信任最小化的桥梁，迄今为止已完成超过 700,000 笔交易和 1.3亿美元\n的交易量。通过项目方最近宣布的Amarok 升级（并与 Nomad 合作），很快将成为第一个也是唯一一个在不引入可信交易对手的情况下实现\n链间通用通信的网络。项目方相信这一突破将推动围绕信任最小化跨链应用程序 ( xapp ) 开发的新一轮创新。\n\n通俗来讲，对于我们普通区块链参与者来说，Connext不仅提供了不同公链之间代币的跨链交易，同时也提供了以太坊二层链之间代币的\n跨链转账交易（解决了二层链转回一层链时间超过一周的弊端）。况且，总体交互GAS费很低且跨链转账速度较快，一般交互后几分钟内其他\n链地址就能接收到对应代币。\n\n```\n项目代币：\n\nConnext项目方将在ERC20链上推出其项目治理代币（令牌）：NEXT。\nNEXT 是一种 ERC20 实用程序和治理令牌，可为网络的公平利用提供动力。NEXT 令牌的目的不是提供安全性，而是在Amarok升级后维护路由器的操作公平性。\n路由器，即 Connext 的节点，质押NEXT 参与网络，并从网络中获得一定比例的工作份额作为回报。NEXT 通过确保所有路由器遵守关于公平交易排序的相同规则集\n```\n\n来保持网络运行，如果违反这些规则，路由器的 NEXT 将被削减。\n除了作为实用程序的作用外，NEXT 还将用于通过 DAO 管理 Connext 网络的生态系统金库。我们相信社区是资源分配的最佳长期仲裁者，主要贡献者将推动网络向\n前发展。\n\n```\n此外，令牌已部署，但尚未公开。\n```\n\n令牌的高级详细信息：\n代码: NEXT\n标准：ERC20\n总供应量：1B 代币\n以太坊上的代币地址：0xd63014F367aFe2eb006FD3dD6C02110A9dCE42dC\n当前状态：未分发\n随着代币的全面发布，项目方将发布更多关于代币分发和技术治理的信息。\n\n目前，项目方空投代币的交互以及LP流动性质押部分任务已经于3月份快照完毕，如果想得到空投，必须要参与申请项目方的贡献者计划，成功一名贡献者。\n目前贡献者生态里面有五种角色：社区领导者、网络建设者、内容与教育者、路由器管理者、捐赠者。\n参与贡献者任务之后，定期针对赛道进行上传。后期发放代币时，项目方会根据参与任务获得积分占比权重对贡献者进行代币空投奖励。\n\n有意向参与者，可加入官方Discord:discord.gg/connext", "timestamp": 1655695503, "digest": "Jhp4g9wEOBENSfDgnrdAKe1yXF7gxSMZpGNvHhoVMZg", "contributor": "0x5D359400cef3870504448c2ABEFfFe1cef18D171"}
{"id": "NIHWCtBpyn3itwcsALi2tp_QPDg85Y4A0w_cuIKg2iI", "title": "What Problem Does Web3 Solve, Anyway?", "body": "![](https://images.mirror-media.xyz/publication-images/Zl272m8PrjRBlG02jbAeR.png?height=925&width=1055)\n\nI want to start this post off by stating that I have very little interest in freakishly expensive cartoon animal JPEGs, private Discord servers, or hexagon profile photos. When people think of web3, or look at what the “people in web3” are doing, outside of direct scams this is generally what they see. It looks as though the highest achievement of this third web is that the rich and famous have been given a new way to show everyone how disconnected they are from reality. And they are. I don’t have a lot of explanations for it, and while I too got caught up and enamored with expensive cartoons during the peak of the mania, I have no desire to rationalize any of it away. Instead, for this post, I want to look beyond it.\n\nMy view of web3 is that it offers an important unlock for software developers. It allows them to build and consume general-purpose, open, permanent protocols and APIs that are paid for by their consumers in real-time. These protocols and APIs provide a universal database that can be used by anyone. It allows for permanent, unique objects that can be taken anywhere across the internet without losing sight of their owners, creators, and history. If ape JPEGs are a terrible cartoon use case for this new unlock, what other real-world use cases might be more exciting?\n\nMost real-world web3 protocols and apps right now (that aren’t scams) are financial, like [Uniswap](https://uniswap.org/) for trading assets, [Yearn](https://yearn.finance/) for getting yield on assets, and [Compound](https://compound.finance/) for borrowing and lending. At first glance, we might simply see new ways for degenerates to gamble. And we’d be right. If we change lenses, however, and simply look at what has been built we’ll see open protocols that anyone can build a frontend for without the need to ask for API keys. They can be incorporated into anything and remixed by anyone. And, if the promise of holds, they can't be shut down or their data corrupted.\n\nTo build other non-financial services at scale, we’re going to need to batch transactions saving users on insanely high transaction costs. [This is happening](https://ethereum.org/en/layer-2/), however, for the rest of this post, I want to ignore that. This post won’t talk about scaling solutions or different chains or throw obscure silly technical terms at you. Instead, I just want to answer the questions: “What problem does web3 solve, anyway? What will it look like?”\n\n[Web3, Explained](https://twitter.com/Grady_Booch/status/1535377548388945920)\n\n> *TL;DR: Web3 offers a general-purpose way to represent ownership of data, assets, and certificates that maintain their authenticity, history, and ownership state across the web.*\n\n## The Limits of Web2\n\nAsset titles, licenses, and certificates can't live on the internet easily in a truly meaningful and native way. If you do put them online, there’s very little one can do to ensure they are authentic or valid, especially if you want them to remain authentic across platforms without building special-purpose APIs and integrations. Allowing their ownership and control to be easily transferred between different people and applications is also not trivial.\n\nIf you graduated from Harvard and you want this achievement displayed on some online profile in a way that can be easily verified, Harvard would need to build and host an API that exposes their alumni list mapped to user accounts in their database, as well as a way for apps to authenticate their users to ensure that they are who they say they are. And Harvard would need to pay a full-time team to maintain these services. And all the apps that want to get this data would need to create a developer account with the Harvard Web Services and get an API key to ensure they don't spam the service. Assuming that anyone would want this for any reason, it’s entirely infeasible and almost certainly not worth the effort.\n\nInstead, we can simplify the entire thing by schools issuing an NFT to students. So long as an app/user knows the Harvard crypto address or domain name, they can verify that someone does have a real degree from Harvard, and it will work as well as someone’s ability to currently verify that someone has a “real ape NFT”. The amount of effort this would take is trivial.\n\nExpand this Harvard example, which is incredibly general, to certificates and licenses in general. Companies online want to build applications connecting licensed people who hold a certificate for X with their clients, while removing manual verifications and minimizing fake accounts. NFTs allow us to do this.\n\nAs far as I can tell, bringing real-world assets and certificates online in a truly native way is incredibly powerful. Currently, if you are issued a certificate that says you are licensed to do {X}, the certificate can only be brought online within the confines of the issuer. You have to log onto their website/app to see any version that other people will trust. If other applications or people want to verify it outside of their site, the issuer has to build an API and service allowing you to authenticate yourself and verify it. the issuer has to host, serve, and control the certificate, and there’s no way for you to take control of it and bring it with you anywhere you want online, without each platform building special-purpose integrations for you. Instead, if a certificate issuer gives you an NFT representing your certificate, you can bring it with you anywhere so long as you can connect your wallet. Your real-estate, hairdressing, law, financial advisor, etc. licenses can all be posted to the top of your Instagram page automatically, allowing anyone to trivially check who issued it and verify its authenticity. All that is required is that you connect your wallet.\n\nBased on many conversions I’ve had, people seem to be easily confused by this concept. “What makes one NFT authentic and others not?”, they ask. “Anyone can create an NFT of anything. I can create an NFT that looks exactly like all of the other real-estate licenses and post it to my Instagram. Who’s to say mine is fake? How would anyone know?” The answer is identity and provenance.\n\nFor something to be considered authentic, we need to know where it came from. In the art world, this concept is known as provenance, and NFTs give us perfect provenance. When I look at the real-estate license NFT on your Instagram account, I’ll be able to click into it and see its token ID, the contract/collection it belongs to, and who issued it. And if it wasn’t issued by NMLS, then I can be near certain that it’s a fake. If I’m feeling extra suspicious, I can open a second application like Etherscan and confirm. I’ll be able to see that you issued it to yourself. The same applies to Nike shoes, art, home titles, etc. If Instagram were so inclined, it could choose to control a list of verified wallets, so that NFTs issued by NMLS and Nike would automatically show a check mark, while others wouldn’t.\n\n## Extending Web2\n\nYelp owns all of the restaurant reviews instead of restaurants and reviewers. If someone wants to compete with Yelp they have to start from scratch. If a restaurant decides they don’t like yelp anymore, they can’t easily take their reviews to a new app or platform without the reviews losing their credibility.\n\nIn contrast, when I build an app or website today I sit on the shoulders of giants. I have a seemingly infinite number of code packages, libraries, snippets, and APIs available to me, and I can use all of these tools to help me build things faster. I don't have to reinvent the wheel every time I start a new project. However, if I want to build a competitor to Yelp, again, there is one major area where I have to start from scratch: the data and user base. Even if I scraped Yelp and ported all of their reviews, there’s no reason anyone should assume that the reviews are authentic, because they’ve been disconnected from their creators' accounts.\n\nA web3 version of Yelp, if it lives up to its promise, takes the data and infrastructure and makes it available to anyone while not being under the control of any single entity. Any developer can build a new UI for it. Instead of restaurants and users being tied down to one company, they are free to pick and choose whichever apps they please that connect to open protocols. We would no longer have a single company called Yelp. We would instead have an open and permanent protocol and database, and a potentially infinite number of Yelp competitors connected to it, all sharing the same data. Instead of competing with each other on who can hoard the most data, they would compete on their user experiences and services.\n\nYelp is a pretty inconsequential example. We can apply the same logic to public transportation networks like Uber and Lyft, or services like Airbnb, Rotten Tomatoes, IMDB, GoodReads, or your Twitter social graph.\n\nAs an Airbnb host, you can’t move platforms easily without losing the credibility of your reviews. you might have spent years building your review score, but now are stuck with a company that continues to increase their take rate, when you want desperately to move to a new platform. If both your listing and it’s reviews were on a neutral protocol similar in kind to something like [@LensProtocol](https://twitter.com/LensProtocol), you could seamlessly move to any competitor also building on the same protocol. In fact, you could exist on all platforms built on the same protocol simultaneously.\n\nOn Twitter, @liron [argues](https://twitter.com/liron/status/1531825233132277760) that the non-existence of a web3 Airbnb is evidence that not only is the project infeasible now but that almost nothing of value can be built here. And he’s right that none of these examples exist yet, but it doesn’t seem to me that we should assume they are impossible in principle. One example we can look at to confirm this is [ENS](http://ens.domains): all of the rules, domains and associated data live on the Ethereum blockchain. Any app can plug directly into the protocol and build their own services around it. People are doing this by building ENS specific [tools](https://ens.tools/domains) and no-fee [marketplaces](https://twitter.com/kodexapp). The Rainbow mobile app is doing this by allowing their users to [register ENS domains](https://twitter.com/alexisohanian/status/1536804795075502080) directly in their app. Any app ([and there are many](https://ens.domains/#home-ecosystem)) can pull the ENS data automatically and verify that a wallet owns a specific domain without needing to ask for permission. Granting the assumption that Ethereum is capable of scaling, there’s no difference between the domain names on ENS and the restaurant reviews on a hypothetical web3 version of Yelp, or the listings on a web3 version of Airbnb.\n\n## But what will all of this look like? What should we expect to see?\n\n**Scams. Lots and lots of scams.**\n\nThere’s more to say, of course, but I wanted to get the most obvious prediction out of the way at the outset: we should predict a lot of scams. Beyond that, I’m unfortunately incapable of predicting the future. But I enjoy envisioning it as much as the next science fiction fan. Thankfully, I don’t think it’s going to be too difficult to predict what web3 will look like over the coming years, because, well, a lot of it is already here.\n\nIf you own any NFTs or tokens, you can connect your wallet to any number of different sites and apps and see and manipulate your tokens in different ways. Some applications are special purpose, only surfacing specific types of tokens, while others, like NFT marketplaces, are more general and let you see everything. Depending on where you are, you can perform different actions, or unlock unique features, all dependent on what you hold in your wallet.\n\nI believe this trend will only accelerate, evidenced by [Instagrams recent NFT features](https://techcrunch.com/2022/05/09/instagram-testing-nfts-select-creators/). Applications and companies of all types will issue NFTs and tokens for a multitude of purposes. Some may be valuable generally, but most will probably be highly specific and valuable only to you. This idea that NFTs are inherently investment vehicles couldn’t be more wrong. Over time, we’ll start to think of our wallets the same way Ash Ketchum thought of his Pokédex. You’ll move through the internet, from service to service, collecting unique items you can carry with you that perform different functions. And to state the obvious: everything here is highly speculative. Don’t be surprised if these are wrong. With that said, here’s a non-comprehensive list of things we should reasonably expect to see over the next 5 to 10 years.\n\n* When you use an app to work out, if you connect your wallet, [you’ll get badges and awards as NFTs](https://metaverse.joinladder.com/). When you connect your wallet to your Instagram, these awards can automatically display on your profile, or get posted to your story. When you decide to test out another fitness app, you’ll connect your wallet, and be suggested the appropriate workouts based on your fitness level.\n* You’ll go to a concert and get a unique, [limited addition attendance NFT](https://poap.xyz/) from the band, which you can immediately post to your favorite social media app. Later, when the same band releases their next album, they might decide to give everyone holding their live attendance NFTs early access. You’ll go to their site and connect your wallet and prove to them that you went to their concert. The benefit for the artist to do this via an NFT instead of some other more traditional method is they can release the tickets themselves without relying on a third party ticket system like Ticketmaster, and ensure that tickets in the future are authentic without managing and controlling the data themselves, or relying on another company doing it for them. \n* Using platforms like [Royal](https://royal.io/), musicians will tokenize their music allowing them to sell equity in their future earnings. They’ll sell a set number of tokens to investors and fans which capture a percentage of earnings from their music. By supporting your favorite artists, you’ll be able to take part in the upside of their success.\n* When you complete an online course and get a certificate, it’ll be issued as an NFT. You’ll connect your wallet to LinkedIn, and add the certificate to display on your profile. Now any time someone sees your profile they’ll see your certificate, and can easily click in to see who issued it and verify its authenticity.\n* When you buy a car or luxury watch, it will come with a proof of purchase and authenticity NFT. If you feel inclined to post a photo to Instagram (as so many do), you’ll post it along with the NFT, to give your content legitimacy. And when you decide to sell, you’ll post it online along with the NFT, to prove to people that they can trust that you do own the car, even if you’ve never sold anything before.\n* Currently, buying digital movies acts as a form of platform lock-in. We can imagine a different world where giant tech companies compete on the services they offer; when you buy a movie from Apple you could be given an NFT granting you the right to watch the movie on any streaming service. Apple would take a cut of the sale of course, but other platforms could compete with them, allowing you to move to different services taking your movies with you. And when the movie studio releases a new title, they can give discounts to everyone who owns one of their other movies. (I don’t believe the platforms are directly incentivized to do this one on their own, so I assume some external pressure would need to exist for this to be realized.)\n* When you play a video game, the items you pick up as you play the game will be issued as NFTs, and proof of their ownership will be capable of being brought with you outside of the game. Third-party apps will let you connect your wallet and verify the authenticity of your items, and allow you to do things with them on their external service, like trading and selling, all while ensuring that the original game creator takes a royalty on the sales. Games will be able to check your wallet and change your experience depending on what you’ve acquired in other games. Games built by third-party indie devs could be built around the objects of other games, in a literal way extending the game's universe.\n* Your favorite charity will issue NFTs in exchange for your donations. Like the award NFTs given by the workout applications, you’ll be able to show off your charity donations on your social media profiles, simultaneously promoting your charity organization while signaling to your audience and friends. Charities will partner with other organizations and companies, offering special perks to their most philanthropic members. I heard this specific example as something that Sam Harris has wanted to do with one of his charities, however, I’m unaware of the status of the project.\n* Your favorite artist or content creator will release limited edition NFTs for their biggest fans. Ownership of one of these NFTs will give you special access to private groups where you get early access to content, and special access with the creator and other super fans. This will feel a lot like being part of a Patreon, with the important difference being that the content creator and their fans are untethered from any one specific platform. Currently, people who use Patreon are bound to it; they are under the total control of the platform. If they decide they no longer like Patreon, leaving isn’t an option, assuming they want to keep the majority of the fan base. NFT-based private groups change this. Anyone can build a platform that validates the NFTs owned by fans and allows them to come together as a private group. Each platform will compete on their UX and additional services they offer, instead of locking in creators and fans like we see today. If the content creator decides to move, everyone will be capable of transitioning seamlessly.\n* The NFTs that content creators sell online can be issued from special smart contracts that guarantee a % of future revenue made by the creator. This idea comes from a [TED Talk](https://www.youtube.com/watch?v=rWTwcySGvrE) given by the head of Instagram, Adam Mosserri. At a basic level, the tokens sold by the content creators can act as equity in the creators' future earnings. As an example, a creator could sell 1,000 tokens, raising $100,000, in exchange for 10% of future earnings for the next 5 years. Platforms like Instagram, Youtube, etc. can read the smart contract and automatically distribute the revenue to the holders. Every time a check rolls in from Youtube, 90% goes to the content creator and 10% goes to the holders of their equity tokens. Every time the content creator signs up to a new platform, they’ll connect their wallet, allowing the new platform to automatically pick up the contract and execute it for any revenue that is made there.\n\nI could keep going. The examples I chose to present here are incredibly limited. But I hope you get the idea: what we can ultimately expect from web3, as I’ve presented, is the ability to generate or receive digital assets and objects which are capable of moving across the web seamlessly while maintaining their authenticity and history, without the need for issuers to stay in the loop or provide services to external parties who require authenticity. If I were to ever invoke the word “metaverse” it would be in regards to this very specific newly unlocked feature of the internet. It’s not about Facebook, specific mediums like AR or VR, or massive video game platforms like Roblox and Fortnite. The “metaverse” as I like to envision it, is a globally shared and permanent digital reality not owned by any single entity that any company, platform, or person can plug into, regardless of where they are or what device they’re using.\n\n## So, what problems does web3 solve?\n\n**Problem:** The data for {X} is under the total control of company {X}. If a user wants to migrate to a new service, they can’t bring their history with them in a way that retains its legitimacy. Company {X} doesn’t want to let them, and even if they did, it wouldn’t be easy to do this at scale in a way so {X} doesn’t maintain total control. See: Twitter API being public with companies built on it, only to be shut down by Twitter.\n\n**Solution:** Build an open immutable protocol and database that is not controlled by a single entity, like [Lens](https://lens.xyz/) and [ENS](http://ens.domains). The database and protocol will become the equivalent of a global utility, accessible and open to anyone for any purpose. Optional: release a governance token as a way to monetize and democratize control of the protocol.\n\n**Problem:** Real-world assets and certificates can’t be put online in a native way that allows them to be instantly validated, transferred, or used in any meaningful way. If I want to get a loan against my home or assets or prove to someone that I’m certified to do {X}, it won’t be as simple as clicking a button on a web form. The friction is too damn high.\n\n**Solution:** The entities that issue assets and certificates can issue NFTs that represent them. By looking at the issuer/history of an NFT and verifying their address or domain name, we can be confident that someone does own a specific asset regardless of what website we are using.\n\n**Problem:** Universal log-in, where you bring specific info with you to new apps and services, requires you to rely on a small number of giant tech companies - and the data you can bring with you is very limited and generally outside your control.\n\n**Solution:** [Private keys](https://twitter.com/BrantlyMillegan/status/1389270115884097536)**,** [ENS](https://twitter.com/BrantlyMillegan/status/1402388133086367751), and [Sign In With Ethereum](https://login.xyz/).\n\n\n---\n\nI think it might be reasonable to believe that single monolithic companies shouldn’t have monopolies on certain data that practically guarantees user lock-in. And that the internet might be better if some data were made completely open and available to any developer who wants to build on it while ensuring that the data can’t be edited by anyone that isn’t supposed to be able to edit it.\n\nI think it might make the world more efficient if we were able to instantly verify the authenticity of assets, licenses, and certificates, without the need for every issuer to run massive APIs and authentication services. All one needs to do to ensure the authenticity of an asset is verify the identity and history of the issuer of its NFT.\n\nAnd I think it might make the internet better if we became less reliant on a handful of giant tech companies. Or, at the very least, it might be better if we were given the ability to walk away from them without the need to start again from zero.\n\n## What About the Critics?\n\nI don’t think there’s anything more divisive on the internet right now than web3, besides politics of course. There seems to be an unending number of [intelligent](https://twitter.com/Grady_Booch) [people](https://twitter.com/molly0xFFF) [who](https://twitter.com/liron) [believe](https://twitter.com/concodanomics) [that web3 is](https://twitter.com/BennettTomlin), [without doubt](https://twitter.com/davidgerard), [a giant scam](https://web3isgoinggreat.com/); that there isn’t a single redeeming quality about it. The bear market hasn’t exactly helped things. One of their main concerns is that web3 has almost certainly produced far more harm than not. You don’t have to [look far](https://web3isgoinggreat.com/) to see hoards of people losing their life savings to a web3 Ponzi scheme. And on this specific point, I have to agree. Smart contracts are general purpose. And Ethereum is open and credibly neutral. Anyone can use it however they see fit. And unfortunately, the vast majority of builders are those who want to steal your money. However, it should be obvious that just because a technology has negative externalities doesn’t mean that we should discard the thing altogether. Their argument, if sound, would have to be that web3 only enables scams, and nothing else. As I’ve argued in this piece, I believe that because something like Ethereum is general purpose and credibly neutral, it enables anything to be built on top of it, both good and bad.\n\nThere are a lot of other issues people have with web3. There’s no way I’m going to be able to run through them all, for one because I agree with a lot of them, and also because there are just too many. However, I do want to tackle some of the most common that I see. A large majority of objections you’ll see are specifically for Bitcoin, like PoW mining, which I’m going to ignore, because, for the most part, I agree.\n\n**OBJECTION:** Just use a database. There’s nothing you need to use an NFT or blockchain for that you can’t do with a normal database.\n\n**RESPONSE:** Ethereum is a globally distributed computer that requires a scarce resource to run which it both creates and destroys as it is used. As a consequence of desiring to use the machine for any reason, we naturally find ourselves valuing the resource, which incentivizes others to run it and keep it alive. It’s this incredible property that gives us assurance that it’s going to be around for a long time. It’s a permanent database anyone can use, while no single entity is solely responsible for keeping it running. Anyone can plug into the database, check its’ state, and be confident that it’s accurate. This is fundamentally different than a traditional database and opens up a whole new world of opportunities. If I don’t want my digital objects to exist and persist outside of my involvement, or be capable of moving across the web without continuing to build special purpose integrations, then a normal database is perfect. However, there are cases where the ability to set and forget something, or ensure authenticity is continually preserved is desirable. I want to be able to add something to the chain, leave it there for 50 years, and come back knowing it hasn’t changed. Proof of ownership is an obvious candidate for this functionality.\n\n**OBJECTION:** To parrot [Liron](https://twitter.com/liron): no one will want any of this. You aren’t solving real problems.\n\n**RESPONSE:** In principle, we can use Ethereum to build anything. Granting the assumption that something like Ethereum is capable of sufficiently scaling in the coming years while remaining both trustworthy and general-purpose, we should believe that solving real problems is possible if they exist, and as I’ve argued, I believe they do.\n\n**OBJECTION:** Crypto is just a Ponzi scheme filled with more Ponzi schemes. There’s nothing real there worth paying attention to.\n\n**RESPONSE:** I agree that crypto is filled with Ponzi schemes and other horrible scams and nonsense. And while people may use crypto to solely build Ponzi schemes and nothing else, it seems reasonable to believe that non-Ponzi products are also possible. This is reasonable because just as we can easily point to [Scams](https://web3isgoinggreat.com/), we can also easily point to non-scams, like the no-loss lottery protocol [Pool Together](https://pooltogether.com/), social protocols like [lens](https://lens.xyz/), the domain name service [ENS](http://ens.domains), and the borrowing and lending platforms [Compound](https://compound.finance/) and [Aave](https://aave.com/). Also, I think there’s an important distinction to be made between Layer one networks like Ethereum and the protocols and apps built on top of them. The Ethereum network is a global computer anyone can use to build protocols on. If everyone used Ethereum to build scams, it still wouldn’t mean that Ethereum itself is a Ponzi or scam, because the door would still be open for someone to build something useful on top of it.\n\n**OBJECTION:** [The Moxie Objection](https://moxie.org/2022/01/07/web3-first-impressions.html). One of the best criticisms I’ve seen has come from the CEO of Signal, Moxie, who makes a clear case for why we might not want to be so optimistic about this. The main claim that I want to focus on here is that web3 isn’t a great improvement from what we’ve seen before, because just like web2 is centralized around a handful of giant companies, like Google, Apple, Amazon, and Facebook, web3 isn’t doing any better. While it might look like you can use any wallet you want, and any app can plug directly into protocols on-chain, he says, behind the scenes, there are only one or two companies that everyone is plugging into. Everyone is using Infura and Alchemy to get data from the chain and using Opensea to pull NFT metadata. His takeaway and core criticism is that web3 is building centralizing forces even faster than we saw with web2.\n\n**RESPONSE:** Each centralizing force and entity he points to such as Infura, Alchemy, and Opensea, are not gatekeepers to the data on-chain. The state of the network is open for anyone to access, explore, and use as they please by simply running a node. What Moxie didn’t explain well is that Infura and alchemy simply run Ethereum nodes, which anyone can do, and then provides easy to use interfaces into them for developers. Infura, Alchemy, and Opensea can all be replaced easily and with little barrier to entry. Clients could decide tomorrow that they are no longer aligned with them, and pick new data providers without issue. If you try building with Infura or Alchemy, you’ll see that the interfaces are in fact quite primitive, and while we can expect them to improve, over the coming years we should expect new providers to come onto the scene who offer better services and interfaces into the Ethereum network. We can already see this happening with companies like [Moralis](https://moralis.io). This is not the case with any of the giant web2 companies. Their databases are closed off, and only accessible if you ask them for permission. If you get cut off, there’s no way for you to access the data. They are impossible to compete against let alone replace, because they act as gatekeepers to the data they collect, further locking users into their ecosystem.\n\nIn the end, there are a lot of problems still open to be solved. But I have yet to see one that I believe is even likely to be insurmountable.\n\n## Conclusion\n\nTwitter was supposed to be a protocol allowing anyone to build products and services on top of it that drive value back to the parent company and investors. But it wasn’t a real protocol. It only pretended to be. As soon as the people behind the scenes changed their minds about what they wanted Twitter to be, the “protocol” side of Twitter got shut down. While this ruined a lot of businesses built on top of it at the time, it was perfectly predictable. Before web3, it was near impossible to build real application-specific protocols on the internet. And counter to the beliefs of the biggest web3 critics, web3 does allow you to build real, open, and neutral protocols. And we know this, because we have real-world examples like [Uniswap](https://uniswap.org/), [Maker](https://makerdao.com/en/), [Aave](https://aave.com/), [Yearn](https://yearn.finance/), [ENS](http://ens.domains), [Pool Together](https://pooltogether.com/), [Lens](https://lens.xyz/), and many others.\n\n\n---\n\nMine is a single answer in a sea of others. There doesn’t seem to be much consensus on what web3 is, let alone what problems it will solve. It doesn’t help that people seem to have gone insane and come under a trance trading hyper-inflated cartoon images. My view is that web3 solves different problems for different people. Smart contract platforms like Ethereum are general-purpose, meaning the protocols and services that can be built on them are near-infinite, and what people will do with them is unpredictable, like trade cartoon JPEGs.\n\nPeople look at web3 and see the hyper-financialization of everything. And this is true; all on-chain assets can instantly be given their own stock market. They see cartoon apes trading for amounts that can only be explained by a world that has collectively lost its mind. And I don’t have good explanations for why that is, or what’s causing masses of people to lose touch with reality. However, if we put aside this [Problem With NFT](https://www.youtube.com/watch?v=YQ_xWvX1n9g)s, squint hard and look toward what we have unlocked beyond the insanity and hype, I believe we might see something real and historically important. The large-scale benefits are probably a little further down the road than I’m capable of predicting, but we might see a world that is made more [efficient by the replacement of trust in crumbling institutions and giant tech companies with cryptographic truth](https://www.youtube.com/watch?v=HiuvsLNCg-Y).\n\n*fin*\n\n\n---\n\n*Disclaimer: as you might have guessed, I’m kind of an Ethereum maximalist. I’ll probably write about why in another post.*", "timestamp": 1655695507, "digest": "-xpmr7ceHmi5Hqsl7zRtig9ph_dtCvWjZOoWOVN0bcg", "contributor": "0xE4f646F0Be4fF5ce185540F5366295f91d75b65D"}
