{"id": "1l2pt7BROiEVTf9GyRvsQyLQHBLy9nDvgIBWT5EfviU", "title": "Across V2 我的体验", "body": "## 综丝比较，制作了试运行L2的例子也。下面是我体验的步骤，也可以作为例子。\n\n \n 本文将介绍简单的生态系统， \n  \n  \n  \n L2至\n\n \n \n\n![](https://images.mirror-media.xyz/publication-images/0vwiyMLt-rUDReMV5VFIM.png?height=435&width=893)\n\n \n 我大概通过Acrosscross有2个，相和的Hop，还有一些有过的一次交叉·Connext这家的 \n  \n 体验体验也还不错 \n  \n  \n  \n 。 \n  \n  \n \n\n![](https://images.mirror-media.xyz/publication-images/o6veFMXsvUTgJ1uys3FnH.png?height=721&width=1344)\n\n \n 链接你的钱包。\n\n![](https://images.mirror-media.xyz/publication-images/NBxm3AvAtj_EvjipxPQC3.png?height=912&width=1295)\n\n \n  \n  \n 直接·MAX\n\n![](https://images.mirror-media.xyz/publication-images/FyTiILR_Yc7jKr-YKFfkw.png?height=691&width=1346)\n\n \n  \n  \n 我是中号里面的，给了这里的导航。用最近的 \n  \n 移动性，我没有转移到V2，v2.across.to/pool，比较性。 \n 还是链接链接。 \n \n\n![](https://images.mirror-media.xyz/publication-images/uJHyjBPaNPm9Uprgx09He.png?height=714&width=1343)\n\n'添加资产，我选择的是ETH。之后等待交易，交易时间不到五分钟，就ok了。 \n \n\n![](https://images.mirror-media.xyz/publication-images/AzeoKCeoJJwbzBc6LPBJ1.png?height=1316&width=1179)\n\n \n  \n  \n V 为流动性提供给我boba2次体验到的体验。当 \n  \n 从Op EcoArb2时再美好到今晚ama的boba [@@boba](https://twitter.com/bobanetwork)\n\n最后到马蹄链[@0xPolygon](https://twitter.com/0xPolygon)\n\n再通过V2返回Op\n\n整个过程 5 分钟，汽油费了 0.00 ETH 的费用\n\n[@AcrossProtocol](https://twitter.com/AcrossProtocol)", "timestamp": 1654010798, "digest": "r1INDy-2n5KDdcUe41tvbV8uM_afMtkld-h1iF10rhU", "contributor": "0x7a71aA2B2adfA4Cccb84E2E7BC226dDbF90cccbb"}
{"id": "3HK-olVJryZXWUJ1E-s9FgswHAvQMvtVuWsmFyuz1c4", "title": "Solidity 课程 10: 继承", "body": "Solidity的继承（`inheritance`），包括简单继承，多重继承，以及修饰器（`modifier`）和构造函数（`constructor`）的继承。\n\n### 规则\n\n`is`：继承其他合约的符号；\n\n`virtual`: 父合约中的函数，如果希望子合约重写，需要加上`virtual`关键字；\n\n`override`：子合约重写了父合约中的函数，需要加上`override`关键；\n\n### 简单继承：\n\n```remix-solidity\ncontract A {\n    function foo() public pure virtual returns (string memory) {\n        return \"A\";\n    }\n}\n\ncontract AA is A {\n    function foo() public pure virtual override returns (string memory) {\n        return \"AA\";\n    }\n}\n```\n\n*  **A** 合约：创建 `foo` 函数，用`virtual` 标记函数可以被继承的子合约重写；\n*  **AA** 合约：重写 `A` 合约的 `foo` 函数，用`override` 标记函数是重写父合约的函数，不写`override`但创建同名方法，会直接报错； `virtual` 写不写都不影响当前合约；\n\n**测试结果：**\n\n```remix-solidity\ncontract Inheritance{\n    string public output;\n    function testParent() public{\n        A a = new A();\n        output = a.foo();\n    }\n\n    function testInheritance() public{\n        AA b = new AA();\n        output = b.foo();\n    }\n}\n```\n\n* 调用 `testParent`函数，`output`被赋值了 A ;\n\n\n* 调用 `testInheritance`函数，`output`被赋值了 AA ;\n\n### 多重继承\n\n`solidity`的合约可以继承多个合约。\n\n**规则**：\n\n1. 继承时要按辈分最高到最低的顺序排。比如我们写一个`AAA`合约，继承A合约和Baba合约，那么就要写成`contract Erzi is Yeye, Baba`，而不能写成`contract Erzi is Baba, Yeye`，不然就会报错。\n2. 如果某一个函数在多个继承的合约里都存在，比如例子中的`hip()`和`pop()`，在子合约里必须重写，不然会报错。\n3. 重写在多个父合约中重名函数时，override关键字后面要加上父合约名字，例如`override(Yeye, Baba)`。", "timestamp": 1654010954, "digest": "QDw3U66hrvHpQoxixgZ-U6bw_S9cfiREi_3-_O8ez8o", "contributor": "0x4568b760c55FAEA0129139b863124f19962B9cDE"}
{"id": "6ljAH8B5zwvYyjbhD9RIK0oxTchfc0yz7oM2Pepneck", "title": "Mission — Covenant with Kusama", "body": "We **shared a form** with you and as a result of this form, Kusama was the winner. As the Nascency team, we are happy to **engage with Kusama**. In this post, we will be sharing **the voting details** and the **contract address** of the Mission Nascency.\n\n\n---\n\n### The Results of Selection\n\n![I. Kusama | II. Solana | III. Ethereum & Avalanche | IV. Polkadot](https://images.mirror-media.xyz/publication-images/psn7ZKl5E32MqUvAsd7r6.jpg?height=1000&width=2000)\n\nWe **shared a public voting form** 3 days ago and asked you to choose a coin as a reflection reward. The voting results were **Kusama**, which was chosen as seen in the image above. Solana is in second place. Ethereum and Avalanche share third place. Frax Share, on the other hand, did not receive any votes.\n\n> Although we have not finalized it yet, the top 4 coins in this voting may be included in the staking pools that we will share in the future.\n\n\n---\n\n## Kusama reflected $BIRTH\n\n### Mission Nascency — Kusama\n\nAfter voting, the address **$BIRTH contract was created**. Adjustments made, tested, and token ready. We can't say for sure about the launch date and time yet, but we strongly encourage you to take your place ready now. \n\n> **The Nascency Contract Adress:** [0x00361fFcEe7fE1ebe740D9f7BEcBa9C602eB6320](https://bscscan.com/token/0x00361fFcEe7fE1ebe740D9f7BEcBa9C602eB6320)\n\n\n---\n\nReflection rewards are **set to Kusama**. 15% of each transaction (buy/sell) will be **automatically distributed** to the holders as a reflection reward (KSM).\n\nWe would like to make similar agreements with other projects in the **near future**. The strength of our **community reflects us, and we reflect the project**.\n\n> We keep moving forward, **Swan Pit is evolving**. We've traversed our **first community-added advance** and formed a bond with Kusama and its community. For this reason, we would like to **thank all the pit** **members**. See you soon with new news. \n\nNow or never.\n\n\n---\n\n**[Join our Telegram](https://t.me/missionnascency)**, **join the (⋯, ⋯)**.\n\n**[Our Twitter](https://twitter.com/missionnascency)**.\n\n**[Our Website](https://nascency.xyz/)**.", "timestamp": 1654010829, "digest": "7c6tYfAH6_GMpGdE52sMDl0grVBg0wQaP4MPU1Ws3Q4", "contributor": "0xDE1f0C370321DA5985b8d170F74E41f71d20c925"}
{"id": "R2yClXRnJ9TsKYFXR9SYZYZT8POEd3hCqT7yEPkWenU", "title": "X世界第一季——重启", "body": "作者内容：Colter，背景图片作者：Mr.7\n\n写作日期：2022年5月31日\n\n> X历2135年，6月8日周六中午12点，B星Z市。\n\n寒风夹杂着雪花在呼啸着，山峰被厚厚的冰层覆盖着，这座山峰叫紫山，海拔6700米，因为地形复杂、山壁崎岖陡峭、环境恶劣闻名，并且这座山峰属于禁区，每天会有全副武装人员在山脚下巡逻，禁止任何人员进入。\n\n山脚下的树林中，两名巡逻人员慢慢走过来，他们全身武装到没有任何皮肤裸露在外面，手指全都放在武器的激发按键上，随时可以进入射击状态。\n\n咻--- 一个极速且细不可闻的声音划过这个空间。\n\n只见这两名巡逻人员突然都不动了，然后身体快速分解成几块坠入地面。 离这里不到5米远的一处丛林的光线出现一点异样，一名身穿迷彩色全覆盖护甲的人型生物从空气中浮现，他快速走到事发地旁边的树干上，从上面取下了一个被苔藓覆盖的物体，按了一下，上面覆盖的苔藓就消失不见了，一个六角形的黑色扁装物体出现在手中，人型生物随手把它挂在腰部，然后弯下腰，掏出一个小型圆筒状物体对准地上的尸块按了下，只见尸块连同附近的装备以肉眼可见的速度消失不见。 \n\n当做完这些事后，那个人形生物便慢慢消失在空气中，仿佛这一切从未发生过。 \n\n张毅，编号15901，隶属A国特殊战斗组，今天接到一个任务，需要他去紫山刺杀E151目标，据情报表明，E151会在下午5点到6点之间通过秘密通道进入紫山内。\n\n “紫山位于Z国断峰山脉，已探明紫山为Z国的AZ177基地部署地，此基地长期研发及测试新型武器装备，属于Z国最高级别的基地，紫山地形图及AZ177基地详情图已经发给你了，准备好你的装备，5分钟后出发。”张毅的眼前出现这条信息，紧接脑中着便出现了关于紫山及AZ177的全部资料。 \n\n他快速走到基地的装备库，找到唯一一个胶囊状装备舱，拉开装备舱门躺入进去，舱门便自动关上，紧接着装备舱下的地板出现一个圆形口，胶囊状的装备舱直接下坠到圆形口内，然后圆形口自动关上，整个装备库便空空如也，仿佛这里面不存在任何东西。\n\n 一艘小型黑色飞船静静的停在机库里，尾部开着小舱门与一根管道连接着，这时飞船背部的亮了一下红光，尾部舱门便自动关上，管道与飞船尾部舱门断开连接。\n\n“飞鸟会带你到离紫山10公里处的地方进行空投，你需要陆地上进行潜入，离紫山2公里处，禁止使用一切飞行设备。”躺在装备舱中的张毅眼前继续浮现这列信息。\n\n“预计你的抵达时间为下午1点，你只有240分钟进入目标出现地，晚上8点之前需要返回预定的坐标地，会有飞鸟接你回家的。”\n\n躺在装备舱的张毅，缓缓闭上了双眼。\n\n小型飞船机身轻微晃动了一下，没有任何征兆的从地面起飞，缓缓飞向机库顶部敞开的天窗，飞出机库后，飞船闪现一道蓝色的光芒，瞬间飞向远处的天空。\n\nA国特殊战斗组的指挥厅内，一名身材高大，穿着黑色铠甲的人看着面前显示器中的飞船远去的画面，眼神中透漏着冰冷的气息。\n\n张毅轻轻摇了摇头，努力让自己从任务的回忆中拉回现实，毕竟他刚刚解决了两名巡逻人员，在紫山这样严密的基地，哪怕一丝走神都可能会让任务失败。\n\n他看了看了眼前投射出的X战甲系统运行数据，没有发现任何异常，按照战甲的能量存储，还足够他进行8小时的使用时长。张毅弯下身悄无声息的按照投射出的地形图，快速前进。\n\n从山脚到攀登点的这一路上，没有再遇到任何巡逻哨卡，看来是紫山这个天险让Z国的部分地面力量部署减少了，张毅心中暗道。\n\n很快张毅便抵达了预定攀登点，根据情报显示，进入紫山秘密基地唯一的可能性是在此处进行攀登，依靠原始攀登设备抵达山壁中的通风洞穴才能潜入基地。\n\n攀登点下，张毅解除了X战甲的隐形功能，换成了雪山迷彩的外观，因为隐形功能会快速消耗战甲的能量储备，特别是这种需要长时间的重复攀登，很可能会增加战甲的消耗速度，对于此类刺杀任务，能节省能量就尽量节省，留着保命。\n\n他抬头看了看巍峨的雪山，启动了战甲手脚处的引力系统，然后手脚并用，开始一点点向上攀爬。强大的引力系统牢牢的让张毅吸附在冰雪上，他看了眼信息，离山壁中间的通风洞穴还有2000米，张毅深吸一口气，咬了咬牙，顶着雪山的大风朝着预定地点坚定的行进。\n\n山壁中间的通风洞穴是一个天然形成的通道，紫山内部进行建设基地的时候，几乎挖空了整座山峰内部，为了确保内部的空气流通性，除了天然形成的洞穴还额外开凿了几处人工通风口，这些通风口内部都安装有多种监控设备，形成完整的监测系统。\n\n整个紫山基地耗费Z国十年时间及大量的人力资金建设，基地被全方位的安全巡逻系统保护，号称不会有任何物体可以在不惊动安全系统的情况下进入。\n\n“警告，还有10分钟，紫山巡逻机会经过您所在的山壁。”头盔面罩中的投射板泛起了红色光芒，张毅看了看信息，离这个通风洞穴还有1200米远，以当前的速度绝无可能在巡逻机抵达之前就到达洞穴中。\n\n张毅迅速打量了环境，空荡荡的雪山壁没有任何物体可供隐藏，他一咬牙，直接加快速度向上攀登。\n\n“警告，心率过快，血氧饱和度降低。”红色信息急促的提醒着张毅，他没有理睬，默默调高了机甲的氧气输出量，继续加快了速度。\n\n“警告，还有3分30秒，紫山巡逻机会经过您所在的山壁。”此时的张毅已经顾不上这个提醒，他没有别的选择，只能奋力继续攀登，否则必然会被发现。\n\n“倒计时60秒开始，请做好隐蔽准备。”\n\n“拼了！”张毅在面罩下的眼神突然变得无比坚定，他唤起战甲肩膀处的小型离子枪，对准右侧的不远处山壁上方一块凸起的冰块，然后调整为小功率持续模式，一道淡蓝色的离子束精准的射向冰块。\n\n瞬间冰块被洞穿，但并未出现预想中的冰块掉落，张毅额头开始出现一点汗水，他反手从腰间掏出一颗冲击波手雷，这颗手雷还是张毅在上一次任务中获得的战利品之一，冲击波手雷在如今已经是老古董了，除了收藏价值就没有实战价值了。\n\n张毅降下面罩，露出了年轻的面庞，没一会儿高空缺氧和寒冷就让他的脸色开始发青，他用牙咬掉拉环，用空出来的右手使劲把手雷丢向右侧上方的冰块，然后升起面罩。\n\n手雷完美的划过一道抛物线，精准的到达冰块附近。\n\n“轰”—— \n\n手雷爆炸，冲击波席卷而出，冰块瞬间被粉碎，巨大的响声响彻山壁，雪山上的大量冰层瞬间被激活，疯狂的向下砸下来，冲击波被战甲轻松抵挡，巨大滚落的雪块蜂拥而至，瞬间淹没了整个区域。\n\n巨大的动静瞬间引起紫山巡逻机的注意，天空中的巡逻机划过一道蓝光抵达此处，巡逻机中的驾驶员看着雪崩的场景，摇了摇头，把实时画面传输给了监控系统，然后驾机驶离此处。\n\n雪崩一直持续了几分钟才逐渐停下来，战甲下的张毅脸色已经由青转紫了，他大口的喘着粗气，身体不自主的颤抖着，脑海一片空白，听不到任何的声音，强烈的求生欲让他一直苦苦支撑，这时他的眼睛开始慢慢看不清四周，天地间只剩一片白色，嘴角溢出了一丝鲜血。\n\n恍惚间，张毅好像看到了他之前参加训练的场景，听到了战友们在旁边大声呼喊着他的名字，好像也看到E151目标向他微笑的样子。\n\n“这就是死亡吗？”张毅喃喃自语。“警告，身体指标异常，启动紧急系统。”张毅的耳边传来了战甲的声音。\n\n伴随着紧急系统的启动及无情的战甲声音让张毅开始能听到外界的风声，能看到面具投射的红色信息。\n\n张毅再一次被拉回了现实，他下意识的用一只手擦拭嘴角的鲜血，但只摸到了坚硬的战甲面罩。他向上望了望，面具显示离通风洞穴还有1000米，然后看了看脚下，苦笑了起来。\n\n就在此时，天空中出现一道诡异的黑色闪电划破整个天际，但却没有任何声音传来，紧接着连续几道黑色闪电不断出现，他恍惚间好像看到了黑色闪电周围出现了空间扭曲的情况。\n\n“警告，检测到未知能量体。”红色的警告急促的在提醒着张毅。\n\n这时候，出现黑色闪电的天空开始出现塌陷，黑色的空间逐渐暴露出来，这种黑色好像有勾人心魄的能力，让张毅觉得自己的身体与思想完全不能同步。\n\n朦胧间，一根无比巨大像手指一样的东西从黑色空间中伸出一点点，但是瞬间缩回去了，然后黑色空间开始在一点点缩小。\n\n“轰”——\n\n白色的闪电划破黑色的空间，直接刺透进黑色里面，瞬间产生了巨大的爆炸声，一股强大的冲击波以肉眼可见的空间波动席卷开来。\n\n张毅面色惨白，抬头望向山峰，眼睁睁的看着被冲击波席卷产生掉落的雪块向下砸来。\n\n“警告，警告，警告，系统能量值降低，战甲破损在扩大。”张毅的耳边只剩下无情的系统提示音，然后眼前一黑。\n\n“李博士，脉冲好像不对，你看看这个数据。”\n\n“咦？是有点不对，你把参数重新调下，减少能量输出。”\n\n“李博士，这个也不对，外界反馈信息会形成交互，好像有自我意识的潜在表现。”\n\n“重启系统！”\n\n“张毅，起床了！醒醒！”紧接着一双手在张毅身上推动起来，“吵死了，大早上喊什么！”张毅一股无名之火瞬间冒起，他眼睛一睁，一巴掌拍飞这双手”李小松，你是有病吗，今天是周末！”\n\n“张毅，你怕是睡糊涂了啊？今天是周一，咱们要去考试，这课要没有参加考试，怕是毕业证都拿不到了。”李小松看着躺着床上的张毅说到。\n\n“今天周一了啊，我怎么感觉今天是周末？”听闻李小松的话，张毅一骨碌起床，然后看了下房间里的时间“6月10日周一，上午7点34”。\n\n“还真是周一，赶紧赶紧，今天考试不参加死定了。”张毅抛下这句话就直奔厕所。\n\n在厕所中，张毅拿着毛巾抬头看向镜子，一副陌生的脸庞出现在镜子中，没有一丝丝熟悉感，一瞬间张毅好像被闪电击中了一样，呆在这里一动不动。\n\n“数据异常，重启系统！”", "timestamp": 1654010890, "digest": "4itUw2oLVezHADSKxwAy5i8X_kCNSiqbfVPyJmujDr8", "contributor": "0xA644876e8E4B7985128D3693255B76F935Ba6dBb"}
{"id": "9PjD8fBqG8noMUqXRJSlS1FelW33BvVliBll1Ce5zgg", "title": "《乘风破浪》第三季：宁静VS那英，两个女人的“战争”", "body": "ROUND 1 初次交锋 平分秋色\n\n宁静、那英在《乘风破浪》第三季的节目中初次相见，两人本着“没有最冲，只有更冲”的原则，你来我往，针锋相对。\n\n宁静说：别人是来争第一的，我是来超越第一的!\n\n那英也丝毫不让，傲娇的说：那我可比她（宁静）地位高，我是她前辈。\n\n两人一见面就电光火石、气场全开，谁也不怵谁。\n\n编辑\n\n那英说：别给我玩阴的就行，我不喜欢拐弯抹角。\n\n宁静回怼：你看我是会拐弯抹角的人吗？\n\n那英：不知道。\n\n宁静：我会！我可会“拐”了！\n\n天啊，这火药味，感觉马上就能打起来，第一局，宁静、那英两位大姐大可谓分庭抗礼、平分秋色。\n\n编辑\n\nROUND 2 抢队长 那英胜\n\n在初舞台表演之后，谭维维、吴莫愁、阿雅、刘恋、赵梦、于文文六位姐姐获得队长之位。\n\n那英、宁静的首要任务就是抢队长。\n\n凭借在歌坛的江湖地位，那英毫不费力的抢到了谭维维、吴莫愁这两员VOCAL大将，并将有创意、又全能的刘恋收入麾下。\n\n而相比之下，一直气场强大的宁静却显得畏手畏脚，败下阵来，大VOCAL一个没抢到，只收获善于沟通交际的阿雅、摇滚范儿的赵梦，以及那英宁静谁也不敢要、“不好摆弄”的于文文。\n\n从这场“抢队长”的战局来看，能够非常清晰的看出那英、宁静两人的个性。\n\n编辑\n\n那英素来以直来直去、口无遮拦著称，所以一上来，就非常明确的表态，她喜欢谭维维、喜欢吴莫愁，这看似是直爽、直接、不拐弯抹角，但实则体现出的是一种“霸道”，即“我管你宁静怎么想，管别人怎么想，反正我想要谁我就直接抢”；这一招非常奏效，毕竟谭维维、吴莫愁同为歌手，与那英的私人关系也很好，那英一招呼，指定火速投奔。\n\n编辑\n\n再看宁静，在以前的节目里都是说一不二，很强势的样子。可在那英面前，却吃了哑巴亏，她也想要谭维维、吴莫愁，无奈那英先发制人，她只能采取迂回战术。从这一点看，宁静还是个挺有气度的女人，虽然也叫嚣了一下，笑着直言：那英你不要太过分，占了谭维维，还想占吴莫愁。但最后还是选择了避其锋芒、坦然接受。毕竟要真是和那英杠起来，两人势必一番唇枪舌剑，然后搞得谁都不愉快，也让其他人尴尬为难。\n\n编辑\n\nROUND 3 抢队员 那英胜\n\n抢完队长，接着就是抢队员了。\n\n那英在这一局又是先下手为强，老早就表达了对齐溪的喜欢和欣赏，还亲自出马搞定徐梦桃、许茹芸等大将。\n\n宁静同盟的阿雅、于文文、赵梦虽然也非常给力，拿下张蔷、郑秀妍、郭采洁、张天爱等姐姐，但相比之下，宁静还是有点轻敌了，在这个环节，如果队长能够亲力亲为，像那英那样更为卖力的去抢人，也许会争取到更多姐姐的支持，拿到更多小红花。\n\n最终，那英同盟获得42朵小红花，宁静同盟只拿到24朵，在下一环节“选歌”环节将自己逼入绝境。\n\n编辑\n\nROUND 4 抢歌 旗鼓相当\n\n虽然小红花数量少，形势不妙。但是在“抢歌”环节，宁静同盟却展现了超高的智商和演技，打了一个漂亮的翻身仗，以24朵小红花孤注一掷，抢到了他们最喜欢的唱秀歌曲《自己》，同时也不费一兵一卒就拿到了自己相对喜欢的《情书》、《要你管》，从这一战能够看出来，宁静还真的挺有智慧，很会玩！\n\n她也用实际行动告诉那英：我可会“拐”了！\n\n编辑\n\nROUND 5 第一次公演 宁静胜（根据网络消息推测）\n\n下一战，将是第一次公演舞台，从此前爆出的淘汰名单看，一公淘汰的是那英同盟的吴莫愁和黄小蕾，说明宁静同盟确实爆冷战胜了那英同盟。\n\n这也印证了那句话：一分耕耘、一分收获，一切都是最好的安排。\n\n那英自以为本同盟的阵容豪华，自己又很专业，训练的时候起的晚、结束的早，直呼轻松，还到处闲逛、用手机打麻将，并和自己队员说笑称“宁静那组都崩溃了”，可现实却是对手大胜，这可是“啪啪打脸”。\n\n那英、宁静，两个大姐大的“战争”还在继续，让我们拭目以待，看她们乘风破浪！", "timestamp": 1654011402, "digest": "q5oLMHJ2Jn8JFi9KqKCGZtyXR7Esf0rmAF5DlT_2ebU", "contributor": "0xcEBA41Ae41BCB3E2A49bAa399A43086076969330"}
