{"id": "bvtpofkp-3hW2hLWa0kITC6hosu5t7RlOIVkQscVt8E", "title": "SHAGGED", "body": "this is what i did to ur mum\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/223](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/223)\n\n", "timestamp": 1654528339, "digest": "autR2SYaD78Os5-pg6HOyJ5S6QYREpUs7SeRWDjEm6s", "contributor": "0xde0FE8538Cc42fF4d846Cf8Ca4Bf0345517a274D"}
{"id": "DLcu7INobxazsS5SzNw-JhVvbAOwR4iPnGWzmzqXenQ", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年6月，基本上经历了一整轮市场从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528153, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "G5qGwN8cmjDMfaqAjBe3y2nqfDP3J6pmaT48C-pMpsI", "title": "Less is More", "body": "Less is More", "timestamp": 1654528275, "digest": "l4XtOGOTcDrm--9YJIvT41MSnJFUknuFu5mQogev4RM", "contributor": "0x0933e58414E5772113cCa71b3c13964d682435D6"}
{"id": "nZiudryz2oLpiBCrLL6IrK4cRBY_UIU5YY2Uo2TeXaw", "title": "Tìm hiểu về Zetachain - Giao thức tương tác Omnichain (Vietnamese version)", "body": "## Bối Cảnh\n\nBạn có nhớ cụ thể có bao nhiêu cách để kết nối các mạng lưới blockchain khác nhau hiệu quả?\n\nThực tế có rất nhiều cách khác nhau làm được điều này. Phương thức phổ biến nhất người dùng và các nhà phát triển DeFi thông qua các ứng dụng cầu nối và các giao thức chuỗi chéo để kết nối.\n\nNhưng thực tế là giải pháp này cũng không quá dễ dàng với đa số người dùng, đặc biệt là người dùng mới. Hãy cũng tìm hiểu cách vận hành này:\n\n![Cách vận hành giao dịch chuỗi chéo hiện nay](https://images.mirror-media.xyz/publication-images/1CzHuq8CwIRRG_znUYCBQ.PNG?height=885&width=691)\n\nThêm vào đó, các ứng dụng cầu nối và các giao thức chuỗi chéo còn thường xuyên gặp phải sự tấn công từ các hacker vì tiềm ẩn nhiều lỗ hổng bảo mật. Điều này đã gây ra nhiều thiệt hại rất lớn cho người dùng.\n\nChính vì vậy, Zetachain được ra đời với sứ mệnh khắc phục những vấn đề này thông qua phương pháp tiếp cận đa chuỗi, cho phép bất kỳ tài sản thuộc bất kỳ mạng lưới nào cũng có thể lưu thông dễ dàng, tự do.\n\n![Zetacahain - Giao thức tương tác dựa trên hợp đồng thông minh Omnichain](https://images.mirror-media.xyz/publication-images/XLfUDlDGIfxeVeg7bIDJJ.PNG?height=643&width=665)\n\n## Zetachain Là Gì?\n\nZetachain là một giao thức cơ sở hạ tầng chuỗi chéo được xây dựng trên Cosmos SDK. Zetachain giới thiệu một concept mới là Omnichain Dapps (odApps). Với kiến trúc của mình, Zetachain cho phép các nhà phát triển tạo ra các odApps dễ dàng giống như việc phát triển dApps cho một mạng đơn lẻ như Ethereum hoặc Polygon trong khi có thể tận dụng khả năng tổng hợp trên các mạng.\nKhả năng của Zetachain là vô tận nhưng với vị thế là một người dùng phổ thông, hãy hiểu về các lợi thế mà Zetachain mang lại:\n\n* Chuyển đổi tài sản, dữ liệu xuyên chuỗi đáng tin cậy theo mã thông báo gốc mà không cần phải bọc.\n* Cầu nối phi tập trung giữa các dữ liệu, mạng lưới.\n* Hợp đồng thông minh Omnichain giám sát và vận hành liên mạng lưới.\n* Omnichain Dapps (odApps) gia tăng hiệu quả sử dụng vốn, tính thanh khoản trong DeFi.\n* Mang đến các sản phẩm đầu tư mới trong DeFi với những ưu điểm khắc phục nhược điểm của các sản phẩm cũ (các giao thức cho vay, năng suất, AMM Dex chuỗi chéo, ứng dụng Omnichain NFT).\n\n![](https://images.mirror-media.xyz/publication-images/SIW8tO--4qPE-f7NtgeAB.png?height=700&width=1400)\n\n## Về Bảo Mật\n\nTrong xu hướng Multichain, các giao thức chuỗi chéo là thành phần quan trọng giúp tăng thanh khoản và sự tương tác giữa các blockchain.\nTuy nhiên đây lại là \"mắt xích\" yếu nhất khi bị hack liên tục.\n\n* Ronin Bridge: 620 triệu USD\n* Poly Network: 610 triệu USD\n* Wormhole: 325 triệu USD\n\n  (Nguồn: Coin98 Insights)\n\nNhận thấy vấn đề này, đội ngũ phát triển Zetachain tập trung tối ưu khả năng kết nối dữ liệu và tài sản trên các mạng lưới thông qua việc áp dụng tendermint cho cơ chế đồng thuận và xây dựng cơ sở hạ tầng phi tập trung. Tất cả các giao dịch và quyết định được thực hiện (thông qua thay đổi trạng thái) đều được ghi lại trong các khối ZetaChain có sẵn, không thay đổi, có thể xác minh và hoàn toàn minh bạch.\n\n![](https://images.mirror-media.xyz/publication-images/weOX1-oX--Xyk3Ptsj3T1.jpg?height=500&width=582)\n\n## Mã Thông Báo $ZETA\n\n$ZETA là mã thông thông báo đại diện cho giao thức Zetachain, được sử dụng để để thanh toán phí gas cho mạng lưới và duy trì tính bảo mật chuỗi khối thông qua các hình thức bonding/staking/slashing.\n\nTheo như đội ngũ Zetachain, họ sử dụng $ZETA đại diện cho giá trị cross-chain vì:\n\n* Giảm bớt đi hình thức đại diện cho cùng một loại tài sản vì không cần bao bọc tài sản đó nữa.\n* Giảm bớt sự tấn công, giúp việc kiểm toán dễ dàng và cải thiện bảo mật vì chỉ có những giá trị gốc được cross-chain thông qua $ZETA.\n* Sử dụng $ZETA làm phí cho các dịch vụ mà Zetachain cung cấp.\n\n## Nhận Xét\n\nTheo những gì được giới thiệu, đội ngũ Zetachain đã có kinh nghiệm trong lĩnh vực tiền điện tử từ năm 2013 và các thành viên đều đã từng làm việc cho các dự án lớn như Coinbase, Brave, 0x. Dù mới chỉ bắt đầu và còn nhiều thông tin chưa được công bố chính thức nhưng đội ngũ Zetachain cho thấy sự trau chuốt cho sản phẩm của mình khi các kênh thông tin về dự án luôn được cập nhật thường xuyên hướng đến việc giáo dục cộng đồng tốt hơn. Ngoài ra, đội ngũ cũng rất chú trọng đến việc phát triển cộng đồng của mình thông qua việc tổ chức các sự kiện (cuộc thi meme, cuộc thi viết, chương trình đại sứ). Nếu bạn muốn tìm hiểu thêm về Zetachain, hãy tham gia cộng đồng sôi động này:\n\n* [Discord](https://discord.gg/NKAUn7d5vX)\n* [Telegram](https://t.me/zetachainofficial)\n* [Twitter](https://twitter.com/zetablockchain)", "timestamp": 1654528179, "digest": "NCiV9HPuvZisu0G0SrbbcypffONqLAFkANpOCc2neGM", "contributor": "0x3d54DbEE5C5d0215246199e177F629e607CEb7d5"}
{"id": "QXcXspUA_JMBdCGI5r0QrmwBMPZDESBbc0zlwBpIKnU", "title": "SHAGGED", "body": "this is what i did to ur mum", "timestamp": 1654528216, "digest": "NiKShYDpUtTiIk8iVH8aBGM6Dg0oeiflCn8EkQmAh8Q", "contributor": "0xde0FE8538Cc42fF4d846Cf8Ca4Bf0345517a274D"}
{"id": "qxWzjQ3cxldTZ0kjUm79D-IpTAT0OdHYTurZOVFQAGM", "title": "ทำความรู้จัก Synthetix - Derivatives Liquidity Protocol", "body": "## Synthetix คือ อะไร\n\nSynthetix (ซิน-เธ-ทิค) เป็นระบบการเงินรูปแบบใหม่ ที่สร้างสินทรัพย์ (synthetic assets) ขึ้นมาใหม่ โดยอิงกับราคาสินทรัพย์จริง เช่น ETH เป็น sETH, USD เป็น sUSD, XAU เป็น sXAU(ทอง) เป็นต้น เพื่อที่นำเอา synthetic assets ไปต่อยอดสร้างสินค้าอนุพันธ์ต่างๆ (Derivatives) และให้ผู้ใช้ได้เข้าถึงสินทรัพย์เหล่านี้บน Blockchain ได้\n\nSynthetix เป็น Decentralize Finance อยู่บน Ethereum L1 และ L2 optimism, Synthetix เริ่มต้นบน Ethereum L1 ปี 2018 (2561) และในปี 2021 ก็ได้ทำการย้ายมาที่ Optimism. การซื้อ-ขายจะทำผ่าน contracts ซึ่งจะทำให้ปลอดภัยและเข้าถึงได้ง่าย. Synths(ตัวย่อของ Synthetix assets) ของ Synthetix นั้น สามารถอิง assets ครอบคลุมถึง คริปโต, หุ้น, น้ำมัน, ค่าเงิน และอื่นๆ ในอนาคต\n\nการสร้าง Synths นั้น จะเริ่มจากที่ Synthetix stakers จะเป็นผู้ค้ำประกัน sUSD ที่ถูก mint มาจาก dApp โดย stakers จะต้องนำเอา SNX (Synthetix Token) มาล็อคไว้และ mint sUSD ซึ่งคำนวนจากมูลค่าของ SNX ในอัตรา 300% มาค้ำประกัน ยกตัวอย่าง Stakers นำ SNX ที่มีมูลค่า $300 (SNX) ไป mint ที่ dApp ซึ่งจะได้มาเป็น $100 sUSD เป็นต้น หลังจากนั้นเมื่อผู้ใช้(ใครก็ตามไม่จำเป็นจะต้องเป็น stakers) มี sUSD ไม่ว่าจะได้มาจากการ mint หรือซื้อมาจาก dApp อื่น เช่น Curve, Uniswap หรือ AAVE ก็สามารถเปลี่ยน sUSD ไปเป็น synths อื่นๆ ตามที่ต้องการได้ (sETH, sBTC, หรือ sXAU) โดยนำ sUSD ไป swap ผ่าน Frontend ที่ทำการนำ Synthetix Protocol ไป integrate เช่น Kwenta\n\n> Synthetix เลยมี single pool ที่เรียกว่า debt pool เพื่อเป็นศูนย์กลางของ Synths ทั้งหมด ซึ่งจะถูกรับผิดชอบโดย stakers. Synthetix จึงเป็นเหมือน “**Liquidity pool”** บน DeFi ที่เป็นพื้นฐานสำคัญให้ Protocols อื่นๆ นำสภาพคล่องนี้(Liquidity) ไปต่อยอดสินค้าอย่าง Derivatives ได้อย่างหลากหลาย\n\n### ทำไมต้อง Synthetix\n\n* **Best price execution** **:** ผู้ใช้งานสามาถแลกเปลี่ยน synths ในราคาที่ดีที่สุดโดยแทบไม่มี slippage เลย ทำให้มั่นใจได้ว่าราคาที่แลกเปลี่ยนนั้นคงที่\n* **Lowest Downtime & Liquidation Risk :** ใน CEXs นั้น ในช่วงที่ตลาดมีความผันผวนมาก จะเป็นการยากที่จะทำการซื้อ-ขายในช่วงนั้น(downtime) การซื้อ-ขาย synths ทำผ่าน Optimism network ซึ่งก็มั่นใจได้ว่าผู้ใช้สามารถเทรดได้ และผู้ใช้จะไม่ถูก forced selloffs หากกำลังเผชิญกับ cascading liquidation ที่เกิด downtime แบบใน CEXs\n* **Simulated Liquidity** **:** ผู้ใช้สามารถเทรดโดยไม่ต้องกังวลกับคู่เหรียญ เช่น sETH > sXAU, หรือ sCHF > sSOL ได้ โดยยังคงคุณสมบัติ best price execution\n* **Secure Layer 2 : อยู่บน** Optimism ที่เป็น EVM equivalent และใช้ security ของ Ethereum Mainnet, มีการโค้ดโปรแกรมที่ง่ายทำให้เงินของผู้ใช้ปลอดภัย\n* **Any Asset Class :** สามารถเพิ่ม asset class อะไรก็ได้ โดยจะถูกบริหารผ่าน community\n* **Low Gas and Fees :** บน L2 นั้นใช้ gas น้อยกว่า L1 มาก ซึ่งก็จะมีโอกาสถูกลงไปเรื่อยๆ และทำธุรกรรมเสร็จโดนทันที\n* **Stake & Earn :** ผู้ใช้สามารถนำเอา SNX โทเค็นไปค้ำประกันโดยการ stake และจะได้รับรางวัลเป็น SNX โทเค็นจากการเพิ่มขึ้นของ SNX supply(Tokenomics) และ sUSD จาก fees ที่ได้รับจาก protocol ในทุกสัปดาห์\n* **Permissionless & Composable** **:** โปรเจ็กอื่นๆ สามารถนำเอาจุดเด่นของ DeFi blockchain โดยนำเอา perpetual futures contracts ไปใช้ในประโยชน์ต่างๆ ได้\n\n## SNX Ecosystem\n\nLiquidity pool นั้นเป็นหนึ่งในหัวใจสำคัญของ Synthetix มี Protocols นำประโยชน์จาก Synths นี้ไปต่อยอด เช่น Kwenta(Futures), Lyra(Options), Thales(Parimutuel Markets), Aelin, Curve, 1inch, Paraswap, dHedge, Yearn และยังมีอีกหลาย Protocols ต่อยอดไปจาก Lyra อีก เช่น Polynomials, Brahma, Fuerte เนื่องจาก Composable ของ Blockchain เปิดทางให้ Protocols นั้นเชื่อมต่อกันได้ง่าย มันจึงมีโอกาสอีกมากมายที่ทำให้ Synthetix เติบโตได้ในหลายรูปแบบ การที่หลายๆ Protocols นำเอา Liquidity ไปใช้นั้น จะทำให้ Synthetix ได้รับ fees จากธุรกรรมที่เกิดขึ้นและเป็นรายได้เข้าสู่ Synthetix และตกสู่ SNX Stakers หรือ SNX Holders ในที่สุด\n\n![Synthetix ecosystem](https://images.mirror-media.xyz/publication-images/IzS9IccxY8hlsQJv4QUKK.png?height=406&width=637)\n\n### Kwenta (เควน-ต้า)\n\nKwenta เป็น Decentralized Exchange Protocol ที่มีไว้ให้ผู้ใช้ซื้อ-ขาย Synths แบบ Spot หรือ Futures โดยนำ Liquidity และกลไกการซื้อ-ขาย(Exchange Mechanism) ที่ล้ำหน้ามาใช้เป็น Frontend ให้กับ Synthetix\n\nKwenta เป็นโปรเจ็กที่ใกล้ชิดกับ Synthetix มากที่สุด ซึ่งก่อนหน้านี้ Synthetix มี Synthetix.exchange แล้วเปลี่ยนมาเป็น Kwenta ใน L1 Mainnet หลังจากนั้น Synthetix ก็ได้ย้ายมา Optimism network เหตุเพราะว่า L1 นั้นไม่สามารถ scale ได้และมี fees ที่สูง จึงเป็นข้อจำกัดของการเติบโตของ Synthetix. Kwenta เป็นโปรเจ็กที่แยกออกมาจาก Synthetix เพราะจะมีความคล่องตัวที่สูงกว่ามาก หากแยกการทำงานออกมา และ Kwenta ก็มีโทเค็นของตัวเองด้วย\n\n[https://kwenta.io/](https://kwenta.io/)\n\n### Thales (เธ-ลีส)\n\nThales เป็น Parimutuel Markets Protocol ที่เป็นตลาดเปิดให้ผู้ใช้เข้ามาทายผลไปในทิศทางใดทิศทางหนึ่ง เช่น มูลค่าของคริปโตหนึ่งจะมีค่ามากขึ้น/หรือน้อยลง(Binary options), ทำนายผลกีฬา, เกม และเหตุการณ์ต่างๆ เป็นต้น\n\nThales ใช้ sUSD เป็นตัวกลางในการทำธุรกรรมต่างๆ ซึ่งก็เป็นหนึ่งใน usability ของ sUSD โปรเจ็กนี้เริ่มมาจาก Binary options ของ Synthetix และได้แยกออกมาเป็น Protocol ของตัวเอง และพัฒนาจาก Binary options เป็น Parimutuel Markets Protocol ซึ่งเพิ่มความหลากหลายและเข้าได้กับความต้องการของผู้ใช้ในรูปแบบต่างๆ ได้มากขึ้น\n\n[https://thalesmarket.io/](https://thalesmarket.io/)\n\n### Lyra (ไล-ร่า)\n\nLyra เป็น Options Trading Protocol ที่เหมือนกับ options ในตลาดการเงินแบบดั้งเดิม แต่ถูกพัฒนาด้วยเทคโนโลยีบล็อกเชนเพื่อให้ไปได้ไกลกว่า options แบบดั้งเดิม เช่น การใช้ Automated market makers(AMM), Tokenomics, Composable หรือ Permissionless\n\nสิ่งหนึ่งที่ทำให้ Lyra เป็น Protocol ที่น่าสนใจ เพราะการนำ liquidity pool ของ Synthetix มาใช้ในการค้ำประกันสินทรัพย์ของ options และป้องกันความเสี่ยง(hedging) การที่ Synthetix ไม่มี slippage เลยนั้น ทำให้ Lyra ลดต้นทุนและความเสี่ยงของราคาได้\n\n[https://www.lyra.finance/](https://www.lyra.finance/)\n\n### Aelin (เอ-ลีน)\n\nAelin เป็นตัวกลางที่ให้ protocols อื่นที่ต้องการจะหาทุนไปพัฒนาโปรเจ็กตัวเองใช้ในการระดมทุนจากผู้ใช้บล็อคเชน โดยไม่ต้องระดมจาก venture capitals ผู้ที่เปิดระดมทุนนั้นอาจจะให้เป็นโทเค็นจากการได้ทุนและจะถูกล็อคไว้ในระยะเวลาหนึ่งตามที่ตกลงกันไว้\n\nโปรเจ็กนี้เกิดขึ้นโดยบังเอิญ จากการที่ Kain (Founder ของ Synthetix) ได้พูดคุยทาง Twitter และได้เกิดไอเดียว่าน่าจะมีการะดมทุนผ่านผู้ใช้บล็อกเชนมากกว่า VCs. Deals ที่เกิดขึ้นบน Aelin นั้นบางส่วนจะใช้ sUSD ในการระดมทุนด้วย\n\n[https://aelin.xyz/](https://aelin.xyz/)\n\n### Protocols อื่นๆ\n\n* Curve ใช้ประโยชน์ของ slippage ในการ swap assets อย่าง stablecoin สกุลอย่าง sUSD, sEUR, sCHF, sETH, หรือ sBTC ที่ให้ผู้ใช้ curve ได้เรทที่ดีขึ้น\n* DEXs อย่าง Uniswap, 1inch หรือ ParaSwap ก็สามารถ integrate ประโยชน์ของ Slippage ได้เช่นกัน\n* dHedge นั้นเป็น asset management protocol ที่ให้ผู้ที่มีความสามารถผู้จัดการในการลงทุนบน DeFi สามารถสร้างกำไรให้แก่ผู้ที่ต้องการลงทุน ซึ่งก็สามารถเทรดจาก synths ได้เช่นกัน\n* มี protocols อีกมากมายที่ใช้ Synths ซึ่งไม่ได้ใช้โดยตรงจาก Synthetix แต่ก็ต่อยอดอีกไปจาก protocol อย่าง Lyra\n\n![other protocols](https://images.mirror-media.xyz/publication-images/lzqiVH7zy_92ZnlJC9BjL.png?height=164&width=649)\n\n## SNX Token ทำอะไรได้บ้าง\n\n* **Stake :** นอกจากการถือโทเค็นไว้เฉยๆ แล้วก็สามารถนำเอา SNX มาค้ำประกัน (collateral) โดยการ stake บน optimism dApp ของ Synthetix. stakers จะได้รับรางวัลเป็น SNX โทเค็น (จากการเพิ่มขึ้นของโทเค็นใน Tokenomics) และ sUSD (จากการที่ protocol เก็บ fees)\n* **Governance vote** : Stakers(ไม่ใช่ SNX holder) สามารถมีส่วนร่วมโดยการโหวตเลือก Spartan council, Ambassadors council, Grants council และ Treasury council เพื่อที่ให้ผู้ที่ถูกเลือกเข้าไปบริหาร protocol\n\n## จะ Bridge มา Optimism ได้อย่างไร ?\n\nการจะย้ายทุนมายัง Optimism นั้น แนะนำว่าให้ทำผ่านลิงค์ [app.optimism.io/bridge](http://app.optimism.io/bridge) ของ Optimism ซึ่งจะถูกอัพเดทอยู่สม่ำเสมอ\n\n[https://app.optimism.io/bridge](https://app.optimism.io/bridge)\n\n## จะ Stake SNX ได้อย่างไร ?\n\n* การ stake ต้องทำผ่าน dApp > [staking.synthetix.io](http://staking.synthetix.io)\n* แอดมินได้ทำไกด์เพื่อสอนวิธีการ stake และแนะนำอย่างละเอียด\n\n  [วิธีการ Stake $SNX](https://mirror.xyz/0x4412f44c7A3E60E9E1d545901b1EeB6DF0F92155/AcVqFDhHXk8Db-3PsVVbFyND_e5MBQcq0PT4veGPlUA)\n\n## Tokenomic\n\nในเดือนมีนาคม ปี 2019, Synthetix เริ่มต้นมีโทเค็นทั้งหมด 100 ล้านโทเค็น และมี Tokenomic แบบ Inflationary ซึ่งหมายถึงจะมีโทเค็นเพิ่มขึ้นเรื่อยๆ และไม่มี max supply\n\nอย่างไรก็ตามจำนวนการแจกโทเค็นนั้นถูกเปลี่ยนมาครั้งคราวเพื่อปรับให้สอดคล้องกับปัจจุบันให้มากที่สุด และล่าสุดเดือนพฤษภาคม 2022 นี้ทาง Synthetix แจกรางวัลอยู่ที่ 2,282,493 SNX ต่อสัปดาห์\n\n[https://www.coingecko.com/en/coins/synthetix-network-token](https://www.coingecko.com/en/coins/synthetix-network-token)\n\n## ประวัติ\n\nSynthetix นั้นเริ่มก่อตั้งมาตั้งแต่เดือนกันยายนปี 2017 ในโปรเจ็กที่ชื่อว่า Havven (HAV) โดยเป็น stablecoin และหลังจากนั้นในปลายปี 2018 ก็ได้เปลี่ยนชื่อเป็น Synthetix โดยมี Founder ที่ชื่อว่า Kain Warwick, มี Peter McKean เป็น CEO, Jordan Momtazi เป็น COO และ Justin J. Moses เป็น CTO\n\nSynthetix อยู่บน Ethereum ในช่วงเริ่มต้นนั้นมี synths และ inverse synths (ยกเลิกใช้แล้ว) และมีการค้ำประกันเริ่มต้นที่ 750%, Synthetix เป็นหนึ่งใน DeFi ที่เป็นที่รู้จัก และมี Community ที่แข็งแกร่งที่สุดในช่วง DeFi summer 2020 แต่หลังจากที่ Ethereum มีค่าแก๊สมากขึ้นจน stakers ไม่สามารถทำธุรกรรมคุ้มกับรางวัลที่ได้รับ ก็ทำให้ Synthetix จำเป็นต้องย้ายไป Rollup network ซึ่งเป็น Optimism โดย Synthetix เป็นโปรเจ็กแรกๆ ที่ร่วมมือกับทีม OP ในการใช้ระบบ และจึงทำให้ Ecosystem ของ Synthetix ขยายเป็นหลายโปรเจ็กในปี 2021\n\n![Kain Warwick (Founder)](https://images.mirror-media.xyz/publication-images/ruEAeD1cFrt9H_BMUevdQ.jpg?height=461&width=692)\n\n### ศึกษาข้อมูลเพิ่มเติม : \n\n[https://discord.com/channels/413890591840272394/937742470807162910/965982666308616224](https://discord.com/channels/413890591840272394/937742470807162910/965982666308616224)\n\n\n---\n\nผู้เขียน : [Miracle-](https://mirror.xyz/0x8c50651d964B1a573ba0cf51980CA51D9e42623C)", "timestamp": 1654528193, "digest": "FpdFYgqlBj5aTE2s9Wfu87pXoR0Y9yZgOFb2JjdIJNw", "contributor": "0x4412f44c7A3E60E9E1d545901b1EeB6DF0F92155"}
{"id": "-U5GBFoPEjM3Ktpjcl8ma19ZEJ8L2xyeoWSmiBZjAwU", "title": "After brand identity: a designer’s journey", "body": "### Storytelling lessons from a web3 branding project\n\nI recently saw this image in my Twitter feed, captioned with the sentence: \"Literally every web3 project\".\n\n![\"Literally every web3 project\"](https://images.mirror-media.xyz/publication-images/FCdzKQriJVwICMRy5ZJXp.jpg?height=751&width=1500)\n\nI giggled along at first. Later, I thought about that tweet again, and I realised it was right! At the time, I was designing prototypes for our web3 app, [After.](https://after.fund/)\n\nMy experience was so interesting and enlightening that I felt it could be helpful for other designers, too. So, here I will showcase my **brand-design journey**, and describe the lessons I have learned.\n\n### Preliminary research\n\nMy eye-opening research on different web3 projects brought up **a wealth of identikit brands** that reflected everything the infamous tweet describes.\n\n![Similar illustrations and font style among web3 projects websites](https://images.mirror-media.xyz/publication-images/0Jrl6CSsOymorWTZDwDgi.jpg?height=1080&width=1920&&size=medium)\n\nThese results also show that when it comes to branding a web3 project, designers can be somewhat clueless. This is partly because such projects tend to focus on rigid technical concepts that feel abstract and unfamiliar.\n\nOther designers simply feel **overwhelmed by the infinite possibilities at their feet.**  Consider that most of these projects live exclusively in the digital world: hence, just about anything is possible! So why is it that we keep on doing the same things?\n\n### Storytelling is the answer\n\nThis is not the first time I have talked about \"storytelling\".  That’s because for me, **storytelling is more than a buzzword.**\n\nStorytelling is my only way of working, and **the only path that leads a brand towards a strong, relatable sense of identity and purpose.** This is compounded when we consider that, most of the time, both (identity and purpose) are sorely lacking from web3 brand identities.\n\nIn the following paragraphs, I will illustrate the three steps that helped create our company's story.\n\n## Lesson01. Write your story from who you are, no matter how complex the technology or intangible the project.\n\nMost web3 projects try to paint a sophisticated brand identity, often using abstract and/or futuristic illustrations and imagery (*lesson 03*), blunt typography, and neon colours to explain who they are.\n\nThis is as far as their identities go, so no wonder they all look alike.\n\nFrom experience, I understand all too well that if you can’t explain “who you are” through images, you’ll also struggle to communicate your unique identity through words (aka content, *see lesson 02*).\n\nThe task becomes even more complicated when even you don’t know why your brand exists!\n\nTo overcome this issue, the first stage in branding your next web3 project is to **define your key differentiators** (in the form of a mission, vision, values and purpose). Only then will you **create a story that allows others to understand and share your beliefs.**\n\n**After** uses the blockchain technology of smart contracts to create **an automated, transparent, immutable, and private distribution of assets** at an event-based future trigger (for example the death of a person, or a change in their Will).\n\nAnswering Marty Neumeier's questionnaire (a set of 17 questions to find the *Onliness Statement*, that cardinal distinction that can help the business owners to create a prosperous brand.), we defined that our company's mission is **to help people realise the power of wealth.**\n\nFor this reason, the main inspiration for our story derives from the keys of Pluto. According to the Orphic Hymn to Pluto, among many other attributes, Pluto owns the keys that connect with God's capacity to give humanity wealth.\n\nIn ancient Greek burial practices, the **keys** symbolised revelations that the deceased was obligated to keep secret, along with a coin placed in their mouth to ensure a safe passage into the next world.\n\nWith such rich references to draw upon, the key became an essential visual element of After's branding, while the coin became **After's utility token #OBOL.**\n\n![After brandmark](https://images.mirror-media.xyz/publication-images/1lEDbqUMzrvrBRm4WMmDt.jpg?height=1080&width=1920&&size=medium)\n\n**After's brandmark is a key**, which features a bespoke design of the capital letter A on the top. This brandmark is enclosed in a geometric hexagonal shape, representing the value of privacy and secrecy.\n\nThis sophisticated and elegant brandmark is paired with **a bespoke sans serif typeface** representing the bold encrypted structure behind creating a Will through After's platform.\n\nThe design of the capital letter above the key is also used to represent the utility token #OBOL.\n\n![#OBOL symbol and tokenomics](https://images.mirror-media.xyz/publication-images/7AYiTtGX0_1h-DNybLFJV.jpg?height=1080&width=1920&&size=medium)\n\n## Lesson 02. Build a community through content, and project personality through fonts.\n\nIn a world that is entirely digital, such as web3, typefaces can break traditional print-rules and enjoy the freedom they deserve on-screen… where they can be the stars!\n\nUnfortunately, when they are overused, large, animated typefaces create a bustling environment that tires our eyes and drains our minds’ focus from the rightful heart of the brand’s storytelling: **content.**\n\nOne beautiful side of the de-centralised web is the **communities** that form from similarities in specific ideas, and your project’s unique values (as explained in *lesson 01*). So, the right content is critical.\n\nIf this interaction is missing, you will deprive your users of **meaningful participation in the web3 experience.** No matter how fancy and futuristic your project is, make sure your typeface is also clear, legible, and humanly expressive, so it can properly introduce your project to its users.\n\nFor **After**, we wanted to build a community whose **values could inspire future generations.** After must communicate a sense of immutability and permanence, because this is our promise to the community.\n\nOur content also reflects how After speaks to **a primal human need** (the desire to ensure a better future for our loved ones), which is powered by blockchain technology (immutability and permanence).\n\n![Organization of the content on After landing page](https://images.mirror-media.xyz/publication-images/pj0WuTw5eHDE-_MRYa1c3.jpg?height=1080&width=1920&&size=medium)\n\nOur values and duality are revealed in our specific choice of typeface.\n\nWe opted for **Frank Rhule Libre**, the digital version of a traditional serif typeface used mainly in print.  We then paired this with a modern sans serif font, **Lato**, which is exclusively designed for the digital world (though it looks good in print, too!).\n\nThe sans serif has been used in every header, to deliver essential concepts and help readers to scan the page effortlessly.\n\nLato, meanwhile, has been widely used in long paragraphs for its semi-rounded details that aid readability, as well as offering a sense of gravitas.\n\n![Some slides of our pitch deck to illustrate the usage of the typeface](https://images.mirror-media.xyz/publication-images/kt4Ms5XBxN853vjLjAkIH.jpg?height=1080&width=1920&&size=medium)\n\nStorytelling also helped us to elaborate the delicate **concept of death** in a personal and expressive way, focusing on positive legacy rather than heartbreak. For this reason, the word **\"departure\"** was chosen over “death”.\n\nOur users are referred to as **Afterists**: people who have taken control of defining a positive future for their loved ones.\n\n**After** also promises to make the **journey** towards creating a Will both pleasant and accessible – a simple process that is literally at their fingertips.\n\n## Lesson 03. Illustrate your story: create differentiation with your own visual language.\n\nColours and illustrations are powerful storytelling methods.\nHowever, if your web3 project's visual language feels similar to that of so many other projects, **how can you differentiate yourself?**\n\nAs we have already touched upon, the alarming similarity is likely due to your attempt to explain the technology behind the project (which most of the time is complicated and feels unfamiliar), rather than explaining the values and purpose of your brand.\n\nWhen illustrated with intention, **a compelling story has the power to spark conversation.**\n\nIf you explore your company's key differentiators (mission, values and purpose), you will be forced to **think creatively about your brand's unique story**, and how you can harness its competitive power.\n\nIn the case of **After**, our values inspired our colours: from the very light, like white and pink (emotion, afterlife, purity, clarity, meditation, light), to darker, more sophisticated shades like purple and black (wealth, death, meaning, passage, spiritual).\n\n![After brand colors and values associated with each color ](https://images.mirror-media.xyz/publication-images/zqXv2o4DfhxfKWGldDAxW.jpg?height=1080&width=1920&&size=medium)\n\nThis content (including our mission and purpose) inspired our illustrations.\n\nAs we mentioned in *lesson 02*, we used the words *journey* and *departure* to introduce and explain our app. An inspirational story, the Myth of Pluto, describes **the journey in the afterlife.**\n\nHence, I created a series of illustrations that visualise the passage of our Afterists to a world that is peaceful and everlasting, crafted from expansive architecture and infinite skies.\n\nThe illustrations are also part of **a** **non-fungible token (NFT) collection called Elysium** (from the Greek, *Ēlýsion pedion*; a conception of the afterlife developed over time by some Greek religious and philosophical sects and cults).\n\nThe Elysium artworks, or NFTs, will be distributed as a ‘pass’ to join the community. Only pass holders can unlock community-specific channels, or gain access to exclusive perks and rewards.\n\n![Samples of Elysium NFT collection](https://images.mirror-media.xyz/publication-images/Q1zRxx_Gl6Btv7C73z3hr.jpg?height=1080&width=1920&&size=medium)\n\n## Takeaways\n\nIn a world that changes so rapidly, storytelling can help web3 projects hold users’ attention, as they build lasting and memorable community connections. Working on our After's narrative, we learned:\n\n* Your mission, vision, values, and personality will **build your unique storytelling strategy.**\n* Your story will guide you towards choosing the right words for your content, and a typeface that clearly **expresses your ethos.**\n* Storytelling inspires illustrations that focus on the key differentiators, helping you forge **meaningful connections with your customers.**\n\n**We hope you enjoyed my designer's journey!  If you would like to start a new journey all of your own, that cares for and protects your loved ones, [you can visit After’s website to find out more.](https://after.fund/)**", "timestamp": 1654528172, "digest": "Wg9Dm5EOzloeGG0B0uNAzlh1EgcV96P9wQN1THSIC7w", "contributor": "0x38647F20D41ADE5BE2D68992dD6EFAE0ff0E0B24"}
{"id": "urEfH9ZAqzOloAfKact5ywRVOyCstGveQHmu3HZbEDo", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年初，基本上经历了一整轮从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中后期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528412, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "YtjZwslxza77MjvY0SYpUkj10aGdc-JrXWgCOCR0E-w", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年6月，基本上经历了一整轮市场从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，市场环境也不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528190, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "E6FeJG1ydvr0SzpNrDnDjeApCkZbEtUXt1bCMCgXYBg", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年初，基本上经历了一整轮从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中后期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员赔偿，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528427, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "HV7HGt8UY-yxlYVo80ko6xN_BPys7Y3MDgKEvywTwPY", "title": "Saying Goodbye", "body": "I don’t even know how to begin. What am I writing? This is goodbye. So long to people. I am trying my best to write this in earnest. This is my life. Money is simply a tool and we tool each other. Enough of that. Let’s get to it. The heart. That’s where the story begins. Let there be light, *Für Elise.*\n\n![NOSTALGIA LITE: Lambo VHS Casette Rewinder](https://images.mirror-media.xyz/publication-images/CIZtqss8DW0D39mr0YSK9.png?height=688&width=802)\n\nA moment exists between birth and memory, the weeks, months and years therein shape your identity without your knowing. I call this *the first draft.* The ink that spills between the lines of our lives. Identifying with this record is outside of our waking boundaries; escaping us completely yet rooted in our essence. For the sum of our emotional impressions gathered during *the first draft* remain. Who we are *is what that is*. We spend our lives returning time again in search of. I found myself back home with her.\n\nAir, the space between our thoughts, shaped mathematically is the sound of music. Patterns resulting in harmony, melody, sonic texture and more. The world today is a kaleidoscope of sound; Music Industry revenues are forecasted to grow 84% by 2030. That’s a whole lot of 000s, but let’s get to the point. Why. do. we. do. this? *Für Elise*. I first met her on Christmas day, before I could even remember my own name. This VHS cassette rewinder was shaped like a lambo, and when you rewinded the cassette it would play Für Elise. It became my singularity, like someone turned the lights on.\n\nIn my life, this moment defined me. I’ve even told my friend that this lambo VHS tape rewinder was my personality. It had utility, it had style. It was an instance of culturally significant technology. Most people had the normie VHS cassette rewinder. If you had this lambo VHS tape rewinder, you were for sure one of the lucky ones.\n\n![NINETYONEMGMT Graphics Standard Manual (2017)](https://images.mirror-media.xyz/publication-images/kI2Z5gkJ_mddRZjnZ96-t.jpg?height=2160&width=3840)\n\n## Getting Lost\n\nSchool, work, love, fuck. If you’re doing alright, you’d do all four. What happened was that at some point life became vaporware and then things weren’t alright anymore. But they weren’t bad either, they were just.. okay. It happens to the best of us. When you wake up, you just get back on track. I quit my day job and chased the dream. Las Angeles, my only friend. She felt natural and I was too. A one way ticket never hurt nobody. 2017 was the year of the sofa; the same year NINETYONEMGMT was born, too. Explicitly or not, we managed an artist by the name of Riz La Vie and worked out of the SONGS Publishing office in LA to coordinate his one and only hit, Napkins.\n\n![Sunset Boulevard, West Hollywood (2017)](https://images.mirror-media.xyz/publication-images/NCUKqmqX_ZgVBJ1AMoi5d.jpeg?height=1050&width=1400)\n\n[Success ensued](https://mega.nz/file/pAkx3ZBC#3tq4Tt0RpVy09C5hy9SsGfALFeII7A3En6riCjaQbps), but we weren’t happy. I got into the business to make massive records with artists I love and holistically champion their estate. Yet somehow, we were not incentives nor values aligned. I had to split. I got into a wreck both [figuratively](https://mega.nz/file/EYNynZCY#4_ecD4Cp967BEDQZFx4W0v1EL0IXOz9Yl-M_fT_etMU) (2019) and [literally](https://mega.nz/file/NFliFTBS#5tq7dYDGSedJPybHBylt7hl5ln8KK7oLVlLGRk1URBE) (2020). Ask anyone close to me and they’ll tell you I am lucky to be alive, or re-alive, or rebirthed. You’re down bad when you fall from heaven and I felt cast away like Lucifer when he fell. Revenge captured me; for the last two years I’ve been working through contempt, feeling loathsome of myself and my situation. I had to remember who I was to forget who I’ve become.\n\n## Rewinding The Cassette\n\nThey say that life is like a movie, but do they mention anything about sequels? Because I’d like to get what’s mine this time. My mind had become like the lambo VHS cassette rewinder. I got back to the music with each rewind. Für Elise, a song dedicated to a muse, a maid or a love interest perhaps; reminds me of a yearning. It’s a bittersweet tune with remnants of euphoria, a fitting synchronization to the movie I had just lived. I need to outgrow myself now and that’s why I’ve got to say goodbye.\n\n![Songwriting Sessions (2017)](https://images.mirror-media.xyz/publication-images/V-ibnwOYd055gltwu735e.JPG?height=3024&width=3024)\n\nIt was not without its moments, friends, and memories made. While still I act in full capacity as a talent manager, I no longer operate under this manifestation. NINETYONEMGMT had become Vaporware. Its time under the sun nearing an end. Dreamt up by a headstrong founder and creative, it is responsible for hit records, millions of streams, many dozens of shows, and lives changed. It had fulfilled what the founder had imagined, because at the time of its inception, the founder was very naive. We’ve got new dreams to dream, new songs to sing.\n\n## It’s up to \\*us\\*\\*\n\nMusic. Music. Music. It’s always been about the Music. Remembering who I am and what I was about, that saved me. Music saved me. The first time experience of Für Elise was like my own genesis. Simultaneously, I’ve forgotten who I am and remembered who I was. This is what you call a moment of clarity. The sum of my combined experiences remain, yet my outlook, attitude, and vision are born again. This time I’d like to take it to heights never before imagined.\n\n![Rooftop at Live Nation, West Hollywood (2018)](https://images.mirror-media.xyz/publication-images/cWKm3Exim8CTm6q0JLAfu.JPG?height=2726&width=4096)\n\nI borrow a piece of our old lore to explain our new direction:\n\n> “We are vanguards of creation and approach our work with a sense of exaltation and wonder.”\n>\n> \\- *NINETYONEMGMT ETHOS (2017-2022)*\n\nI’ve reached singularity again. Friends, I bid you farewell. I won’t be long, but I won’t be around much either. Now I spill my ink anew, a second draft on the way. I am back home and feeling well. I leave this text in memoriam. In honor of what we accomplished and with respect to the truth.", "timestamp": 1654528464, "digest": "nHGMwfBKvg1a_AtNa5DXXlO6Km2Akl12cfVTLbwx__Q", "contributor": "0xB6f7ddD59cf4Ce557bA2de0d7d1B2F4Bc948e133"}
{"id": "3D5flLDSvxtAtkBzHRtgNoxVVWHiBRl2bFUFy4dwi6U", "title": "NotLuna", "body": "I believe it was Gandhi who once said, “Pretending to quote me is a great way of getting people to read nonsense.” Got you !\n\nAight this won’t be too long. This is a meme project, make no mistake.\n\nCliche time; Merriam Webster defines ‘meme’ as: *an amusing or interesting item (such as a captioned picture or video) or genre of items that is spread widely online especially through social media.*\n\nThat more or less covers it. The internet changed the world. Perhaps the biggest change is that it brought the world a lot closer. It is believed we produce 2.5 QUINTILLION bytes of data per day. That’s like downloading the complete works of Mozart approximately 1/7th the number of times as there are grains of sand on earth. Confusing, right? 4 years in America will have you using anything but the metric system. Accurate? Who’s gonna count and confirm?\n\nAnyway, a lot of this data is being transmitted almost instantaneously over the internet. To put this in perspective, you could send the complete works of Shakespeare to someone as many as 1.75 million times as there are planets in the universe in the time it would take you to send the same to someone without using the internet in any way ONCE. Amazing, innit?\n\nOkay enough jibber jabber. I’ve made my point. A result of this amazing speed of information sharing is being able to discuss stuff in live time. Now when rich Americans decide to buy a popular company with a bird logo, you don’t have to wait till they’ve already started pretending to do ‘due diligence’ in order to drive down the price,Nope…you’ll start seeing jokes about it on that surveillance device you keep within range at all times.\n\nWe know you get your news from meme pages, don’t worry…us too.\n\nMemes have become a crucial part of human society. In fact, I would go as far as to say they are the single most important cultural creation of the 21st century. Memes are borderless, from the 'dee O double G' all the way to a random kid in Southeast Asia who decided to take pictures of himself every day. Memes encompass the entirety of the trippy ass spectrum that is human emotion and deliver it to us in a slightly easier to digest way.\n\nAs Alfred Hitchcock said, “Exposition is a pill that has to be sugar-coated. In other words, you are giving them information, but at the time it must seem like something else. ” ([here’s](https://www.youtube.com/watch?v=oEq2XjFCaps) a great video on exposition for any film nerds reading this).\n\nThe point is - memes are useful, important, and fun (Oxford comma much?). Memes are here to stay.\n\nThe phenomenon that is the Internet is also what enables the creation of your favorite buzzwords: Metaverse & Cryptocurrency. We are far closer to plugging into the soulless utopia of bright colors and algorithmically generated emotions than you think. Ready? Player One.\n\nThe very ideas of ownership are changing. For the first time, we are exploring the digital realm, being able to do our favorite thing: own stuff. Enter NFTs. The latest descendant in a long line of honeypots originating all the way back to the great Tulip of mid-17th century Netherlands.\n\nThe NFT is possible because of a little something called the Blockchain. You probably know what that is by now. If not, read more man…seriously pick up a phone some time.\n\nAnyway, it is largely agreed that the two major value propositions of the blockchain are decentralization and security. But I believe there are two equally, if not more, important adds are incentivisation and community.\n\nAnyone in the NFT space already knows about the power of community, a bunch of people doing word of mouth marketing for you with vested interest? Hell yeah. And as for incentivization, we’re only beginning to explore that plethora of possibilities. We can create models that allow rewarding people for anything. And I mean…anything([SEXN - a first of it’s kind sex-to-earn protocol](https://twitter.com/mattysino/status/1530215852037050368?s=20&t=oeFix0P1C2Q7Vw2NrrdrUg)). Yeah…everything is going to zero.\n\n(All these things combined are what we call Web3.)\n\nBUUUUUT, in case it’s not, we think the meme itself should find a way into this “Web3” too. In a manner that’s keeping up with the times. *And that is what NotLuna is all about.*\n\nNow that you know the “Why?”, let’s talk about the “What?”.\n\nNotLuna is a collection of 10,000 NFTs on the Ethereum blockchain. NotLuna is NOT, in any way, a reference to one of the best memes in history. It does NOT take inspiration from perhaps what is one of the greatest stories of human hubris.\n\nBut you know what they say: comedy is tragedy plus time…and we’re laughing about it already.\n\nNo, NotLuna is about a person, just like all of us.\n\nMeet Do Gen:\n\n![Do Gen](https://images.mirror-media.xyz/publication-images/WLaJ-Za_GlDVG71d3jQUn.png?height=1000&width=1000)\n\nJust like all of us, he’s trying to make it in Web3 too. And just like all of us, he goes through many emotions.\n\nDo was born in NotSeoul in a time well before Web3. But technology always spoke to him. In fact, he even studied at the prestigious NotStanford community and then went on to work for behemoths like NotApple and NotMicrosoft. But it was in the blockchain that he found his calling.\n\nNow he spends his days trying to find the next big thing and when he has time from that, he tries to create something of his own. Oh and he loves to water his plants, whatever that’s about.\n\nJoin Do on this emotional roller coaster that is the decentralized internet.\n\nGMI or NGMI? Only one way to find out. (mint it)\n\n## FAQs\n\n* Wen mint?\n\nNot sure yet, but super soon.\n\n* Free, right?\n\nYeah yeah. Y’all been conned one too many times for us to be able to charge you for this. But we’re keeping 1000 and we don’t need to explain why.\n\n* Roadmap?\n\nYeah, as if you read roadmaps…you’re in it for the vibes and so are we.\n\n* Really, nothing planned?\n\nNot per se, but some people believe that when Do Gen was born, a mystic made a prophecy that if Do Gen’s collection reached a 1E floor, he would find his wife Di Gen and together they would create an army of De Gens. So we’ll see.\n\n* Who are you?\n\nAh yes, the team. Another metric you pretend to look at before “aping in”.\n\nThe writer of this paper is @cryptanosaurus. I have been degening on the blockchain for about 6 years now and am now building something pretty cool (shameless plugin). Check it out here: [https://novadao.xyz/#/](https://novadao.xyz#/)\n\nOh and the mint link will be released in Nova’s discord so you probably want to hop in there.\n\nAnd the Co-Founder, Archie, is an artist and architect. He has been in charge of bringing these traits to life.\n\nThe funny thing is, Archie and I have never met in real life. We met each other through the mutual ownership of the Pixel Vault Founder’s DAO. Maybe NFTs do have some promise after all. They bring people together .\n\nYou can suss us out on Twitter, we’re legit (like legit enough for you to take a free NFT from us).\n\n* Hey these faces look familiar…what’s that about?\n\nIf these expressions ring a bell, you’re old enough to stop wasting time on random mints and get a real job. Ur old and ur poor and ur still wasting time on memes. But yeah, we felt a great way to begin the Web3 meme journey is with an ode to the first memes. Sit and think of new stuff and not just remake old shit combined with a topical element? Bitch Please!!\n\nSee you soon, my fellow ~~De Gens~~  Do Gens!!\n\n![The Many Moods of Do](https://images.mirror-media.xyz/publication-images/iCly51yygBTV9xsrm2Nhb.png?height=500&width=500)\n\n", "timestamp": 1654528699, "digest": "UX5AzHVKO17pD2KmIfcodkiFkE8-CtlOnQps5KMAIhk", "contributor": "0x93FC0C711c2dF516Bc442AD4B3Ed47Cc4001829B"}
{"id": "7kpJ9ABVrW8Zy7ZqfQ--u70ULgiFSbb3L5Mr4f5mq7k", "title": "The Many Voices of Jim Goldberg", "body": "**By [Gregory Eddi Jones](https://twitter.com/EddiJonesNFT)**\n\n![Whirlpool #45 Mad Dog's Auntie by Jim Goldberg.](https://images.mirror-media.xyz/publication-images/kAOOHXrib-EbAzfE9axq0.jpg?height=768&width=1024&size=large)\n\nThe photographer Jim Goldberg is well-known for his expansive toolbox of storytelling techniques, and his work is often heralded for new innovations in the documentary tradition. Goldberg often trains his lens on the types of subjects that other photographers ignore, and his work frequently dispels the misconceptions of people on the fringes of mainstream society. All the while, the photographer speaks in various visual voices in a multi-faceted form of storytelling that acknowledges the complexities of his subject matter. It is with these practices that Goldberg presents his latest body of work, *Whirlpool*.\n\n![Whirlpool #40 Harry Saul Minnow Farm by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/pWC_5IRRvtJcUxZuktAcM.jpg?height=1024&width=768&size=medium)\n\n*Whirlpool* is an extension of a larger project that Goldberg was originally commissioned to create for Atlanta’s High Museum of Art from a series of grants that urged photographers to explore the culture of the American South. The project brought him to Arkansas, a place where few photographers seem to venture in their quests for stories about American life. Goldberg’s work there culminated in a 30-ft wide black and white photo collage about the lives surrounding the Arkansas Delta that was exhibited at the High Museum, and which featured prints collaged together with words from the many different voices of people he encountered in his venture.\n\n![Whirlpool #31 James by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/FRD9aAZKA4TM2Eu6tq1Rz.jpg?height=677&width=1024&size=large)\n\nFor his Obscura commission, Goldberg revisited Arkansas and, over the course of two weeks in February, produced a new series of images in Augusta, a small, working-class city that has faced a long and slow economic decline since the late 19th century. The photographer’s interests centered on local communities from church groups to boxing clubs, as he sought to unearth the richness of history, family, and culture while being attuned to the complex relationships the place has to struggling economics and attitudes toward race and class.\n\n![Whirlpool #15 Camella and Cortnie by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/8YBIK1F5NBBOG8exBcs58.jpg?height=819&width=1024&size=large)\n\nThroughout the 55 images of this collection, Goldberg takes us on a tour through Augusta. Portraits introduce us to its inhabitants, often accompanied by hand-written scrawls from the subjects themselves that allow them to tell fragments of their own stories. This follows in Goldberg’s decades-long commitment to eschew the typical dictatorial role that a photographer plays in defining their subjects, providing space for co-authorship to enrich the notion of storytelling through collaborative processes.\n\n![Whirlpool #8 Kensea by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/MvfDBPb6EwxRkvyfqVmn4.jpg?height=1024&width=832&size=medium)\n\n*Whirlpool* itself represents a cacophony of visual voices which range from strict, cold B&W renderings to colorful and emotionally warm portrayals of the city’s populace. In the photographs of Whirlpool we encounter pictures that speak with airy romance, but also crude realism. Pictures compete with one another for a supremacy of definition in the emotional, factual, and interpersonal perspectives that visitors may bring to this city with them.\n\n![Whirlpool #10 Hunting Lodge by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/BtNEtMG_ewJSTQ9uxJ_D6.jpg?height=768&width=1024&size=large)\n\nWhile many photographers subscribe to the narrowly confined styles to illustrate purposefulness in their pictures, Goldberg’s practice reflects the complexity of his subject matter, and the hybridized image-forms that represent this project nod to the notion that documentary should not be conducted in a single voice, flattened by a particular aesthetic definition, but rather opened widely to demonstrate the contradictions that exist within any given place and within any given person as well. In sum, *Whirlpool* presents an orchestra of conflicting voices that reflect perhaps not what Jim Goldberg himself found in the town, but the biases and assumptions that we as viewers would likely bring had we gone there ourselves. \n\n![Whirlpool #22 Berry Pie by Jim Goldberg. Obscura Magnum Commission.](https://images.mirror-media.xyz/publication-images/ZGywygUP-dzPr0olIFK1e.jpg?height=768&width=1024&size=large)\n\n**To view the full collection** of Jim Goldberg’s Whirlpool drop:\n\n[https://obscura.io/collections/jim-goldberg](https://obscura.io/collections/jim-goldberg)\n\n**Follow Obscura DAO** on Twitter:\n\n[https://twitter.com/obscuradao](https://twitter.com/obscuradao)\n\nJoin the **Obscura Discord:**\n\n[https://discord.com/invite/2UDwMfnRRF](https://discord.com/invite/2UDwMfnRRF)\n\n **Want to Contribute** to Obscura?\n\n[https://airtable.com/shrgZ0BhGA0stsqik](https://airtable.com/shrgZ0BhGA0stsqik)\n\n**Want to Partner with Obscura?**\n\n[https://airtable.com/shr0qRDmFLro3V7i9](https://airtable.com/shr0qRDmFLro3V7i9)\n\n", "timestamp": 1654528530, "digest": "LuYg1cP5-Bbqyc3seSlm4GrKdqojT1v6rn0c6Dkemf0", "contributor": "0xFda746F4C3f9F5A02b3E63ed6d0eBBc002d1f788"}
{"id": "aK8iv2TXw-TRqZim1JLD8yPOjqdCQ907Jr7kRDprKUI", "title": "Living in Perpetual Violence", "body": "I live in a country completely engrossed in violence. I’m blessed enough to not have violence in my personal environment, but every time I leave the house, I anticipate that I could enter any plethora of violent scenarios.\n\n**We must begin to ask ourselves what living in perpetual violence does to our mental health**, how ongoing trauma impacts our well being.\n\nWe can turn to overt violent environments, like the war in Ukraine, and see what happens to the human spirit under the ongoing campaign of senseless violence. For some, the spirit rises up and fights back. For others, the spirit retracts in self defense. In all, the spirit frays under the constant duress of heartbreaking and senseless death.\n\nWe can’t deny the scale of tragedy in Ukraine right now. I can only imagine what living through such destruction would do to one’s heart. But what I’m exploring in this essay is a more subtle and ongoing war against one another. The violence we allow and inflict upon one another, in a country not at “war” is a stunning and devastating reflection of who we are as a society.\n\n**The fact that we Americans allow, ALLOW, gun lobbyists to buy and sell our children’s futures so they can reap gross profits on the fear instilled in a population obsessed with violence is stunning. And devastating.** The fact that 90% of the country want sensible gun laws, and I would guess at this point many want to eradicate guns completely, yet 50 old, privileged, white senators in DC want to protect their donors is also a stunning indictment on the reality we’ve created as a country. Which leaves the rest of us to watch in a helpless horror as our communities become target practice for young male racists with serious mental disorders. Every week. Hell, almost every day.\n\nI am constantly appalled at the country I call home. I constantly plot ways to live overseas and not miss my family in a way that makes want to return to this hell hole. Every time I get out of my car to enter the grocery store, I grab my cell phone and make a conscious decision to bring it with me in case I end up in a mass casualty event and have a few seconds to call my family and tell them goodbye. Every time I sit at a coffeeshop and write, which is daily, I scan the door often to see if some angry white Incel is going to enter and shoot the place up. I returned to university this year and I often wonder, while sitting in a classroom, if some angry, broken white male will enter the room and start shooting and I begin to scan for the exits and hiding places.\n\n> Why do we live like this? Why do we allow politicians to do absolutely nothing but vote against the safety and security of the people they are charged with voting on behalf of? Is the shopping really that good? Is the entertainment culture really that satisfying?\n>\n> **Are the distractions from reality so beneficial that we allow our children to take the bullets that our politicians are too weak to stop?**\n>\n> Are we really that broken that we can’t see what guns and polarization are doing to this country? Are we really so blind that we can not and WILL NOT protect the children we love so dearly? Are we really so tired, broke and exhausted that we’re OK with allowing less than a third of this country, filled with ignorance, hatred and violence, to attack our children, women, BIPOC and LGBTQ communities each and every day and deny us our inalienable rights to simply live and breathe the same as them?\n\nI’ve learned many new tools in my yogic and Buddhadharma studies this past year at school. I’ve learned to live with an open heart, which makes living in such a country so much harder. And to be clear, I’ve visited and worked in some of the most violent countries in the world and never felt the anxiety of random violence like I do in America. I’ve learned to lean into the pain and anger and find the lessons so they don’t consume my thoughts and actions. I’ve also learned to hold space for duality.\n\nThe duality of living in such a violent country yet also seeing the beauty of such a place as America is the thing I am struggling with one day after 19 children were murdered by a crazed gunman while learning arithmetic and giggling with their classmates. **Holding space for both the reality of this place and the beauty of this place is getting harder by the day.**\n\nAnd if we’re being honest here, the next six months will determine just how much duality we can all hold without breaking. If we don’t restore sanity to this country and protect our children, our women and our elders from the desires of a handful of old ass white men and women in DC with ulterior motives they no longer bother hiding, then I fear our ability to hold that duality will be shattered.\n\nAnd some of us will have to leave to preserve our mental well being. Is it too much to ask to simply want to enjoy public gathering spaces with lovely humans and share the communal act of breaking bread and meaningful conversation without the haunting specter of random violence lurking in the shadows of every moment? I don’t believe it is. I know other countries don’t live this way and are looking at us in absolute horror at what we permit to happen in our communal gathering spaces each and every day.\n\n**We must take a long hard look at who we are and who we, as a country, wish to become.**\n\nWe can vote, we can protest, we can scream into the void until we can scream no more, but at the end of the day, such a systemic change as what’s needed now will take more than what the everyday person can accomplish. We need the DOJ to actually enforce the law and begin prosecuting politicians and citizens who committed treason on January 6th. We need accountability for those in power or those who were in power and openly abused it to try and steal elections and rig our voting system. We need celebrities and leaders with platforms and access to the masses, those who have cultivated massive followings of people, to speak out right now.\n\n#### Use your platforms, take the microphone and DEMAND that the leaders of this country change. Now. For I fear very soon it will be too late.\n\n[edition://0x859Dd1640FD30FDB64f0c54082f745a100768E8d?editionId=0](edition://0x859Dd1640FD30FDB64f0c54082f745a100768E8d?editionId=0)\n\n", "timestamp": 1654528689, "digest": "ewg-LW63vhkKxlxopUTjjOwdn-Z-VYgnzaJpYobAGv8", "contributor": "0x1ba3ef24bc64B22a80422678d4B6Ea85f0f92Bde"}
{"id": "_C9d665JaqMPlVtv2tK4v8mmIKGvF-YsRhSzi50d7SY", "title": "Dear Diary #000", "body": "no need to know me \n\natm 19 year old virgin really into NFTs and Crypto quite ironically (wow I am using this word) broke\n\ni am planning to study in Germany and really caught up into this mess really wanna get out of my country and go abroad. I dont have good grades so me studying there in a public is tough but I am working hard and trying my best to go there \n\nwish me luck :)\n\ni am gonna keep you guys updated also I have an exam on 10 and 19 June pray for mr", "timestamp": 1654528848, "digest": "UivFTqG7b-ZHaQtqeDP5fcEgoV7kw1XtFFtVHnXZCA0", "contributor": "0xde0FE8538Cc42fF4d846Cf8Ca4Bf0345517a274D"}
{"id": "d3y6ewO9cqUzT3TqJm8h65PxyAHxI6LAJIof19tO7gE", "title": "Come and win XCarnival 96 hours super reward.", "body": "[https://xcarnival.fi/Home?rCode=34W5GF](https://xcarnival.fi/Home?rCode=34W5GF)\n\n![](https://images.mirror-media.xyz/publication-images/2qJpZrcmxviSpyhVRtzDe.png?height=639&width=1278&size=large)\n\n![](https://images.mirror-media.xyz/publication-images/jFsU5eCwgVCIN9nliJ20a.png?height=717&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/VNpSG9YN2zXyqChpxktvv.png?height=720&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/-G_Yt2GzB2HZfrnLKzYvg.png?height=718&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/McVNTgD7fiZJWDpaPCg4x.png?height=721&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/gGAPHHdVFHcAaTI4uDI-B.png?height=719&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/l_1SZdD6T8LAfZlZEqgKz.png?height=721&width=1280)\n\n![](https://images.mirror-media.xyz/publication-images/vpbCJ7BpAstwOU9162thb.png?height=715&width=1274)\n\n![](https://images.mirror-media.xyz/publication-images/PmfNoH8W6pSLxHUDbQXQ0.png?height=719&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/tPT71wRqhAHjJVouI4lEp.png?height=719&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/xWTIhoQ_1t8qs-PZy4q75.png?height=717&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/Gan0qQR3nKdTtgtmbKnXq.png?height=715&width=1275)\n\n![](https://images.mirror-media.xyz/publication-images/hPI4Wf5OGOhRAKu8Fy-Ns.png?height=719&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/lgyG-Agxo3gOnwLG37Xx5.png?height=719&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/DfN4QqnBqsWOWh8GzPSW0.png?height=719&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/aejQrCyIl14KV76BvS7hF.png?height=719&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/NXRKaH-7DHOWA_11iGym_.png?height=721&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/bnjOlaLnVcFTXJ0IXp5mJ.png?height=719&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/ZId4vT9KA5WawWAcXUbOW.png?height=721&width=1278)\n\n![](https://images.mirror-media.xyz/publication-images/EpoE-rNEroBAL7yGOjB0r.png?height=720&width=1279)\n\n![](https://images.mirror-media.xyz/publication-images/iBAsUvlGbW7Bvtbrprn3s.png?height=716&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/B-7f4y7RHY5Qc3jGuS1k1.png?height=718&width=1277)\n\n![](https://images.mirror-media.xyz/publication-images/35Hanh8LDxyIZ864KBZU1.png?height=715&width=1276)\n\n[https://xcarnival.fi/Home?rCode=34W5GF](https://xcarnival.fi/Home?rCode=34W5GF)\n\n", "timestamp": 1654528753, "digest": "uAbaGs4dFz2tfPtu_tO1gOOX42VDxvM-TZPbda5la-w", "contributor": "0x036228015972297b37aCb933BB924c0384b6BEd5"}
{"id": "DcLWRVItiwx5FD3ZdJwbOWubBXKFXox1yOEf-UfblyA", "title": "albums as smart contracts", "body": "When musicians mint music NFTs, what type of relationship do they have with their smart contract? (creator: smart contract)\n\n* 1:N - Album\n* 1:1 - Artist\n* N:1 - Platform\n\n### N:1 - Platform\n\n* there is one, shared, smart contract for all music on the platform.\n* upgradeable.\n* example: [Mint Songs](https://mintsongs.com/) ([OpenSea](https://opensea.io/collection/mintsongs)).\n\n![Mint Songs on OpenSea](https://images.mirror-media.xyz/publication-images/AUxrwfNrye6-Vc3mUXzUx.png?height=804&width=1010)\n\n### 1:1 - Artist\n\n* each smart contract represents an artist.\n* multiple projects on one contract.\n* example: [Sound.xyz](https://www.sound.xyz/) ([Iman Europe](https://opensea.io/collection/iman-europe), [Pussy Riot](https://opensea.io/collection/pussy-riot-xxx), [Daniel Allen](https://opensea.io/collection/daniel-allan)).\n\n![Iman Europe has multiple project on sound.xyz](https://images.mirror-media.xyz/publication-images/0sYXOqlHgVMXkLvFnbnvy.png?height=2084&width=3840)\n\n### 1:N - Album\n\n* each smart contract represents an album, EP, or single.\n* pre-defined at contract creation.\n* example: [Zora Drops](https://create.zora.co/create) ([glassface.eth](https://create.zora.co/editions/0x3e7fa0f13125ea8f1f17250bdd0924c974d3e80d)), [Glass.xyz](https://glass.xyz/) ([CharlieCrown.eth](https://glass.xyz/v/BWFBbU0NL87zLe4RjgEE1IO2yvmLH48q7ItSLdK1EfA=)).\n\n![Zora Drops - \"FOUNDATION\" by Glassface 🎵](https://images.mirror-media.xyz/publication-images/V7FEJTAmvo0D6ZMd83Uko.png?height=2088&width=3840)\n\n## NFT Factory\n\nOnboarding the next 1 million web3 musicians requires easy-to-use UI for creators to deploy smart contracts for all 3 options. Free to use, at gas cost. Platforms (option #1) does not need to consider a factory because all NFTs use one, shared, smart contract. Artists / Albums need a permissionless NFT Factory for musicians to create new Album / Artist NFTs. Ethereum must be supported, as well as having networks for experimentation such as Polygon Mainnet, Sepolia testnet,  Goerli testnet & Mumbai testnet.\n\n![sometimes I doodle](https://images.mirror-media.xyz/publication-images/h_MMVz7CTBdwb4G94b0vq.png?height=742&width=2020)\n\n### Deployment Pattern - Proxy vs Standard\n\nTransactions on Ethereum Mainnet are expensive. Deployment of large, feature-rich, smart contracts is expensive. Proxy contracts are less expensive to deploy. “Proxy contracts” are a pattern of deploying a, smaller, “proxy contract” to save state and interact with the, feature-rich, “implementation contract” while being controlled by the “proxy admin contract”.\n\nFor musicians using Zora Drops or Manifold, you don’t actually own the logic contract. You own a “proxy” that’s interacting with the core [Zora](https://etherscan.io/address/0x478dc357913ec31b5015cbad60c8ddedff6299c1#code) / [Manifold](https://etherscan.io/address/0xe4e4003afe3765aca8149a82fc064c0b125b9e5a#code) implementations. Maybe this is sufficient. However, proxies make me ask questions:\n\n* who controls the “proxy admin” contract?\n* how can the “implementation contract” change over time?\n* what would the gas cost be if I just deployed the base contract myself? without a proxy?\n\nThe alternative to proxies is to just deploy your own, non-upgradeable, copy of the base contract. I don’t know any easy examples of this today. That’s what I’ll be building today. If you know any examples of permissionless NFT factories that deploy a non-upgradeable contract let me know on [Twitter](https://twitter.com/sweetman_eth) or [lens](https://lenster.xyz/u/sweetman.lens).\n\n### Why I choose to lean away from Proxy here.\n\nSimple is best.\n\nI want to build this codebase as simple as possible. If someone wants to take this and add Proxy deployment to save gas. Feel free. This code should be very easy to tweak to leverage the proxy pattern. Myself, I see creating simple, verified, contracts on Polygon, Arbitrum & other L2 scaling ecosystems are the future for the creator economy.\n\n## What we’re building today\n\n* NFT Factory - `createAlbum.`\n* RaibowKit - make web3 fun.\n* indexer (optional) - I don’t think I’ll get here today.\n* Lens Protocol - something I’m thinking more about.\n\n![Rainbowkit](https://images.mirror-media.xyz/publication-images/JvuNGVY1nZGOZUoFzNZfh.png?height=2088&width=3840)\n\n", "timestamp": 1654528809, "digest": "034aMuDrkCijvqVr9IvSk0u1rMyw5ObOW-uAoDKoLfc", "contributor": "0xcfBf34d385EA2d5Eb947063b67eA226dcDA3DC38"}
{"id": "eEr74tKlLa8tq6EAsDpke_ERVVkHAPHo2q1jJFGwco4", "title": "albums as smart contracts", "body": "When musicians mint music NFTs, what type of relationship do they have with their smart contract? (creator: smart contract)\n\n* 1:N - Album\n* 1:1 - Artist\n* N:1 - Platform\n\n### N:1 - Platform\n\n* there is one, shared, smart contract for all music on the platform.\n* upgradeable.\n* example: [Mint Songs](https://mintsongs.com/) ([OpenSea](https://opensea.io/collection/mintsongs)).\n\n![Mint Songs on OpenSea](https://images.mirror-media.xyz/publication-images/AUxrwfNrye6-Vc3mUXzUx.png?height=804&width=1010)\n\n### 1:1 - Artist\n\n* each smart contract represents an artist.\n* multiple projects on one contract.\n* example: [Sound.xyz](https://www.sound.xyz/) ([Iman Europe](https://opensea.io/collection/iman-europe), [Pussy Riot](https://opensea.io/collection/pussy-riot-xxx), [Daniel Allen](https://opensea.io/collection/daniel-allan)).\n\n![Iman Europe has multiple project on sound.xyz](https://images.mirror-media.xyz/publication-images/0sYXOqlHgVMXkLvFnbnvy.png?height=2084&width=3840)\n\n### 1:N - Album\n\n* each smart contract represents an album, EP, or single.\n* pre-defined at contract creation.\n* example: [Zora Drops](https://create.zora.co/create) ([glassface.eth](https://create.zora.co/editions/0x3e7fa0f13125ea8f1f17250bdd0924c974d3e80d)), [Glass.xyz](https://glass.xyz/) ([CharlieCrown.eth](https://glass.xyz/v/BWFBbU0NL87zLe4RjgEE1IO2yvmLH48q7ItSLdK1EfA=)).\n\n![Zora Drops - \"FOUNDATION\" by Glassface 🎵](https://images.mirror-media.xyz/publication-images/V7FEJTAmvo0D6ZMd83Uko.png?height=2088&width=3840)\n\n## NFT Factory\n\nOnboarding the next 1 million web3 musicians requires easy-to-use UI for creators to deploy smart contracts for all 3 options. Free to use, at gas cost. Platforms (option #1) does not need to consider a factory because all NFTs use one, shared, smart contract. Artists / Albums need a permissionless NFT Factory for musicians to create new Album / Artist NFTs. Ethereum must be supported, as well as having networks for experimentation such as Polygon Mainnet, Sepolia testnet,  Goerli testnet & Mumbai testnet.\n\n![sometimes I doodle](https://images.mirror-media.xyz/publication-images/h_MMVz7CTBdwb4G94b0vq.png?height=742&width=2020)\n\n### Deployment Pattern - Proxy vs Standard\n\nTransactions on Ethereum Mainnet are expensive. Deployment of large, feature-rich, smart contracts is expensive. Proxy contracts are less expensive to deploy. “Proxy contracts” are a pattern of deploying a, smaller, “proxy contract” to save state and interact with the, feature-rich, “implementation contract” while being controlled by the “proxy admin contract”.\n\nFor musicians using Zora Drops or Manifold, you don’t actually own the logic contract. You own a “proxy” that’s interacting with the core [Zora](https://etherscan.io/address/0x478dc357913ec31b5015cbad60c8ddedff6299c1#code) / [Manifold](https://etherscan.io/address/0xe4e4003afe3765aca8149a82fc064c0b125b9e5a#code) implementations. Maybe this is sufficient. However, proxies make me ask questions:\n\n* who controls the “proxy admin” contract?\n* how can the “implementation contract” change over time?\n* what would the gas cost be if I just deployed the base contract myself? without a proxy?\n\nThe alternative to proxies is to just deploy your own, non-upgradeable, copy of the base contract. I don’t know any easy examples of this today. That’s what I’ll be building today. If you know any examples of permissionless NFT factories that deploy a non-upgradeable contract let me know on [Twitter](https://twitter.com/sweetman_eth) or [lens](https://lenster.xyz/u/sweetman.lens).\n\n### Why I choose to lean away from Proxy here.\n\nSimple is best.\n\nI want to build this codebase as simple as possible. If someone wants to take this and add Proxy deployment to save gas. Feel free. This code should be very easy to tweak to leverage the proxy pattern. Myself, I see creating simple, verified, contracts on Polygon, Arbitrum & other L2 scaling ecosystems are the future for the creator economy.\n\n## What we’re building today\n\n* NFT Factory - `createAlbum.`\n* RaibowKit - make web3 fun.\n* indexer (optional) - I don’t think I’ll get here today.\n* Lens Protocol - something I’m thinking more about.\n\n![Rainbowkit](https://images.mirror-media.xyz/publication-images/JvuNGVY1nZGOZUoFzNZfh.png?height=2088&width=3840)\n\n", "timestamp": 1654528728, "digest": "034aMuDrkCijvqVr9IvSk0u1rMyw5ObOW-uAoDKoLfc", "contributor": "0xcfBf34d385EA2d5Eb947063b67eA226dcDA3DC38"}
{"id": "_eouuKCKFI10Xp6AX725dCp-O95SXkFuk96FK9KCNU0", "title": "ERA7游戏分享+代币价值深入探讨(AMA.29)", "body": "# GMA游戏联盟第29期AMA|ERA7要点整理\n\n# 一 活动信息\n\n**【活动信息】**\nTopic：《Era7｜Everything you need to know about this game\nGuest：罡哥（ATTM公会CEO） William（ATTM公会CMO）\n\n# 二 分享内容-罡哥、William\n\n（Era7游戏内容，亮点，策略等）\n\n我们游戏公会是从AXIE爆火后开始做奖学金计划，在去年很多游戏不管是AXIE,飞船都会遇到死亡螺旋，玩家失去了信心，导致币价下跌。我觉得如果去年是Gamefi1.0的话，今年应该Gamefi2.0。\n\n所以我觉得接下来的游戏会开始做所谓的电竞，会把挖提卖，或者赚钱这件事情focus在高手玩家，但是新玩家也有机会进来争取世界第一或者前10%，也有机会赚到钱。\n\n当初我们在官方接洽的时候是透过币安帮我们引荐的。那个时候我协助他们推广，和项目方直接沟通的时候项目方一直反复强调，想要做走长线的游戏，之后在电竞方面想要很深入地去发展。\n\n来介绍下Era7，卡牌一共共有七个种族，每个种族有四个稀有度，稀有度会影响到卡牌的实力。我是比较建议从稀有入场，所以入场成本可能大概在150busd，假如想要冲排行榜，赚取更高额的奖金，那比较适合史诗卡牌。另外卡牌有power值，指的是可以召唤多少张卡，那如果想要增加召唤次数就会需要去消耗实用代币GOT。\n\n![](https://images.mirror-media.xyz/publication-images/QWtPplREgnfj_d2AVNXfy.png?height=942&width=1350)\n\n## 我觉得Era7的几个亮点：\n\n首先美术风格我自己觉得不错的，当然美术风格见仁见智，我自己蛮喜欢这样的风格；\n\n项目方更新比较积极，执行效率不错，游戏刚开始只有英文版本，然后我们跟官方聊对于华人区的玩家不是很友善，他们收到这个消息一个礼拜以后，就有中文了；\n\n第三是卡牌的深度很够。如果你要建立新的卡组，需要放30张卡片，就会导致有很多策略性。因为我自己以前也有玩炉石打上传说过，在大概五六年前，所以我认为游戏的策略性实并不输当时的炉石，不敢说和现在的炉石比，era7一定还有很多进步空间，但我认为卡牌的配合深度是蛮充足的。\n\n## 游戏玩法介绍：\n\n这个游戏它是一个九宫格的站位，一开始给四张牌，可以替换费高的卡牌，如果看到卡牌费不够，可以charge丢弃一张卡换到多一点费。那这回合费值就会到3。在上路中路下路摆放我的卡牌，当同一排对面没有任何卡的时候，就会直接去攻击对方，当对方玩家生命值归零的话，这场对决就胜利了。\n\n![](https://images.mirror-media.xyz/publication-images/4DBQ8q27supB7ZW-AmFvj.png?height=705&width=1350)\n\n这个游戏逻辑是以上的内容，其中还会涉及到卡牌的搭配，我的卡牌比较倾向于打快攻，我就加强自己的攻击力，一直去打他的脸。\n\nPlay to earn的奖励在Ranking这里，如果赢一场大概获得2个got，另外如果打到排行榜，还有周奖励和赛季奖励。\n\n![](https://images.mirror-media.xyz/publication-images/llAreBrp7SoyeTHPBA2lt.png?height=714&width=1350)\n\n那玩家是不是氪金越强花很多钱就有可能第一名或者是前三名，这个游戏它比较特殊的地方，就是说他的卡牌呢，调配不错。比如一个大佬花了10万块去建构牌组达到了第一，也有可能只花了4万块达到了前3，我们群里有一个前排玩家上一季也是第一名，整个牌子只花了2万块人民币，所以这个游戏并不是很多钱就会特别强，如果牌组搭配的不好也不一定能够赢，像上次看到算力3600分的跟我打，也输给我。这代表说他的牌组配置有问题，我的配置比较好或者运气比较好，这些在这个游戏上面都是有可能的。\n\n另外卡牌还可以自动挖矿，比如我的算力是13000，每一天大概拿到20个左右代币，这部分的收益比较少，大部分收益还是玩游戏，拼到比较高的报酬。\n\n![](https://images.mirror-media.xyz/publication-images/ZOMj8N4KehnuZ-XBHDQ8L.png?height=698&width=1350)\n\n## 代币的消耗\n\n目前游戏的代币是💲GOT和💲ERA（治理代币）\n\n💲GOT代币消耗：之前提到的卡牌召唤；另外是卡牌合成，每张battle card卡片会有四个level，如果要把卡升到level4，要消耗💲GOT，还有8张卡牌，这个消耗就很大。那因为这是传说卡消耗的就会更多，假如这个是史诗卡，它消耗的代币就会比传说卡的小。\n\n## 投资策略\n\n目前投资游戏的策略我们会购买一部分的治理代币，另外我们会把大部分的钱在打排行榜上。我们之前算过，大约1.5-2个月回本。但我们奖学金模式不会像去年做AXIE infinity一样，当时找了非常多菲律宾玩家大概四五百人，做一样的事情，用一样的队伍；在这款游戏上会挑选比较好的玩家，我们上一周和这一周也举办比赛，认识了非常多高手玩家，邀请他们来公会参与奖学金，我们出钱再分润给他，如果玩家非常会玩，就可以打到比较高额的报酬。\n\n这是我们目前认为游戏的一些亮点，还有目前我们公会做的一些投资策略。\n\n## 对于后续电竞方面的看法\n\n回想一下英雄联盟，我大一时台湾有一个英雄联盟的队伍叫台北暗杀星，那时候我在宿舍看台北暗杀星打败韩国队伍，拿到冠军，一个电竞队伍可以到世界舞台，对我来说很感动。我自己觉得电竞这几年发展不像前几年那么兴盛，可能和整个商业、产业有蛮大关系。因为它是非常庞大的组织，如果要办一个比赛，要花费非常多金钱。一个游戏公司要组织战队，要招揽选手，还要养选手，可能一年要几百万几千万美金。游戏选手如果拿到了大赛奖金，要先从游戏公司开始分，还有一些行销，可能100万的奖金只分到20万，相信这是很多电竞选手会遇到的问题。\n\n我觉得WEB3的电竞比较去中心化，比如我在台湾在一个很小的城市，英雄联盟打得再好，没有人会关注到，也没有人给我所谓的电竞奖金。但在WEB3的机会可能崭露头脚，更甚至我可以靠打游戏过活，我可以玩很多游戏，在上面打排行榜可以赚钱。我们在ATTM在上个月也举报era7比赛，报名人数150，实际比赛人数有大约80个。对我们来说举办比赛是一个蛮大的挑战，基本上都是自愿的玩家志愿者来帮忙。\n\n我们也和官方联系，他们确实会在电竞或者说竞技这一块琢磨，后面开发自己的赛事平台。因为我们这次比赛有一个游戏里面的酒馆可以对战，后面官方也会出自己的赛事，至于怎么让玩家在上面比赛可以等官方发布消息。\n\n去年的游戏公会倾向于不管是YGG或者GGG游戏大公会，在Axie爆火时候进行一些募资，我看他们简报基本上都在讲他们的scholar有多少人，比如说YGG好像有4万多名玩p2e，但是我觉得今年可能不是人数谁多谁厉害，游戏公会更专业化、精准化一点会有更多一些机会。今年大部分复制化的挖提卖游戏很容易被淘汰掉，就像AXIE，还有最近的stepn太容易被复制了，就是我天是一个不太走路的人和很会走路的人，我们如果买的鞋子是一样的，我们赚到的钱是一样的，我认为gamefi脱离这样能够复制的模式，才能让真正的玩家去赚到这些钱。\n\n但我认为在WEB3的世界确实还非常早期，我不敢说未来怎么样，很多游戏还没有办法对自己的token有很大的共识度，资产还不够去中心化。像猴子是非常去中心化的资产，大部分链游现在也是相当中心化的。那如果能办电竞，引入外部的更大更多的资金去举办实体的电竞比赛，跟实体去结合，才有可能有更大的发展，如果单纯纯走虚拟的，可能硬核度不是很够。\n\n# 三 自由讨论-GMA社区玩家\n\n**（培才总）**\n\n我在想一个困扰我很久的问题，链游怎么样才能成功？因为我们投资链游最核心的就是怎么样找到有价值的链游。今天听了一个播客，里面提了一个观点还挺有启发。传统应用和WEB3D应用的核心区别是什么？想要成功一定要迎合某种价值主张或者达成用户的某种需求。那**链游和传统游戏相比到底迎合了用户的哪些价值主张？换句话说，用户哪些需求是在传统游戏没有被满足的？**\n\n从这个角度来考虑非常有价值的，很多人会把元宇宙也从两个角度里去理解，一部分希望元宇宙给身临其境的体验，在区块链里就叫可玩性派，希望链游有足够的可玩性。还有一派会把元宇宙理解为加密资产派，不仅仅是画面也希望里面像真实的世界有真实价值，主价值的的资产，有一些智能合约。回到链游可能也要从这两个角度，**链游能不能提供有价值的资产，第二个能不能提供有价值的信息。**\n\n那么所谓的信息就是指可玩性，传统游戏里面或者前面两位嘉宾介绍卡牌游戏的可玩性，画风，美术。但是在WEB3应用里面用户的优先级比较高的是资产其次是信息。这可能有点儿对应比特币，没什么可玩性但提供了非常有价值的资产，比特币可以把它理解为第一个web3应用，或者第一个区块链游戏，但基本上没什么可玩性。以太访我觉得在比特的基础上强化了可玩性，但是资产性要稍微弱一点，他牺牲了去中心化的程度，牺牲了一些资产的安全性。gamefi我觉得是在以太坊基础上更一轮的升级，他们发展的顺序，也是先有btc后有eth，然后才有区块链游戏。区块链游戏里面也不能脱离资产，虽然资产肯定没有比特币这么硬，但是也不能像传统游戏里的金币那么软。\n\n如果一个好的区块链游戏，能不能提供一些比较硬的资产？拿era7为例，里面最硬的资产是token，\\*\\*那token的硬度、价值来源是值得我们思考的问题。\\*\\*我们前面玩过很多资产硬度上做的不好，股权代币分发的方式说改就改，分发过程也非常不公平，项目方甚至全一级的投资者机构拿了大量廉价筹码，导致大家慢慢对项目丧失了信心，也就慢慢倒闭了。另外资产的价值也来自可玩性，就像以太坊有一定的功能性，但功能性和安全性是强相关的，以太坊的核心价值是上面长出了各种各样的应用和其他资产，在用以太坊体系的时候就自动要消耗gas，这部分系统的收入分发给了以太坊持有者。\n\n另外猴子也在讲元宇宙或者游戏的概念，他的做法非常聪明，虽然还没有任何游戏性，但已经创造了非常庞大的资产：无聊猿+变异猿+土地+ape coin资产的总规模已经有几百亿美金了。而且猴的fpf价值是可以脱离游戏存在的，没有游戏也会把它拿来做头像，也就是说游戏有了一部分共识的赋能。这个也是非常棒的做法，也是很多区块链的游戏应该学习的地方，能不能有一部分资产可以脱离体系存在，era7的token现在离不开游戏，如果游戏如果比如说项目上不开发了，没人玩了，那相信这个资产会归零，但是猴子可能就游戏有没有成功会影响头像的价值，但是头像本身就已经很有价值，甚至没有游戏依然还有价值，这是很厉害的。\n\n刚好在链游底层逻辑上的一些思考，趁这个机会给大家分享，希望收到大家的反馈，era7持有代币的价值在哪？\n\n**（罡哥）**\n\n目前代币的问题不论是got和era都通过生成卡，合成卡去做消耗。前几个礼拜成立了dao，就是持有多少era可以参加投票。炉石官方自己有评估的卡牌太强或太弱，官方可能就会在下一个赛季去削弱或加强。era有做一个dao，质押后获得ve，这些票可以用来投票做更动，不管是加强还是削弱让大家来决定。我觉得这个可能在传统游戏是没办法看到的，也是蛮特别的部分。\n\n我们公会其实有接触到不同的游戏，目前我们认为比较好玩的游戏偏卡牌，也归根于开发区块链游戏的厂商可能大部分还不够给力，没有真正的MMORPG游戏出来，那我们也有接触到其他的游戏，然后目前来说确实是培才总刚才说的token都focus在游戏应用里，目前确实比较少用途。\n\n`（培才总）`\n\n我觉得这个挺有意思，刚才想了想一般链游里面资产的种类分为：token和NFT。\n\n赋能主要是游戏内和游戏外赋能，但是很多链游游戏外的赋能是不够的，如果游戏性又不好，很多链游就衰亡了。游戏本身没可玩性，代币的价值就主要是来自于游戏内，就形成了恶性循环。\n\n**1）游戏外的赋能方式：**\n\n什么是资产的游戏外的赋能呢？以token为例，**defi是一个比较好的游戏外赋能的方式**，它有点像btc的挖矿，代币的获取是有成本的，要么提供流动性承担了无常损失，要么拿其他交易对去换代币，至少是有成本的，前阵子ama时候说tiny砍了一池其实未必是个好事。我觉得链游在这么早期的阶段，游戏性不能很好给代币赋能的时候，采用游戏外的赋能也蛮有价值的。\n\n还有一个是通过社交媒体给NFT资产赋能。比较好的例子就是猴子，通过把NFT资产在社交媒体上炒热，也会形成一部分的共识价值。这部分共识价值虽然还不知道是不是有泡沫，但确实是一个方式，来给资产做游戏外的赋能。\n\n广告也是一个点，和刚才嘉宾说的电子竞技一样，电竞某种程度上有一定广告价值，不仅电竞，所有的体育比赛都是这样，体育比赛从来不是让参赛队伍出钱的，而是卖转播权收广告费，然后把收到的钱分一部分给电竞选手。但我觉得电竞和IP这个会不会早期不太好走，至少电竞你得有一定的影响力，广告商才愿意付费，IP可能会稍微容易些，猴子算是一个特例吧。\n\n**2）游戏内的赋能方式：**\n\n比较常见是通过榜单的模式，还有在新人的进入、在游戏的收入环节，把一部分利润烧掉或者放到社区金库里面，或者回购代币项目。可能游戏内赋能就是几种方式吧，有一些真金白银的收入，直接分红或者是销毁，或者买了token质押在那儿，就直接通过合约的形式分红给大家，mobox主要是通过销毁的形式，会在交易市场收到的手续费去销毁；另外鼓励大家锁流动性，锁一定期限，就给更多的奖励。\n\n（Adam）\n\n因为我本身也是era7游戏玩家，对卡牌稍微了解。我认为对于WEB3游戏web2的区别在于：WEB3最初期就要把自己想象成一个经济体。经济体像国家一样需要人口支撑，就是新的流量进来，新的流量会带着钱去购买NFT资产，然后通过一些操作得到了游戏代币，代币带来经济效应可能又吸引了一部分新的用户进来。\n\n这里我觉得就分成两个线：资产派和信息派。信息派其实更偏web2，互联网是打破信息壁垒，web3主要是做了资产所属权的固定。那在这个游戏里，我认为主要是把自己的经济体做大，从另外一个角度来讲，游戏本身的世界观如果足够大，做游戏内资产发行的多样性就会比较多，营销的手段就会比较多。这也是前面提到像用社交媒体去做一些不同类型NFT资产发行，用户投钱进来之后想办法把形成文化共识固定在这儿。第二种就是在token的应用层面上，除了前面提到的defi挂钩相关的，跟本身游戏奖励相关的，还有era7后面的七大种族、涉及到nft地皮，资产增值的方式。其他新的玩法也可能会涉及到，比如说类似发展成BNB的类似于平台币的感觉。然后罡哥提到如果做线下的电竞赛事，游戏代币本身也可以配合NFT资产作为赛事的门槛，或者所谓参赛的条件、观赏的条件。\n\n另外我也想讨论的是gamefi从最开始的页游，慢慢有一些制作精良的游戏，到后面的3a大作。像TCP卡牌类游戏有点类似于轻竞技，一局3分钟，但是长流非常好留存率很好，对设备的要求很低。现在很多大的公司都在冲3a，也要考虑到对设备的要求会不会导致我们想转化的流量根本进不来，这是关于流量层面的一个点。在流量对接层面上，公会的账户NFT租赁体系在游戏是很重要的，因为web3用户进来时候就是投资人+用户，玩着玩着产生分歧，要么觉得游戏不好玩儿抛币走人，要么觉得游戏可能会火持续投入，但持续投入到一定程度之后，会觉得在游戏赚钱和投钱差距太大就变成了投资人，那他游戏活跃度就下降。所以这时候NFT可能租赁体系，就会相对而言就会降低进来的门槛，让投资人更专注做NFT的流动性，做投资，打游戏的专注于打游戏。\n\n**（培才总）**\n\n我也认可，目前我觉得有一个发展路径的问题是资产和信息是相互促成的循环，要么是正反馈，要么是负反馈。像3a的游戏有一个问题：信息性能不能给资产赋能，如果游戏品质很好，又有非常好的机制给游戏内的资产赋能，确实会比较好。比如原来传统游戏能不能直接通过链改，目前只能看到一个实例就是传奇4的可玩性是不错的，也是对得起3a的名号，我觉得传奇4的问题是没有很好给游戏内的资产赋能。\n\n还没有用到区块链技术，比如CSGO和梦幻西游，里面确实是有一些有价值的资产的，那这部分资产的价值可能来自于通过信息性赋能资产性的一个终局，里面有一些皮肤是很贵的，因为开箱子机制，或者有几十万的玩家，就造成虽然没有运用区块链基础也没有token，但是里面的资产也可以炒的很贵。可以用信息游戏性来给游戏内的资产赋能。\n\n我不知道现在区块链游戏能不能直接走到这一步，因为这两个游戏也是通过早期的积累，这条路恐怕不太好走，游戏内的资产的价值来源全是来自于游戏或者信息性的话，其实还是挺难的。\n\n**（唐旻）**\n\n其实要赋能非常简单，我以前做过端游的，**在我看来WEB3游戏和WEB2的游戏其实本质上核心的东西就是经济系统**。大部分游戏在开服的时候的代币是价值最高的，随着游戏逐步进展，金币源源不断生产出来，金币必然是贬值的。达到一定程度以后会维持在相对稳定的状态，但是长久以来肯定是缓慢下跌的。 端游里面很考验的经济系统和现在WEB3的一样，因为WEB3所有代币都是慢慢产出，必然会缓慢下跌，而且不像端游可以通过新服来操作，代币算是价值初始化，就像那重启web3没法做到这样的机制代币体系必然会缓慢下降，因为总量一定在增加，除非有不停的新用户增量进来，但是新用户迟早也会有瓶颈。\n\nWEB3比web2的优势是没有游戏厂商在抽血。以前免费游戏的金币是承受双重抽血的：一个是缓慢蒸发，还有一个是游戏厂商拿到了大头。如果游戏厂商把拿走的钱还回到游戏里，做一个更好的不通胀的经济体系，在以前的端游时代应该是可以做到的。\n\n我觉得WEB3以后是把游戏厂商在以前免费玩时，卖免费道具这中代币赋能的形式回馈到游戏。比如说游戏厂商来卖免费道具的，比如说像炉石是游戏厂商来卖，抽掉很大一部分，我如实适用我炉石里面的代币来开卡，那等于是把暴雪的收益全部注回到游戏。我觉得这是游戏里面最强大的赋能形式，其他的赋能都免不了庞氏的结局。我觉得WEB3的模式就是游戏厂商不再从游戏里面吸血，大家都能从里面去获利。\n\n回到这款游戏era7，比如要我来设计给他赋能，像欢乐豆是纯产出的，但欢乐豆是有价值的，就是在游戏中消耗，比如era7的游戏设计房间，代币要像欢乐豆那样带进去的，那它的消耗就滚起来了，然后游戏代币一部分给持有者，一部分给厂商，让它源源不断的消耗，代币还是要回归到游戏里面。以前端游时代本来确实是有价值的，但是它本来应该承受的价值很大一部分被游戏厂商拿走了。它里面的经济体系很容易崩盘。WEB3阶段的游戏厂商刚开始NFT发售会拿走一部分，但游戏厂商应该把这部分回归游戏，让游戏代币来承受免费道具的发放，形成一个循环。\n\n**备注：GMA的内容只做参考，不构成投资建议，投资需谨慎，大家量力而行，谢谢。**\n\n\n---\n\n# 关于GMA：\n\n**GMA游戏联盟是定位于gamefi领域的一个DAO组织。参与者主要是对gamefi赛道感兴趣，有投资实力, 投研能力，且愿意分享的机构和个人。我们会不定期分享有参考价值的链游领域生态报告，项目报告、投资实例、投资策略、游戏测评。**\n\nGMA的社交媒体平台：\n\n☆Youtube:<https://www.youtube.com/channel/UCI8VzM4ywAYR83epyoReydQ>\n\n☆twitter:<https://twitter.com/G_M_Alliance>\n\n☆discord: \n\n[https://discord.com/invite/bJ2JFsftSk](https://discord.com/invite/bJ2JFsftSk)\n\n", "timestamp": 1654529225, "digest": "JwNRJLdGiFHR8P_P5zYg9lV2BuF9LX8BUE4ZUVvqm-0", "contributor": "0xB038fbCCDa6d22c4D55cf4a5Fd72998EF77ed078"}
{"id": "ePyjRSvrkw3CgR7uQ1TrdENi18xkqYJObKthgeEgbk0", "title": "NFT 交易平台：蓝海 or 红海市场？", "body": "## Key Takeaway\n\n* 蓝海市场是一种新兴市场，利润率高，不存在恶性竞争；而红海市场是已知且竞争激烈的市场，有着较高的壁垒和严格的行业竞争规则。\n* 在大小形态各异的市场间，有些市场能够为交易双方带来创新价值，有些市场只是单纯复刻其他市场的创收模式。\n* 一些使用 Token 的平台通过激励设计为用户提供新价值，如 LooksRare，Magic Eden。\n* 2022年5月16日，Magic Eden 每日交易量为 4722 万美元，而 OpenSea 的交易量为 3288 万美元，ME日活跃用户数量也已有超越 OS 的趋势。\n* 随着OpenSea添加对SOL的支持，跨链和全链 NFT 市场或许是未来趋势之一。根据 Magic Eden 的数据，OpenSea 上的 Solana NFT 销售额约为 Magic Eden 推出以来的 9%。\n* 在NFT二级市场和衍生交易成熟下，NFT 交易市场需要重新思考 NFT 指数交易，碎片化交易和衍生交易的方式和用户体验。\n\n蓝海战略（Blue Ocean Strategy）这一概念最早由金伟灿（W. Chan Kim）和勒妮·莫博涅（Renée Mauborgne）共同提出，指的是企业主动开拓新兴且尚无竞争的市场。该战略不着眼于细分市场、满足用户偏好，而是通过改变产业，重设游戏规则，合并细分市场、整合需求达到价值创新 。而红海（Red Ocean）则相反，市场中人人都是竞争对手，市场之间有着森严的壁垒。\n\n早期NFT市场是一种蓝海市场。随着NFT交易平台OpenSea的上线，NFT市场如雨后春笋一般迅速发展壮大。起初，OpenSea在整个NFT交易领域并不存在任何竞争者，但随着SuperRare和Nifty Gateway等新交易平台入场，竞争的序幕正式拉开。\n\n过去几个月中，X2Y2、LooksRare和Coinbase NFT等新交易平台不断涌现，二级市场逐渐呈现饱和态势，这也就是我们上文中提到的——红海：市场拥挤，增长动力缺乏，利润率持续走低，最终走向白热化竞争。换句话说，红海意味着项目方间的利益抢夺之战。狼多肉少，所以推动创新和找准市场定位，将会是取胜的关键。\n\n## 市场价值\n\n随着新兴竞争者进入市场，很多项目方开始谋求价值创新，追寻开源节流的发展模式。现有市场之间界限分明，用户需要哪种服务，哪种类型的市场便应运而生。打个比方，一些投资者更偏好独具艺术性的小众NFT和1/1艺术类作品，Foundation或Nifty Gateway这样出售独特NFT作品的交易市场就满足了这部分用户的需求。\n\n![价值创新模型（Value Innovation Model）；数据来源：NFTGo.io，蓝海战略](https://images.mirror-media.xyz/publication-images/7gMNvlRvtpML2Euj-XU9V.jpg?height=1080&width=1920)\n\n尽管已有大量提供NFT交易服务的平台，项目方们仍在追求给用户带来新的交互体验。最近新上线的Coinbase NFT就是其中一个例子，该平台在原有交易网站的基础上新增了社交功能，方便用户在NFT界面内留言，分享NFT投资方面的经验。\n\n通过Pioneer Migrator Map，我们可以轻易分辨出，哪些网站是在为用户创造价值、提升用户使用体验，哪些网站可能只是在复刻原有的运营模式。\n\n![Pioneer Migrator Map；数据来源：NFTGo.io，蓝海战略](https://images.mirror-media.xyz/publication-images/ZrbHEsxLN4sx3P14EwPNP.jpg?height=1080&width=1920)\n\n提供NFT交易服务的平台有很多，但这些平台的整体运营战略是趋同的。我们可以通过市场价值评估图（Market Evaluation）来衡量不同平台的核心竞争力，下图y轴表示了各平台在不同竞争力因素上的表现，除了图上显示的几个指标外，我们还新增了“成本结构”、“多链聚合”、“复杂性操作”几个指标，y轴上的得分越高，该平台为交易双方带来的价值就越多，反之，得分越少，其创造的价值也就越少。\n\n![市场价值评估图；数据来源：NFTGo.io，蓝海战略](https://images.mirror-media.xyz/publication-images/OgI13zPxFd1m-BFktQNWa.jpg?height=1080&width=1920)\n\n尽管用户在不同平台之间享受的服务是类似的，但在所有NFT交易平台中，OpenSea仍是当之无愧的头部项目。随着越来越多交易平台的推出，可以预见的是，未来几年内的市场价值评估图上的数据折线势必会愈发密集。如今从NFT交易中创造新价值，也将会成为平台开发者需要思考的问题。\n\n## **谁才是领头羊？**\n\n能否创造价值，是交易平台在长期竞争中胜出的关键因素。市场总销售额（Marketplaces Total Sales）与市场价值评估图是衡量价值的关键指标，平台为用户提供的价值越多，通过该平台达成的交易额也就越多。在下图中，我们可以看到5个顶级交易平台的销售总额数据（LooksRare的数据统计去除了“清洗交易”和“最高销售额”）。\n\n![市场总销售额；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/MBpQIYNy_yJQY9zJnk5sJ.jpg?height=1080&width=1920)\n\nLooksRare上线后，得益于其为用户带来的新价值，迅速占据了不小的市场份额，发展成为以太坊第二大NFT交易平台。\n\n![市场份额占有率（Market Dominance）；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/6EYJkjlEslVzxXGmrzpmH.jpg?height=1080&width=1920)\n\n抛开OpenSea这个庞然大物不谈，我们不难发现，由于Rarible、Foundation和SuperRare这三家交易平台为用户提供的服务较为相似，平台间的竞争也较为激烈。\n\n![市场总销售额（除OpenSea）；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/VHOtJfHKIT3IlXeCJNVeh.jpg?height=1080&width=1920)\n\nLooksrare给用户带来了新的产品价值，是除OpenSea以外四个交易平台中市场份额占有率最高的交易平台。\n\n![市场份额占有率（除OpenSea）；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/ciA8DoZrjgvUTI5WwHBcL.jpg?height=1080&width=1920)\n\n![交易手续费（Looksrare为2%，OpeSea为2.5%，X2Y2为0.5%）；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/k0ywx0pjmeex7Mv_oEOxF.jpg?height=419&width=1080)\n\n**Token 驱动的市场模型**\n\n近日，Solana 的NFT交易市场将发行自己的Ticket。在某种程度上，Token为平台和交易者提供了共同成长的可能性。OpenSea通过高昂的手续费和服务费获得了可观的收入，但是并没有将收益反哺给用户。值得注意的是，Magic Eden 日活跃用户数量也已有超越 OpenSea 趋势。\n\nLooksRare和Rarible这两个平台也通过发行Token（$LOOKS和$RARI），将平台与用户实现一定程度的利益绑定。例如，用户可以通过质押$LOOKS的方式获得手续费的分成，质押得越多、平台交易越活跃，用户所能得到的奖励（WETH）越多。Token 的引入让用户和平台可以实现共同成长，在社区至上的Web3时代，相比于单方面让用户作为消费者，如何将用户利益融入到平台也是各大NFT市场需要考虑的问题。\n\n## **Yuga Labs：下一个交易平台？**\n\n想象一下排除以下6个Collection后的NFT交易市场：\n\n* Bored Ape Kennel Club\n* Bored Ape Yacht Club\n* Mutant Ape Yacht Club\n* Otherdeed\n* CryptoPunks\n* Meebits\n\nYuga Labs 的野心不局限于 MetaRGP 游戏和PFP，作为 NFT 市场的头部竞争者，其发行的各大项目已经广泛赢得了公众的信任与支持。更重要的是，这些项目也实现了交易数量与交易价值的长期增长。发售$APE代币是Yuga Labs成功的关键一步。目前，Yuga Labs总市值为40.3亿美元，相比于LooksRare价值4.41亿美元的市值。Yuga Labs的潜在市场规模可能在所有以太坊交易平台中位居第二。\n\n![全时段市值（All Time Market Cap）；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/_u32IP_ZU02ww9cmN9e-E.jpg?height=1080&width=1920)\n\n全时段交易额（All Time Volume）计算了各Collection自发售以来实现的以美元作为货币单位的交易总额。\n\n![全时段交易额；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/-CNu-EtqDdZEhRkvJ_Ssd.jpg?height=1080&width=1920)\n\n从交易市场统计图（Top Marketplaces）中，我们可以看出，虽然Yuga Labs开发刚满一年，一旦上市，相对于其他交易平台来说，也绝对是一名强有力的竞争者。\n\n![NFT市场排行图；数据来源：NFTGo.io](https://images.mirror-media.xyz/publication-images/RpRmpCo35HIcihZNx3Mw_.jpg?height=456&width=1080)\n\n经过上文的数据分析，我们不难看出，Yuga Labs通过抓住 NFT 市场中的头部流量，并通过空投，白名单等增长模式，已为NFT持有者带来不菲的收益，以“从下向上”的模式赋能未来产品模式。\n\n## **结语**\n\n当前市场交易人数金额和整体流动性下降，市场的不稳定性促使人们转向投资更稳定的偏蓝筹NFT资产。以太坊由于头部项目明显，单笔交易额稳居第一，但其他链上的NFT市场有着小额多量的交易趋势，多链市场可以在蓝筹主导的市场下带来更多新的流动性，推动创新和增长。\n\n此外，平台也需要更具原创性的活动来吸引用户。比如新上线的市场Blur在营销策略制定方面取得了一些成效，该平台为早期投资人创立了一种优待模式，同时，为了推广即将上线的测试版，Blur还允许每位OG邀请5位好友共同体验平台测试版，使用测试版就能获得积分，用于兑换平台内的实用工具。Blur营销策略的成功之处就在于将用户转化为平台代言人，让他们为平台发声，吸引其他NFT投资者。\n\n红海厮杀的受益者，永远是用户。但在红海竞争中，NFT交易平台之间的界限也变得越来越清晰，Web3平台的交易模式也会在潜移默化中改变。流量，话语权以及社区，也将会是 NFT 交易市场需要持续关注的命题。\n\n*注释：本文仅供研究使用。投资数字资产（如NFT和数字资产）会有风险，在做出任何投资决定前，请务必咨询财务顾问。NFTGo不提供投资建议，不对任何因投资数字资产造成的损失负责。*", "timestamp": 1654529058, "digest": "AzoUZ4i3P1T77LJphJFxqQKLCcnaoGNn-nO1ufqAQ2E", "contributor": "0xFE0dfc1662E5836F49ad5686A93525efB37Ef818"}
{"id": "gneUuAjrWBuyl_I_fMNjY3MIisRwuJLRG7roHFxDXGU", "title": "Community-run employer database - it is our moral duty!", "body": "In the last few years, we’ve experienced increasing instability due to several factors that I’m sure the reader does not need to be reminded of. No matter how many times the boom and bust cycle happens, we never seem to learn to put the responsibility on the right people.\n\nWhile there is a lot to say about it generally, I’m here to talk about employers and their responsibility to their existing and future workers. I’ve been increasingly frustrated to see employers cede this responsibility in the most cynical and sinister forms. \n\nSpare me the regular:\n\n1. “This is the way business is, this is what we signed up for when adopting a capitalistic system“ - This might be true, but this is also a classic misdirection tactic. While capitalism discusses profit maximization, it by no means discusses society condoning irresponsible and egregious corporate behavior. \n2. “Cancelling offers is completely legal in most states“ - This is of course true, but this is the problem. We need mechanisms to penalize bad actors that take advantage of the legal system to protect their irresponsible behavior. We should also elevate and profit actors that behave responsibly and do not condone short-term thinking and blame-shifting.\n3. “The market will take care of it, it’s bad business” - Ten years ago I would have said the same, but after repeatedly seeing this is not true. Bad press coverage can be surpassed and people have short memories.\n\n## Why does this matter?\n\nTech-workers are a generally incredibly lucky group of people. Their skills are in extremely high demand and they are compensated generously for their work. Their benefits and conditions are unparalleled to other professions. \n\nThis creates a common set of misconceptions that we see refuted over and over when things turn in the economy:\n\n1. “You have nothing to worry about since your skills are in demand” - While this might be true, it doesn’t negate the incredibly high mental cost of being laid off or having your offer rescinded. Furthermore, in bad markets, it might not necessarily be easy to find a comparable job (not just money-wise, a lot of things go into job satisfaction). \n2. “This is a two-way street, you can also leave your job at any time“ - While this is technically true, it is incredibly misleading. Leaving your job doesn’t result in the corporation losing its livelihood, health insurance for you and your family, your visa (and sometimes results in you being forced out of your home), and dignity. \n3. “Corporations are required by law to maximize profits” - This is of course true, but this is the point. Shareholders don’t have to worry about mass layoffs or generally terrible corporate behavior because the company doesn’t pay a price for it. There needs to be a reputation tax to offset this.\n4. What if the corporations must lay off their workers to save themselves, should they be penalized too? When interviewing for a job, workers routinely are asked to provide background information, pass tests, and convince future colleagues and bosses that they are trustworthy. Why shouldn’t corporations have to go through the same set of hoops? If you had a justified business case for doing what you did, make it to the prospective candidates. If they request further assurances before taking the job, this is the price you have to pay (which I can guarantee you is less than the price the people you laid off had to pay). \n\n## Community-owned reputations database\n\nThe next step is always to create a centralized solution, à la glassdoor, blind, LinkedIn, level.fyi, you name it. This always follows a similar pattern:\n\n1. Mission statement and excitement - centralized service announces they are going to disrupt the market and would never be bought by foreign interests.\n2. Database and community grows - For a while, centralized service acts responsibly and advocates for workers’ rights. \n3. Centralized service is looking to monetize - Generally speaking, providing an honest and impartial platform is pretty bad business. You have all the costs associated with running the service without real monetization options. \n4. Centralized service gets acquired or sells off - Here the owners realize two things: They have valuable data. They can manipulate rankings and surpass information for a price.\n5. Repeat\n\n**The only sustainable approach is to have a worker-owned and managed database that isn’t for sale.** \n\n## What’s next?\n\nI don’t have all the answers to what comes next, but I know that something needs to be done and this is the time to do it. People never rally around these causes in good times because there doesn’t seem to be a need. Imagine the pain of your friends and countrymen that had to endure one or multiple layoffs in recent years. Imagine the pain of people that came to your country to better themselves and their children’s future to be disposed of once they weren’t needed anymore. \n\nI know one project can’t fix everything, but this is a step in the right direction. Bitcoin has changed the way we think about money, and Ethereum has changed the way we envision the web, this is the time to start using it for good.\n\nI’m writing this piece with the backdrop of the horrific shooting in Texas that took the life of 21 innocent children. I’m seeing the lack of care for human life that is shown for the sake of “freedom”.  People should have the freedom the conduct business, but they should do so with dignity and care for the other, we must keep building to ensure it happens.\n\n[crowdfund://0xCA67AA71eE852e539326625ad9D0e273Ab22d155?features=](crowdfund://0xCA67AA71eE852e539326625ad9D0e273Ab22d155?features=)\n\n \n\n[crowdfund://undefined?features=overview,backers](crowdfund://undefined?features=overview,backers)\n\n", "timestamp": 1654529266, "digest": "QODuEakkJ2LjojFgPCDWAy93kxjYVfENdJ-Wo6ve4Xk", "contributor": "0xCA67AA71eE852e539326625ad9D0e273Ab22d155"}
{"id": "hwVfO3N7m8yzYwy_ipyk_yXSP-kv4eBuOJfNY5DIiFo", "title": "ER7游戏分享+代币价值深入探讨(AMA.29)", "body": "# GMA游戏联盟第29期AMA|ERA7要点整理\n\n# 一 活动信息\n\n**【活动信息】**\nTopic：《Era7｜Everything you need to know about this game\nGuest：罡哥（ATTM公会CEO） William（ATTM公会CMO）\n\n# 二 分享内容-罡哥、William\n\n（Era7游戏内容，亮点，策略等）\n\n我们游戏公会是从AXIE爆火后开始做奖学金计划，在去年很多游戏不管是AXIE,飞船都会遇到死亡螺旋，玩家失去了信心，导致币价下跌。我觉得如果去年是Gamefi1.0的话，今年应该Gamefi2.0。\n\n所以我觉得接下来的游戏会开始做所谓的电竞，会把挖提卖，或者赚钱这件事情focus在高手玩家，但是新玩家也有机会进来争取世界第一或者前10%，也有机会赚到钱。\n\n当初我们在官方接洽的时候是透过币安帮我们引荐的。那个时候我协助他们推广，和项目方直接沟通的时候项目方一直反复强调，想要做走长线的游戏，之后在电竞方面想要很深入地去发展。\n\n来介绍下Era7，卡牌一共共有七个种族，每个种族有四个稀有度，稀有度会影响到卡牌的实力。我是比较建议从稀有入场，所以入场成本可能大概在150busd，假如想要冲排行榜，赚取更高额的奖金，那比较适合史诗卡牌。另外卡牌有power值，指的是可以召唤多少张卡，那如果想要增加召唤次数就会需要去消耗实用代币GOT。\n\n![](https://images.mirror-media.xyz/publication-images/QWtPplREgnfj_d2AVNXfy.png?height=942&width=1350)\n\n## 我觉得Era7的几个亮点：\n\n首先美术风格我自己觉得不错的，当然美术风格见仁见智，我自己蛮喜欢这样的风格；\n\n项目方更新比较积极，执行效率不错，游戏刚开始只有英文版本，然后我们跟官方聊对于华人区的玩家不是很友善，他们收到这个消息一个礼拜以后，就有中文了；\n\n第三是卡牌的深度很够。如果你要建立新的卡组，需要放30张卡片，就会导致有很多策略性。因为我自己以前也有玩炉石打上传说过，在大概五六年前，所以我认为游戏的策略性实并不输当时的炉石，不敢说和现在的炉石比，era7一定还有很多进步空间，但我认为卡牌的配合深度是蛮充足的。\n\n## 游戏玩法介绍：\n\n这个游戏它是一个九宫格的站位，一开始给四张牌，可以替换费高的卡牌，如果看到卡牌费不够，可以charge丢弃一张卡换到多一点费。那这回合费值就会到3。在上路中路下路摆放我的卡牌，当同一排对面没有任何卡的时候，就会直接去攻击对方，当对方玩家生命值归零的话，这场对决就胜利了。\n\n![](https://images.mirror-media.xyz/publication-images/4DBQ8q27supB7ZW-AmFvj.png?height=705&width=1350)\n\n这个游戏逻辑是以上的内容，其中还会涉及到卡牌的搭配，我的卡牌比较倾向于打快攻，我就加强自己的攻击力，一直去打他的脸。\n\nPlay to earn的奖励在Ranking这里，如果赢一场大概获得2个got，另外如果打到排行榜，还有周奖励和赛季奖励。\n\n![](https://images.mirror-media.xyz/publication-images/llAreBrp7SoyeTHPBA2lt.png?height=714&width=1350)\n\n那玩家是不是氪金越强花很多钱就有可能第一名或者是前三名，这个游戏它比较特殊的地方，就是说他的卡牌呢，调配不错。比如一个大佬花了10万块去建构牌组达到了第一，也有可能只花了4万块达到了前3，我们群里有一个前排玩家上一季也是第一名，整个牌子只花了2万块人民币，所以这个游戏并不是很多钱就会特别强，如果牌组搭配的不好也不一定能够赢，像上次看到算力3600分的跟我打，也输给我。这代表说他的牌组配置有问题，我的配置比较好或者运气比较好，这些在这个游戏上面都是有可能的。\n\n另外卡牌还可以自动挖矿，比如我的算力是13000，每一天大概拿到20个左右代币，这部分的收益比较少，大部分收益还是玩游戏，拼到比较高的报酬。\n\n![](https://images.mirror-media.xyz/publication-images/ZOMj8N4KehnuZ-XBHDQ8L.png?height=698&width=1350)\n\n## 代币的消耗\n\n目前游戏的代币是💲GOT和💲ERA（治理代币）\n\n💲GOT代币消耗：之前提到的卡牌召唤；另外是卡牌合成，每张battle card卡片会有四个level，如果要把卡升到level4，要消耗💲GOT，还有8张卡牌，这个消耗就很大。那因为这是传说卡消耗的就会更多，假如这个是史诗卡，它消耗的代币就会比传说卡的小。\n\n## 投资策略\n\n目前投资游戏的策略我们会购买一部分的治理代币，另外我们会把大部分的钱在打排行榜上。我们之前算过，大约1.5-2个月回本。但我们奖学金模式不会像去年做AXIE infinity一样，当时找了非常多菲律宾玩家大概四五百人，做一样的事情，用一样的队伍；在这款游戏上会挑选比较好的玩家，我们上一周和这一周也举办比赛，认识了非常多高手玩家，邀请他们来公会参与奖学金，我们出钱再分润给他，如果玩家非常会玩，就可以打到比较高额的报酬。\n\n这是我们目前认为游戏的一些亮点，还有目前我们公会做的一些投资策略。\n\n## 对于后续电竞方面的看法\n\n回想一下英雄联盟，我大一时台湾有一个英雄联盟的队伍叫台北暗杀星，那时候我在宿舍看台北暗杀星打败韩国队伍，拿到冠军，一个电竞队伍可以到世界舞台，对我来说很感动。我自己觉得电竞这几年发展不像前几年那么兴盛，可能和整个商业、产业有蛮大关系。因为它是非常庞大的组织，如果要办一个比赛，要花费非常多金钱。一个游戏公司要组织战队，要招揽选手，还要养选手，可能一年要几百万几千万美金。游戏选手如果拿到了大赛奖金，要先从游戏公司开始分，还有一些行销，可能100万的奖金只分到20万，相信这是很多电竞选手会遇到的问题。\n\n我觉得WEB3的电竞比较去中心化，比如我在台湾在一个很小的城市，英雄联盟打得再好，没有人会关注到，也没有人给我所谓的电竞奖金。但在WEB3的机会可能崭露头脚，更甚至我可以靠打游戏过活，我可以玩很多游戏，在上面打排行榜可以赚钱。我们在ATTM在上个月也举报era7比赛，报名人数150，实际比赛人数有大约80个。对我们来说举办比赛是一个蛮大的挑战，基本上都是自愿的玩家志愿者来帮忙。\n\n我们也和官方联系，他们确实会在电竞或者说竞技这一块琢磨，后面开发自己的赛事平台。因为我们这次比赛有一个游戏里面的酒馆可以对战，后面官方也会出自己的赛事，至于怎么让玩家在上面比赛可以等官方发布消息。\n\n去年的游戏公会倾向于不管是YGG或者GGG游戏大公会，在Axie爆火时候进行一些募资，我看他们简报基本上都在讲他们的scholar有多少人，比如说YGG好像有4万多名玩p2e，但是我觉得今年可能不是人数谁多谁厉害，游戏公会更专业化、精准化一点会有更多一些机会。今年大部分复制化的挖提卖游戏很容易被淘汰掉，就像AXIE，还有最近的stepn太容易被复制了，就是我天是一个不太走路的人和很会走路的人，我们如果买的鞋子是一样的，我们赚到的钱是一样的，我认为gamefi脱离这样能够复制的模式，才能让真正的玩家去赚到这些钱。\n\n但我认为在WEB3的世界确实还非常早期，我不敢说未来怎么样，很多游戏还没有办法对自己的token有很大的共识度，资产还不够去中心化。像猴子是非常去中心化的资产，大部分链游现在也是相当中心化的。那如果能办电竞，引入外部的更大更多的资金去举办实体的电竞比赛，跟实体去结合，才有可能有更大的发展，如果单纯纯走虚拟的，可能硬核度不是很够。\n\n# 三 自由讨论-GMA社区玩家\n\n**（培才总）**\n\n我在想一个困扰我很久的问题，链游怎么样才能成功？因为我们投资链游最核心的就是怎么样找到有价值的链游。今天听了一个播客，里面提了一个观点还挺有启发。传统应用和WEB3D应用的核心区别是什么？想要成功一定要迎合某种价值主张或者达成用户的某种需求。那**链游和传统游戏相比到底迎合了用户的哪些价值主张？换句话说，用户哪些需求是在传统游戏没有被满足的？**\n\n从这个角度来考虑非常有价值的，很多人会把元宇宙也从两个角度里去理解，一部分希望元宇宙给身临其境的体验，在区块链里就叫可玩性派，希望链游有足够的可玩性。还有一派会把元宇宙理解为加密资产派，不仅仅是画面也希望里面像真实的世界有真实价值，主价值的的资产，有一些智能合约。回到链游可能也要从这两个角度，**链游能不能提供有价值的资产，第二个能不能提供有价值的信息。**\n\n那么所谓的信息就是指可玩性，传统游戏里面或者前面两位嘉宾介绍卡牌游戏的可玩性，画风，美术。但是在WEB3应用里面用户的优先级比较高的是资产其次是信息。这可能有点儿对应比特币，没什么可玩性但提供了非常有价值的资产，比特币可以把它理解为第一个web3应用，或者第一个区块链游戏，但基本上没什么可玩性。以太访我觉得在比特的基础上强化了可玩性，但是资产性要稍微弱一点，他牺牲了去中心化的程度，牺牲了一些资产的安全性。gamefi我觉得是在以太坊基础上更一轮的升级，他们发展的顺序，也是先有btc后有eth，然后才有区块链游戏。区块链游戏里面也不能脱离资产，虽然资产肯定没有比特币这么硬，但是也不能像传统游戏里的金币那么软。\n\n如果一个好的区块链游戏，能不能提供一些比较硬的资产？拿era7为例，里面最硬的资产是token，\\*\\*那token的硬度、价值来源是值得我们思考的问题。\\*\\*我们前面玩过很多资产硬度上做的不好，股权代币分发的方式说改就改，分发过程也非常不公平，项目方甚至全一级的投资者机构拿了大量廉价筹码，导致大家慢慢对项目丧失了信心，也就慢慢倒闭了。另外资产的价值也来自可玩性，就像以太坊有一定的功能性，但功能性和安全性是强相关的，以太坊的核心价值是上面长出了各种各样的应用和其他资产，在用以太坊体系的时候就自动要消耗gas，这部分系统的收入分发给了以太坊持有者。\n\n另外猴子也在讲元宇宙或者游戏的概念，他的做法非常聪明，虽然还没有任何游戏性，但已经创造了非常庞大的资产：无聊猿+变异猿+土地+ape coin资产的总规模已经有几百亿美金了。而且猴的fpf价值是可以脱离游戏存在的，没有游戏也会把它拿来做头像，也就是说游戏有了一部分共识的赋能。这个也是非常棒的做法，也是很多区块链的游戏应该学习的地方，能不能有一部分资产可以脱离体系存在，era7的token现在离不开游戏，如果游戏如果比如说项目上不开发了，没人玩了，那相信这个资产会归零，但是猴子可能就游戏有没有成功会影响头像的价值，但是头像本身就已经很有价值，甚至没有游戏依然还有价值，这是很厉害的。\n\n刚好在链游底层逻辑上的一些思考，趁这个机会给大家分享，希望收到大家的反馈，era7持有代币的价值在哪？\n\n**（罡哥）**\n\n目前代币的问题不论是got和era都通过生成卡，合成卡去做消耗。前几个礼拜成立了dao，就是持有多少era可以参加投票。炉石官方自己有评估的卡牌太强或太弱，官方可能就会在下一个赛季去削弱或加强。era有做一个dao，质押后获得ve，这些票可以用来投票做更动，不管是加强还是削弱让大家来决定。我觉得这个可能在传统游戏是没办法看到的，也是蛮特别的部分。\n\n我们公会其实有接触到不同的游戏，目前我们认为比较好玩的游戏偏卡牌，也归根于开发区块链游戏的厂商可能大部分还不够给力，没有真正的MMORPG游戏出来，那我们也有接触到其他的游戏，然后目前来说确实是培才总刚才说的token都focus在游戏应用里，目前确实比较少用途。\n\n`（培才总）`\n\n我觉得这个挺有意思，刚才想了想一般链游里面资产的种类分为：token和NFT。\n\n赋能主要是游戏内和游戏外赋能，但是很多链游游戏外的赋能是不够的，如果游戏性又不好，很多链游就衰亡了。游戏本身没可玩性，代币的价值就主要是来自于游戏内，就形成了恶性循环。\n\n**1）游戏外的赋能方式：**\n\n什么是资产的游戏外的赋能呢？以token为例，**defi是一个比较好的游戏外赋能的方式**，它有点像btc的挖矿，代币的获取是有成本的，要么提供流动性承担了无常损失，要么拿其他交易对去换代币，至少是有成本的，前阵子ama时候说tiny砍了一池其实未必是个好事。我觉得链游在这么早期的阶段，游戏性不能很好给代币赋能的时候，采用游戏外的赋能也蛮有价值的。\n\n还有一个是通过社交媒体给NFT资产赋能。比较好的例子就是猴子，通过把NFT资产在社交媒体上炒热，也会形成一部分的共识价值。这部分共识价值虽然还不知道是不是有泡沫，但确实是一个方式，来给资产做游戏外的赋能。\n\n广告也是一个点，和刚才嘉宾说的电子竞技一样，电竞某种程度上有一定广告价值，不仅电竞，所有的体育比赛都是这样，体育比赛从来不是让参赛队伍出钱的，而是卖转播权收广告费，然后把收到的钱分一部分给电竞选手。但我觉得电竞和IP这个会不会早期不太好走，至少电竞你得有一定的影响力，广告商才愿意付费，IP可能会稍微容易些，猴子算是一个特例吧。\n\n**2）游戏内的赋能方式：**\n\n比较常见是通过榜单的模式，还有在新人的进入、在游戏的收入环节，把一部分利润烧掉或者放到社区金库里面，或者回购代币项目。可能游戏内赋能就是几种方式吧，有一些真金白银的收入，直接分红或者是销毁，或者买了token质押在那儿，就直接通过合约的形式分红给大家，mobox主要是通过销毁的形式，会在交易市场收到的手续费去销毁；另外鼓励大家锁流动性，锁一定期限，就给更多的奖励。\n\n（Adam）\n\n因为我本身也是era7游戏玩家，对卡牌稍微了解。我认为对于WEB3游戏web2的区别在于：WEB3最初期就要把自己想象成一个经济体。经济体像国家一样需要人口支撑，就是新的流量进来，新的流量会带着钱去购买NFT资产，然后通过一些操作得到了游戏代币，代币带来经济效应可能又吸引了一部分新的用户进来。\n\n这里我觉得就分成两个线：资产派和信息派。信息派其实更偏web2，互联网是打破信息壁垒，web3主要是做了资产所属权的固定。那在这个游戏里，我认为主要是把自己的经济体做大，从另外一个角度来讲，游戏本身的世界观如果足够大，做游戏内资产发行的多样性就会比较多，营销的手段就会比较多。这也是前面提到像用社交媒体去做一些不同类型NFT资产发行，用户投钱进来之后想办法把形成文化共识固定在这儿。第二种就是在token的应用层面上，除了前面提到的defi挂钩相关的，跟本身游戏奖励相关的，还有era7后面的七大种族、涉及到nft地皮，资产增值的方式。其他新的玩法也可能会涉及到，比如说类似发展成BNB的类似于平台币的感觉。然后罡哥提到如果做线下的电竞赛事，游戏代币本身也可以配合NFT资产作为赛事的门槛，或者所谓参赛的条件、观赏的条件。\n\n另外我也想讨论的是gamefi从最开始的页游，慢慢有一些制作精良的游戏，到后面的3a大作。像TCP卡牌类游戏有点类似于轻竞技，一局3分钟，但是长流非常好留存率很好，对设备的要求很低。现在很多大的公司都在冲3a，也要考虑到对设备的要求会不会导致我们想转化的流量根本进不来，这是关于流量层面的一个点。在流量对接层面上，公会的账户NFT租赁体系在游戏是很重要的，因为web3用户进来时候就是投资人+用户，玩着玩着产生分歧，要么觉得游戏不好玩儿抛币走人，要么觉得游戏可能会火持续投入，但持续投入到一定程度之后，会觉得在游戏赚钱和投钱差距太大就变成了投资人，那他游戏活跃度就下降。所以这时候NFT可能租赁体系，就会相对而言就会降低进来的门槛，让投资人更专注做NFT的流动性，做投资，打游戏的专注于打游戏。\n\n**（培才总）**\n\n我也认可，目前我觉得有一个发展路径的问题是资产和信息是相互促成的循环，要么是正反馈，要么是负反馈。像3a的游戏有一个问题：信息性能不能给资产赋能，如果游戏品质很好，又有非常好的机制给游戏内的资产赋能，确实会比较好。比如原来传统游戏能不能直接通过链改，目前只能看到一个实例就是传奇4的可玩性是不错的，也是对得起3a的名号，我觉得传奇4的问题是没有很好给游戏内的资产赋能。\n\n还没有用到区块链技术，比如CSGO和梦幻西游，里面确实是有一些有价值的资产的，那这部分资产的价值可能来自于通过信息性赋能资产性的一个终局，里面有一些皮肤是很贵的，因为开箱子机制，或者有几十万的玩家，就造成虽然没有运用区块链基础也没有token，但是里面的资产也可以炒的很贵。可以用信息游戏性来给游戏内的资产赋能。\n\n我不知道现在区块链游戏能不能直接走到这一步，因为这两个游戏也是通过早期的积累，这条路恐怕不太好走，游戏内的资产的价值来源全是来自于游戏或者信息性的话，其实还是挺难的。\n\n**（唐旻）**\n\n其实要赋能非常简单，我以前做过端游的，**在我看来WEB3游戏和WEB2的游戏其实本质上核心的东西就是经济系统**。大部分游戏在开服的时候的代币是价值最高的，随着游戏逐步进展，金币源源不断生产出来，金币必然是贬值的。达到一定程度以后会维持在相对稳定的状态，但是长久以来肯定是缓慢下跌的。 端游里面很考验的经济系统和现在WEB3的一样，因为WEB3所有代币都是慢慢产出，必然会缓慢下跌，而且不像端游可以通过新服来操作，代币算是价值初始化，就像那重启web3没法做到这样的机制代币体系必然会缓慢下降，因为总量一定在增加，除非有不停的新用户增量进来，但是新用户迟早也会有瓶颈。\n\nWEB3比web2的优势是没有游戏厂商在抽血。以前免费游戏的金币是承受双重抽血的：一个是缓慢蒸发，还有一个是游戏厂商拿到了大头。如果游戏厂商把拿走的钱还回到游戏里，做一个更好的不通胀的经济体系，在以前的端游时代应该是可以做到的。\n\n我觉得WEB3以后是把游戏厂商在以前免费玩时，卖免费道具这中代币赋能的形式回馈到游戏。比如说游戏厂商来卖免费道具的，比如说像炉石是游戏厂商来卖，抽掉很大一部分，我如实适用我炉石里面的代币来开卡，那等于是把暴雪的收益全部注回到游戏。我觉得这是游戏里面最强大的赋能形式，其他的赋能都免不了庞氏的结局。我觉得WEB3的模式就是游戏厂商不再从游戏里面吸血，大家都能从里面去获利。\n\n回到这款游戏era7，比如要我来设计给他赋能，像欢乐豆是纯产出的，但欢乐豆是有价值的，就是在游戏中消耗，比如era7的游戏设计房间，代币要像欢乐豆那样带进去的，那它的消耗就滚起来了，然后游戏代币一部分给持有者，一部分给厂商，让它源源不断的消耗，代币还是要回归到游戏里面。以前端游时代本来确实是有价值的，但是它本来应该承受的价值很大一部分被游戏厂商拿走了。它里面的经济体系很容易崩盘。WEB3阶段的游戏厂商刚开始NFT发售会拿走一部分，但游戏厂商应该把这部分回归游戏，让游戏代币来承受免费道具的发放，形成一个循环。\n\n**备注：GMA的内容只做参考，不构成投资建议，投资需谨慎，大家量力而行，谢谢。**\n\n\n---\n\n# 关于GMA：\n\n**GMA游戏联盟是定位于gamefi领域的一个DAO组织。参与者主要是对gamefi赛道感兴趣，有投资实力, 投研能力，且愿意分享的机构和个人。我们会不定期分享有参考价值的链游领域生态报告，项目报告、投资实例、投资策略、游戏测评。**\n\nGMA的社交媒体平台：\n\n☆Youtube:<https://www.youtube.com/channel/UCI8VzM4ywAYR83epyoReydQ>\n\n☆twitter:<https://twitter.com/G_M_Alliance>\n\n☆discord: \n\n[https://discord.com/invite/bJ2JFsftSk](https://discord.com/invite/bJ2JFsftSk)\n\n", "timestamp": 1654529177, "digest": "JwNRJLdGiFHR8P_P5zYg9lV2BuF9LX8BUE4ZUVvqm-0", "contributor": "0xB038fbCCDa6d22c4D55cf4a5Fd72998EF77ed078"}
{"id": "iAl7pVIuMdUMpNK1pTg76CNgCaNz7P3zyUiPIj8jQx0", "title": "Community-run employer database - it is our moral duty!", "body": "In the last few years, we’ve experienced increasing instability due to several factors that I’m sure the reader does not need to be reminded of. No matter how many times the boom and bust cycle happens, we never seem to learn to put the responsibility on the right people.\n\nWhile there is a lot to say about it generally, I’m here to talk about employers and their responsibility to their existing and future workers. I’ve been increasingly frustrated to see employers cede this responsibility in the most cynical and sinister forms.\n\nSpare me the regular:\n\n1. “This is the way business is, this is what we signed up for when adopting a capitalistic system“ - This might be true, but this is also a classic misdirection tactic. While capitalism discusses profit maximization, it by no means discusses society condoning irresponsible and egregious corporate behavior.\n2. “Cancelling offers is completely legal in most states“ - This is of course true, but this is the problem. We need mechanisms to penalize bad actors that take advantage of the legal system to protect their irresponsible behavior. We should also elevate and profit actors that behave responsibly and do not condone short-term thinking and blame-shifting.\n3. “The market will take care of it, it’s bad business” - Ten years ago I would have said the same, but after repeatedly seeing this is not true. Bad press coverage can be surpassed and people have short memories.\n\n## Why does this matter?\n\nTech-workers are a generally incredibly lucky group of people. Their skills are in extremely high demand and they are compensated generously for their work. Their benefits and conditions are unparalleled to other professions.\n\nThis creates a common set of misconceptions that we see refuted over and over when things turn in the economy:\n\n1. “You have nothing to worry about since your skills are in demand” - While this might be true, it doesn’t negate the incredibly high mental cost of being laid off or having your offer rescinded. Furthermore, in bad markets, it might not necessarily be easy to find a comparable job (not just money-wise, a lot of things go into job satisfaction).\n2. “This is a two-way street, you can also leave your job at any time“ - While this is technically true, it is incredibly misleading. Leaving your job doesn’t result in the corporation losing its livelihood, health insurance for you and your family, your visa (and sometimes results in you being forced out of your home), and dignity.\n3. “Corporations are required by law to maximize profits” - This is of course true, but this is the point. Shareholders don’t have to worry about mass layoffs or generally terrible corporate behavior because the company doesn’t pay a price for it. There needs to be a reputation tax to offset this.\n4. What if the corporations must lay off their workers to save themselves, should they be penalized too? When interviewing for a job, workers routinely are asked to provide background information, pass tests, and convince future colleagues and bosses that they are trustworthy. Why shouldn’t corporations have to go through the same set of hoops? If you had a justified business case for doing what you did, make it to the prospective candidates. If they request further assurances before taking the job, this is the price you have to pay (which I can guarantee you is less than the price the people you laid off had to pay).\n\n## Community-owned reputations database\n\nThe next step is always to create a centralized solution, à la glassdoor, blind, LinkedIn, level.fyi, you name it. This always follows a similar pattern:\n\n1. Mission statement and excitement - centralized service announces they are going to disrupt the market and would never be bought by foreign interests.\n2. Database and community grows - For a while, centralized service acts responsibly and advocates for workers’ rights.\n3. Centralized service is looking to monetize - Generally speaking, providing an honest and impartial platform is pretty bad business. You have all the costs associated with running the service without real monetization options.\n4. Centralized service gets acquired or sells off - Here the owners realize two things: They have valuable data. They can manipulate rankings and surpass information for a price.\n5. Repeat\n\n**The only sustainable approach is to have a worker-owned and managed database that isn’t for sale.**\n\n## What’s next?\n\nI don’t have all the answers to what comes next, but I know that something needs to be done and this is the time to do it. People never rally around these causes in good times because there doesn’t seem to be a need. Imagine the pain of your friends and countrymen that had to endure one or multiple layoffs in recent years. Imagine the pain of people that came to your country to better themselves and their children’s future to be disposed of once they weren’t needed anymore.\n\nI know one project can’t fix everything, but this is a step in the right direction. Bitcoin has changed the way we think about money, and Ethereum has changed the way we envision the web, this is the time to start using it for good.\n\nI’m writing this piece with the backdrop of the horrific shooting in Texas that took the life of 21 innocent children. I’m seeing the lack of care for human life that is shown for the sake of “freedom”.  People should have the freedom the conduct business, but they should do so with dignity and care for the other, we must keep building to ensure it happens.", "timestamp": 1654529325, "digest": "QODuEakkJ2LjojFgPCDWAy93kxjYVfENdJ-Wo6ve4Xk", "contributor": "0xCA67AA71eE852e539326625ad9D0e273Ab22d155"}
{"id": "IigVyyWDds3wXUv5IyxBPEB__GEgfEKlX1V9XP67-mY", "title": "UFC Strike 101：开始收集所需的一切", "body": "# \n\n##### 自 1 月份推出以来，UFC Strike 已经为 MMA 粉丝提供了数千个 Moments 包。以下是您参与行动的方法。\n\n[Dapper Labs](https://www.dapperlabs.com/)已将自己作为精英体育[NFT](https://boardroom.tv/category/nft/)的首选目的地在互联网和[元](https://boardroom.tv/tag/metaverse/)界上名列前茅。[首先，该公司通过NBA Top Shot](https://boardroom.tv/nba-top-shot-faq-quick-start-guide/)点燃了互联网，这是为体育收藏家提供官方授权的[NBA](https://boardroom.tv/tag/nba/)和[WNBA NFT。](https://boardroom.tv/tag/wnba/)[现在，该公司正在以UFC Strike](https://www.ufcstrike.com/)的形式重现与[UFC](https://boardroom.tv/tag/ufc/)相同的魔力。\n\n### 什么是 NFT？\n\n[NFT](https://boardroom.tv/?s=NFT)代表不可替代的代币。换句话说，它保证了唯一的数字资产属于其所有者。虽然很多人会尝试“右键+保存”的玩笑，但拥有 NFT 可以确保所有者拥有原始资产而不是副本，从而增加价值。\n\n### 什么是 UFC Strike时刻？\n\n现在，粉丝们将能够以 UFC Strike 的形式拥有 UFC 历史上一些必看的时刻——这项运动最令人难忘的战斗的短视频集锦。\n\n杰出时刻的例子包括 Francis Ngannou 在 UFC 218 上对 Alistar Overeem 的有力上勾拳，以及英国球星[Paddy Pimblett](https://boardroom.tv/tom-aspinall-paddy-pimblett-ufc-london/)在击倒 Luigi Vendramini 时的雷鸣般的表现。\n\n<https://youtu.be/-TI8Dg1G1qo>\n\n上周，Israel Adesanya 的首场 UFC Strike时刻——他的 UFC 243 淘汰赛——以 10,000 美元成交：\n\n不过，收集只是乐趣的一部分。更深入地了解，收藏家可以搜索他们独特收藏品的序列号。大多数情况下，序号越早，时刻越稀有，从而增加价值和稀有度。\n\n### UFC Strike 等级和版本\n\n[MMA](https://boardroom.tv/tag/mma/)粉丝可以通过在 UFC Strike 网站上购买数字卡包来赚取 Moments。在打开包时，收藏家可以从五个级别的分类中登陆 Moments。但是，并非每个包都包含每个级别的 Moments。\n\n一些包将包含过多的常用时刻（价值较小），而另一些则允许收藏家以非常小的百分比打包终极时刻。\n\n让我们看看各个层级以及每个层级都有多少Strike时刻：\n\n* **Fandom**：无上限的时刻\n* \\*\\*Contender：\\*\\*铸造 10,000 至 25,000\n* \\*\\*Challenger：\\*\\*铸造 250 至 999\n* \\*\\*Champion：\\*\\*铸造 25 到 99\n* \\*\\*Ultimate：\\*\\*铸造 1 到 10 个（最稀有）\n\n到目前为止，UFC Strike 平台上已经有四个独特的礼包掉落。您可以“加入投递”并在数字等候室等待购买一包。进入队列后，等待 UFC Strike 发送的电子邮件，显示您的队列 ID 收藏家可以在您结账时购买限量礼包。\n\n不幸的是，并不是每个站在数字线上的人都能带着包离开他们的浏览器。然而，一个开放的[市场](https://ufcstrike.com/p2pmarketplace)将允许用户跳过包装的随机化并购买他们喜欢的特定时刻。\n\n### 如何购买\n\nDapper 让购买 Moments 变得非常容易。\n\nDapper Labs 拥有自己的[区块链](https://boardroom.tv/tag/blockchain/)，每个 Dapper 账户都会将每个个人账户连接到一个数字钱包。数字钱包已连接到您的银行账户，这意味着收藏家无需拥有他们的[加密](https://boardroom.tv/category/bitcoin-and-crypto/)钱包即可购买任何 NFT。\n\n从您的钱包中，您可以从您的银行账户中存入资金来购买包。同样，所有者可以从钱包中为已售出的 Moments 提取资金。\n\n### 我拥有一个时刻。怎么办？\n\n现在，收藏家可以查看他们的整个收藏并惊叹于他们的所有权。时刻越稀有，价值会随着时间的推移而增加。把它想象成一种艺术投资。\n\n也许您正在寻求捕捉市场上的每一个 Conor McGregor Moment。或者，也许您想尝试从特定包中收集一整套 Moments。可能性是无止境。市场在估算时刻在任何给定时间的总价值方面做得非常出色。\n\n既然您知道如何赢得 UFC Strike时刻，是时候前往他们的网站并拥有一块数字资产了。与您的朋友分享瞬间，加入买家和卖家的Discord，让自己更接近您最喜欢的fighter。\n\n**By Zelig H.SPORT**", "timestamp": 1654529358, "digest": "11-EeKEmrN4Vh6WPK-FSFtCw28A4fikHDUAz-53cGBs", "contributor": "0x25A015CF5556f68FAc3018caB4e95a15478e8D84"}
{"id": "iY_Ue936lNq2ohmxSuEE2t3vtP8JaI9trsEpX_84GZA", "title": "锦瑟", "body": "沧海月明珠有泪，蓝田日暖玉生烟。\n\n此情可待成追忆，只是当时已惘然。", "timestamp": 1654528997, "digest": "F8o5Oev82jZPJg-1wBHSutTubRzK1I9Dh12ajOlZIMY", "contributor": "0xEF141C35D05188ABfd3e72E5972aD23c17F3d962"}
{"id": "jZQuiw-zm3aoT0jvd-0xWYkmIICtiJuFvgdijUJi9MM", "title": "我喜欢略带神经质的角色", "body": "我喜欢略带神经质的角色。神经质有助于猛然出现一个性格点，有一次剧本研讨会上我说。\n\n哈勃君能接收数亿年前(光要抵达的时间)的异星景象，所见均是过去式。他看见数亿年前的星星，红外拍摄为无数大小不一的光斑。我得到的工作是将光斑以最小像素分析。每团光，都是一个完整的世界对吧。我不知道。老大希望我从某粒光中，解析出一部“罗密欧与朱丽叶”的活话剧。最好演出别超过两小时，二分之一早餐相距午餐的时间。而哈勃夫人。假若此时出现阴性角色，并非专指以其和阳性交媾的对应形式，还表达了另一种观察法。我想哈勃夫人她会追逐。她会追逐那些未被哈勃君吸收的光。在她看来，被哈勃君拦截的光，有一部分被哈勃君吸收了。未被吸收的光，则显出哈勃君太空材料的外形和质感，然后继续旅行。她必须追逐。因为这些光不仅包含了已逝星辰的历史信息，还包含了哈勃君的视觉形象。在黑暗宇宙中，哈勃君形象突然现身，哈勃夫人的视觉系统因此被激活，想想她所受到的震撼吧。这可以说就是偏执，她甚至认为哈勃君正与光同逝，她为之悲恸。我们说夫人情绪化的力量，就来自哈勃君的视觉形象，瞬间将其习以为常的黑暗变得无法忍受。现在她将尽全力去追逐，而从此离开了哈勃君本人。\n\n我既缺乏知识支持想象，也无法将我的想象知识化，坐在将台西路边上某栋23楼阳台上，在一根烟和下一根烟的空隙间打字。社会学核心是知识的分配问题，是非常棘手的政治。有个傻逼说，不可使民知之。即便我们打败了政治傻逼，依然没法解决这个问题。我们会认为到手的知识就是真理，因为没别的选择。不过我可以，尽可能地，避免被流行词汇、流行腔调磨损我的感知能力。这就是这些年为为什么不再读大多数口语诗的原因。还需尽可能小心用词。因为一旦调出某个词汇，便失去了使用其他词汇的机会。而我的思维，可能因附着在这个词语上而失去了随波逐流的动力。", "timestamp": 1654528505, "digest": "vtbUdMDcp0zCZMZbZWPvBRq0losdezqLxUIoHSOTirk", "contributor": "0x7095989CdBFE15d359BaB929d5bC05786a1BB72a"}
{"id": "-kmcDN7IkJcEvaRcy6E1rRB8gbKtWUPNkn59exvT2TU", "title": "First post #001", "body": "Hello mirror!", "timestamp": 1654528704, "digest": "ucgrkR_ehCavd-bg6POFiFcuviMDqK_c4ROBNbr4-YU", "contributor": "0x106E4e0eFa8175a7e184f8b665cBCEbb09089DF2"}
{"id": "rPXzV8nUFbp8OCWVlrODQcVJg4rIMDD68-ksr0SFDMA", "title": "The UX Tipping Point is going to kill Web3 products", "body": "I was speaking to some co-founders when I was in San Francisco recently for Startup Grind, mainly around ZeroToDesign and how we help startups.\n\nThe co-founders were on opposite ends of the outsourcing scale for their Product & UX design. One was very chilled about the idea of Z2D coming in and owning their Design function — *let’s call him Dude1*. The other,\\* let’s call him Dude2\\*, was completely against it, as he wanted to have a proper in-house team to handle their Product Design.\n\nWe’ve seen these two personas from the very beginning of Z2D. It’s a founder conversation, and how happy they are to have what on paper is an outsourced function for their product (we don’t work like an outsourced function but that’s a topic for another time).\n\nOur conversation then took a turn when *Dude1* made an interesting point. He said:\n\n> There’s no problem in outsourcing when the product isn’t your entire business.\n\nWhen your product isn’t the entire business. Interesting. What he was saying was that when there are *other* USPs in your business, beyond just the (typically SaaS) product you are creating, then outsourcing isn’t a problem, because it’s not the be-all and end-all for your business, there are other things customers care about that you provide.\n\n*(I disagree with the idea of outsourcing being appropriate for non-primary products — but I do accept that many startups feel they need to control their experience in-house to make it great. I don’t think it needs to be this way but that’s my biased opinion while I create an awesome agency)*\n\nI didn’t have an opinion when Dude1 spoke, I wanted to let the point settle in my head, but my gut said that makes sense. **I’ve worked in many startups that didn’t care/invest much about their Product & UX Design but still were great businesses that would be profitable, funded multiple times, and even turn into unicorns.**\n\nAs much as I want to drive for a great user experience in products, the reality is that it’s not always necessary for every company. \\*\\*For a lot of Web3 products right now, the focus is on functionality, not usability. \\*\\*So it got me thinking about the reasons why and how this occurs…\n\n## A Twitter thread\n\n[Daniel Rhodes responded to a thread](https://twitter.com/danielrhodes/status/1520455399001841665?s=20&t=AXiuBmCISzGxXESbT3dJjA) on Twitter recently:\n\n![](https://images.mirror-media.xyz/publication-images/05Ce-Ju4vP_6TBJgsfsS-.png?height=1044&width=1182)\n\n> ‘How does good UX make banks more money?’\n\nIt’s a great question, and to me, there’s a simple answer:\n\n**Competiton + easy transferability.**\n\nIt made me think there’s a matrix of some sort for products across these two variables. So I created a chart to illustrate some types of products/platforms, and where they sit.\n\n![](https://miro.medium.com/max/1400/1\\*W9Y8_-Q9_XYdi86lMxYetA.png)\n\nTransferability renamed to Switching.\n\nAs we’d expect, there aren’t going to be that many products that sit in a low competition zone. In this day and age, low competition will not last for long. That’s the key, you can feel this sense of invisibility when there is nothing else out there for your customers to just switch easily, but that day will come. Let’s call this transition (dashed line) the\\*\\* UX Tipping Point\\*\\*.\n\nThis is where not caring much about your UX really falls apart.\n\nWeb3 products haven’t hit their tipping point yet in 2022, and they’re operating under some pre-tipping point scenarios, but I predict come 2024 they’ll be well inside.\n\n## Pre UX tipping point scenarios\n\nI think there are 3 main scenarios that mean *for a period of time* you might not have to worry about a user’s experience that much\\*.\\*\n\n## Multi-product offering\n\nThis is from the example at the start of the article. Where your business doesn’t solely rely on one product to generate revenue.\n\nAn example from my past is Goodlord, which is a real-estate management platform primarily but offers alternative products to its customers like insurance and contract signing.\n\nThis allows the primary SaaS product — the management tool to not be in the spotlight for their customers and *ultimately their balance sheet*. So the UX takes a back seat because the whole product takes a back seat.\n\n## Monopolies\n\nWhen you are the sole owner of your space/niche, what will customers do if your UX is trash?\n\n[Footyaddicts.com](http://footyaddicts.com/) and [Spareroom.co.uk](https://www.spareroom.co.uk/) are good examples of this. Both are 2-sided marketplaces in the UK, and absolutely dominate their individual markets, football games, and renting respectively. Their experiences are sub-par in the grand scheme of things, but we as customers have no alternative options for signing up to football games and renting easily (in London) so we live with it.\n\n## Early-adopter customer base\n\nI touched on this in a [previous article about the challenge for Web3 products with UI/UX](https://medium.com/zero-to-design/why-web3-will-have-the-hardest-ui-ux-challenge-any-industry-has-ever-faced-b418d3cc75fe).\n\n![](https://miro.medium.com/max/1400/0\\*SeT63IaxRWXNgkGS.png)\n\nWhen you have a product that makes a quantum leap in technology and thus 100x’s the *complete* \\*experience, \\*not just the digital product experience, then simply put, people are willing to take a poor UX. This is because whatever they were doing before, would’ve taken so many more steps and hours that it’s figuring out the new product while it's still not intuitive.\n\nCrypto FX is a good example of this. Cryptocurrency allows you to send payments instantly to anyone (their wallet) in the world. Pretty powerful stuff.\n\nBut it can be a bit of a hassle to take money from USD to XRP to GBP using wallets, not all the experiences that exist today are super seamless at converting using crypto. However, if you try moving money from USD to GBP and you’ll either get hammered with fees ($40 wire transfers) or it’ll take 3–5 business days.\n\nSo the quantum leap is worth a weird experience for early adopters.\n\nThis won’t last forever though. Eventually, players will see the potential and build similar products built on the improved technology, and this is already happening.\n\nFor Web3 products right now, Early-adopter customer bases and Monopolies are the most common scenarios. These 2 do have an overlap period because by its nature an early-adopter product might be a monopoly as no one else has created its quantum leap product *yet*. Within these scenarios, it can feel like UX isn’t a priority, but that can quickly change…\n\n## Example— Sketch\n\nFrom the UX Tipping Point chart, you can see UI design tools in 2021 sit inside the tipping point, but they weren’t always like that. It was a very different story in 2015, competition was much lower, as Figma and Adobe XD hadn’t launched.\n\nSketch was a UI design software from the 2010s. It was a quantum leap in software for Product & Visual Designers relative to Photoshop and occupied a nice monopoly in the mid-2010s.\n\nBut their UX had big holes, like no real-time collab, lack of community, and a heavy native Mac application. There were plenty of other issues, like platform updates being once a year. Then Figma launched in 2015, then Adobe XD in 2016, and these started to gain traction. The monopoly Sketch enjoyed faded as more tools came, and then the market share drastically changed…\n\nFrom **Sketch at 7x that of Figma in 2017:**\n\n![](https://miro.medium.com/max/1400/1\\*ptmOR7KdkW961IXN4R0k2A.png)\n\nTo **Figma being 3x Sketch in 2021**:\n\n![](https://miro.medium.com/max/1400/1\\*KlI4dxqYDQV-Za8d4ME4PQ.png)\n\nFigma at almost 3x Sketch\n\nIt’s a crazy fall from grace for what once was the darling of UI design.\n\n> Don’t be Sketch, invest in UX.\n\n![](https://miro.medium.com/max/1400/1\\*BDv-J4SeuyBBBs0Xj0Bwxw.png)\n\n5-year Google Trends graph for Sketch (black) and Figma (blue)\n\nThe survey was run by [UX Tools](https://uxtools.co/) which has over 14k subscribers on its email list and had >3k respondents to their 2021 survey, a fair sample size for designers and their tool choices.\n\nWith Web3 products right now, it’s either so early that there are early adopters willing to take poor UX because it's a quantum leap in technology, or they have a monopoly, such as MetaMask with non-custodial wallets. But MetaMask has players like Argent.xyz which has a tremendous UX, and I can foresee a similar fate from Sketch & Figma in a few years.\n\nTo avoid a fate like Sketch, startups and their products will need to focus on making good user experiences **before** they reach their UX Tipping Point, rather than scrambling for high-quality and expensive designers when they suddenly get there.\n\nThat’s where I come in.\n\nSakky B\n\n[Zerotodesign.com](https://zerotodesign.com)", "timestamp": 1654529284, "digest": "W71qCCYQgqp5fspbY6yLlVlvFmNVpA0tn6QRpANQFmE", "contributor": "0xc2164d1754682943327c2E2229967dA5643827D2"}
{"id": "uEojW_jmndBEHv4b-94-lxFFob9iPlanhrZChMoahvE", "title": "NotLuna", "body": "![NotLuna](https://images.mirror-media.xyz/publication-images/hF_EFOkvyRhq-oFUP_XZB.png?height=500&width=500)\n\nI believe it was Gandhi who once said, “Pretending to quote me is a great way of getting people to read nonsense.” Got you !\n\nAight this won’t be too long. This is a meme project, make no mistake.\n\nCliche time; Merriam Webster defines ‘meme’ as: *an amusing or interesting item (such as a captioned picture or video) or genre of items that is spread widely online especially through social media.*\n\nThat more or less covers it. The internet changed the world. Perhaps the biggest change is that it brought the world a lot closer. It is believed we produce 2.5 QUINTILLION bytes of data per day. That’s like downloading the complete works of Mozart approximately 1/7th the number of times as there are grains of sand on earth. Confusing, right? 4 years in America will have you using anything but the metric system. Accurate? Who’s gonna count and confirm?\n\nAnyway, a lot of this data is being transmitted almost instantaneously over the internet. To put this in perspective, you could send the complete works of Shakespeare to someone as many as 1.75 million times as there are planets in the universe in the time it would take you to send the same to someone without using the internet in any way ONCE. Amazing, innit?\n\nOkay enough jibber jabber. I’ve made my point. A result of this amazing speed of information sharing is being able to discuss stuff in live time. Now when rich Americans decide to buy a popular company with a bird logo, you don’t have to wait till they’ve already started pretending to do ‘due diligence’ in order to drive down the price,Nope…you’ll start seeing jokes about it on that surveillance device you keep within range at all times.\n\nWe know you get your news from meme pages, don’t worry…us too.\n\nMemes have become a crucial part of human society. In fact, I would go as far as to say they are the single most important cultural creation of the 21st century. Memes are borderless, from the 'dee O double G' all the way to a random kid in Southeast Asia who decided to take pictures of himself every day. Memes encompass the entirety of the trippy ass spectrum that is human emotion and deliver it to us in a slightly easier to digest way.\n\nAs Alfred Hitchcock said, “Exposition is a pill that has to be sugar-coated. In other words, you are giving them information, but at the time it must seem like something else. ” ([here’s](https://www.youtube.com/watch?v=oEq2XjFCaps) a great video on exposition for any film nerds reading this).\n\nThe point is - memes are useful, important, and fun (Oxford comma much?). Memes are here to stay.\n\nThe phenomenon that is the Internet is also what enables the creation of your favorite buzzwords: Metaverse & Cryptocurrency. We are far closer to plugging into the soulless utopia of bright colors and algorithmically generated emotions than you think. Ready? Player One.\n\nThe very ideas of ownership are changing. For the first time, we are exploring the digital realm, being able to do our favorite thing: own stuff. Enter NFTs. The latest descendant in a long line of honeypots originating all the way back to the great Tulip of mid-17th century Netherlands.\n\nThe NFT is possible because of a little something called the Blockchain. You probably know what that is by now. If not, read more man…seriously pick up a phone some time.\n\nAnyway, it is largely agreed that the two major value propositions of the blockchain are decentralization and security. But I believe there are two equally, if not more, important adds are incentivisation and community.\n\nAnyone in the NFT space already knows about the power of community, a bunch of people doing word of mouth marketing for you with vested interest? Hell yeah. And as for incentivization, we’re only beginning to explore that plethora of possibilities. We can create models that allow rewarding people for anything. And I mean…anything([SEXN - a first of it’s kind sex-to-earn protocol](https://twitter.com/mattysino/status/1530215852037050368?s=20&t=oeFix0P1C2Q7Vw2NrrdrUg)). Yeah…everything is going to zero.\n\n(All these things combined are what we call Web3.)\n\nBUUUUUT, in case it’s not, we think the meme itself should find a way into this “Web3” too. In a manner that’s keeping up with the times. *And that is what NotLuna is all about.*\n\nNow that you know the “Why?”, let’s talk about the “What?”.\n\nNotLuna is a collection of 10,000 NFTs on the Ethereum blockchain. NotLuna is NOT, in any way, a reference to one of the best memes in history. It does NOT take inspiration from perhaps what is one of the greatest stories of human hubris.\n\nBut you know what they say: comedy is tragedy plus time…and we’re laughing about it already.\n\nNo, NotLuna is about a person, just like all of us.\n\nMeet Do Gen:\n\n![Do Gen](https://images.mirror-media.xyz/publication-images/WLaJ-Za_GlDVG71d3jQUn.png?height=1000&width=1000)\n\nJust like all of us, he’s trying to make it in Web3 too. And just like all of us, he goes through many emotions.\n\nDo was born in NotSeoul in a time well before Web3. But technology always spoke to him. In fact, he even studied at the prestigious NotStanford community and then went on to work for behemoths like NotApple and NotMicrosoft. But it was in the blockchain that he found his calling.\n\nNow he spends his days trying to find the next big thing and when he has time from that, he tries to create something of his own. Oh and he loves to water his plants, whatever that’s about.\n\nJoin Do on this emotional roller coaster that is the decentralized internet.\n\nGMI or NGMI? Only one way to find out. (mint it)\n\n## FAQs\n\n* Wen mint?\n\nNot sure yet, but super soon.\n\n* Free, right?\n\nYeah yeah. Y’all been conned one too many times for us to be able to charge you for this. But we’re keeping 1000 and we don’t need to explain why.\n\n* Roadmap?\n\nYeah, as if you read roadmaps…you’re in it for the vibes and so are we.\n\n* Really, nothing planned?\n\nNot per se, but some people believe that when Do Gen was born, a mystic made a prophecy that if Do Gen’s collection reached a 1E floor, he would find his wife Di Gen and together they would create an army of De Gens. So we’ll see.\n\n* Who are you?\n\nAh yes, the team. Another metric you pretend to look at before “aping in”.\n\nThe writer of this paper is @cryptanosaurus. I have been degening on the blockchain for about 6 years now and am now building something pretty cool (shameless plugin). Check it out here: [https://novadao.xyz/#/](https://novadao.xyz#/)\n\nOh and the mint link will be released in Nova’s discord so you probably want to hop in there.\n\nAnd the Co-Founder, Archie, is an artist and architect. He has been in charge of bringing these traits to life.\n\nThe funny thing is, Archie and I have never met in real life. We met each other through the mutual ownership of the Pixel Vault Founder’s DAO. Maybe NFTs do have some promise after all. They bring people together .\n\nYou can suss us out on Twitter, we’re legit (like legit enough for you to take a free NFT from us).\n\n* Hey these faces look familiar…what’s that about?\n\nIf these expressions ring a bell, you’re old enough to stop wasting time on random mints and get a real job. Ur old and ur poor and ur still wasting time on memes. But yeah, we felt a great way to begin the Web3 meme journey is with an ode to the first memes. Sit and think of new stuff and not just remake old shit combined with a topical element? Bitch Please!!\n\nSee you soon, my fellow ~~De Gens~~  Do Gens!!\n\n![The Many Moods of Do](https://images.mirror-media.xyz/publication-images/iCly51yygBTV9xsrm2Nhb.png?height=500&width=500)\n\n", "timestamp": 1654529098, "digest": "UX5AzHVKO17pD2KmIfcodkiFkE8-CtlOnQps5KMAIhk", "contributor": "0x93FC0C711c2dF516Bc442AD4B3Ed47Cc4001829B"}
{"id": "YN2ukZ8r16IJCViyYI06QejX3WmpmQrTE1mPptJGQn0", "title": "NBA Top Shot新玩家策略：前 100 美元", "body": "因此，您最近加入了 NBA Top Shot，但您不确定从哪里开始。你应该先买什么，你的策略应该是什么？你应该开始收集你最喜欢的球员，最酷的时刻，还是最有价值的？所有的好问题，但首先，您刚刚加入了一个令人惊叹的平台，该平台仍然非常早，并且会在未来几年内成长，所以系好安全带，准备好开始吧！\n\n在本文中，我将提供 3 种不同的策略供您使用，并将具体介绍如何遵循这些策略来花费您的第一笔 100 美元！在我们开始之前，如果您的帐户中还没有资金，请务必查看我[之前的文章](https://dgen.network/how-to-avoid-big-credit-card-fees-on-nba-top-shot/)，了解如何在执行此操作时节省费用！\n\n这些策略不是按推荐顺序排列的，而是列出所有可靠方法，您可以开始并根据您对该平台的目标而有所不同。\n\n**策略1-投资者**\n\n如果您进入 Top Shot 纯粹是为了赚钱，只要知道市场是完全不稳定的（纸手居中），并且在过去 5 个月里一直在经历价值流失。正因为如此，只要知道你面临着挑战，但如果你长期参与其中，你绝对可以成功！此外，由于我们经历了一些极端的价格下降，与几个月前相比，您现在加入可能会更好。\n\n出于投资目的，您必须考虑哪些时刻可以保持价值并经受住时间的考验，因为新的时刻（又名供应）不断地添加到市场中。对我来说，这是系列 1 Top Shot Debuts，不久前还没有 100 美元的预算，但现在你有很多可供选择。我可以继续抱怨为什么，但向我解释的最简单的方法是立即点击是神奇宝贝。是的神奇宝贝，特别是已经存在 25 年并且每年都有新版本的交易卡。想想哪个版本（系列）最有价值、最稀有以及人们真正想要的。这是第 1版，也就是 NBA Top Shot条款中的系列1。\n\n所以，如果你是为了钱，并且愿意长期持有这些时刻，那么对我来说，就是这些Top Shot的Debut时刻。以下是截至今天低于 100 美元的低要价市值前 15 名！卡梅隆·安东尼在这件事上是认真的吗……\n\n![img](https://dgen.network/wp-content/uploads/2021/07/Picture1-4.png)\n\n**策略 2 – 收藏家**\n\n无论您是因为收集 NFT、运动卡，还是因为您是 NBA 粉丝而进入 NBA Top Shot，您都会发现其中一些时刻对您具有一定的意义。有些人只是想拥有并拥有一段历史。无论是您参加的比赛的瞬间、您最喜欢的球员的瞬间还是您必须拥有的特殊比赛，这都是真正的“买你喜欢的”策略，如果你不这样做，你真的不会出错花费超过您可以承受的损失。\n\n对我来说，这样的第一时刻超出了 100 美元的预算，但这是文斯卡特的Top Shot首秀，这是他在平台上的唯一时刻，也是他退役前在 NBA 的最后一次投篮。这也是由于 Covid 而导致 NBA 停赛的夜晚，因此将成为历史的一部分。特雷-杨给文斯球的那一刻真是太棒了，所有的球员都后退了，他投进了一个三分球！对于许多刚入门的人来说，这一时刻现在可能遥不可及，但我相信这将是 Top Shot 平台上永远的特殊时刻。\n\n在 100 美元的预算内，您可以将几乎任何球员的许多共同时刻添加到您的收藏中作为粉丝。我敢肯定雄鹿队的球迷会想要一些 2021 年的季后赛时刻！扫描市场并从您最喜欢的球员和球队中寻找这些时刻，并将它们锁定在您的收藏中，这样您就可以拥有他们的一段历史！\n\n**策略 3 – 逻辑思考者**\n\n虽然我会说我们都使用这些策略的组合，但合乎逻辑的举动可能始终是当时最好的决定。因此，如果您是该平台的新手，并且想为您的首次购买做出最合乎逻辑的决定，我会尽可能多地购买 2 至 3 美元的时刻，并将它们与 100 美元的全部预算叠加。说真的，它一点也不性感，也不好玩。但它会给你从几个方面开始的好处。\n\n首先，添加这些时刻是提高收藏家分数的最佳且最具成本效益的方式。Collector Score 已经证明是 Top Shot 的一个非常重要的衡量标准，并将继续向前发展。获得更高的分数将使您有资格获得独家礼包掉落，并且在某些情况下将来获得礼包的几率更高。考虑到最常见的时刻每个都会给你 4 分，你可能会用你的 100 美元最终得到 150 分左右的分数。这应该有助于未来的背包掉落，并且您将在收集时继续建立此分数。\n\n添加最便宜时刻的第二个原因，即使你讨厌玩家，也是为了交易门票。这个概念是几个月前提出的，我们应该期望它很快就会推出，但这个概念本质上是你可以随时用交易票进行交易，这些票将使你有资格在未来获得独家礼包掉落。所以，如果任何时刻等于 1 张票，那么只有买最便宜的才有意义！这里有一些现在只需 2 美元，但它们走得很快，祝你狙击好运！\n\n![img](https://dgen.network/wp-content/uploads/2021/07/Picture2-2.png)\n\n希望您在开始使用 Top Shot 时喜欢阅读这些可以执行的不同策略，但您将在此过程中学习，并且您的决策将保持流畅。\n\n**By Zelig H.SPORT**", "timestamp": 1654528643, "digest": "yBl3JReI7n3Evyq-ly2vNY8yADsZ9z9NBIvyi38P8GE", "contributor": "0x25A015CF5556f68FAc3018caB4e95a15478e8D84"}
{"id": "z1_xVHrDHHkyOvPAN0AE70QyO6aKmQr_ck4VXaouIiw", "title": "哪个是潜力股", "body": "b比特币", "timestamp": 1654528575, "digest": "u03lMnQoNPJkzjQv1nNgXvYsKnZJH2jgWWogRan2pT0", "contributor": "0x4cd692ac1aFEDCdFd85111e1B0b1F2b9364aEE81"}
{"id": "PHcSvxa7r7eK8Mx0afRnLd8OJ76RRBSFz341WOoJ9nE", "title": "UFC Strike 101：开始收集所需的一切", "body": "# \n\n##### 自 1 月份推出以来，UFC Strike 已经为 MMA 粉丝提供了数千个 Moments 包。以下是您参与行动的方法。\n\n[Dapper Labs](https://www.dapperlabs.com/)已将自己作为精英体育[NFT](https://boardroom.tv/category/nft/)的首选目的地在互联网和[元](https://boardroom.tv/tag/metaverse/)界上名列前茅。[首先，该公司通过NBA Top Shot](https://boardroom.tv/nba-top-shot-faq-quick-start-guide/)点燃了互联网，这是为体育收藏家提供官方授权的[NBA](https://boardroom.tv/tag/nba/)和[WNBA NFT。](https://boardroom.tv/tag/wnba/)[现在，该公司正在以UFC Strike](https://www.ufcstrike.com/)的形式重现与[UFC](https://boardroom.tv/tag/ufc/)相同的魔力。\n\n### 什么是 NFT？\n\n[NFT](https://boardroom.tv/?s=NFT)代表不可替代的代币。换句话说，它保证了唯一的数字资产属于其所有者。虽然很多人会尝试“右键+保存”的玩笑，但拥有 NFT 可以确保所有者拥有原始资产而不是副本，从而增加价值。\n\n### 什么是 UFC Strike时刻？\n\n现在，粉丝们将能够以 UFC Strike 的形式拥有 UFC 历史上一些必看的时刻——这项运动最令人难忘的战斗的短视频集锦。\n\n杰出时刻的例子包括 Francis Ngannou 在 UFC 218 上对 Alistar Overeem 的有力上勾拳，以及英国球星[Paddy Pimblett](https://boardroom.tv/tom-aspinall-paddy-pimblett-ufc-london/)在击倒 Luigi Vendramini 时的雷鸣般的表现。\n\n<https://youtu.be/-TI8Dg1G1qo>\n\n上周，Israel Adesanya 的首场 UFC Strike时刻——他的 UFC 243 淘汰赛——以 10,000 美元成交：\n\n不过，收集只是乐趣的一部分。更深入地了解，收藏家可以搜索他们独特收藏品的序列号。大多数情况下，序号越早，时刻越稀有，从而增加价值和稀有度。\n\n### UFC Strike 等级和版本\n\n[MMA](https://boardroom.tv/tag/mma/)粉丝可以通过在 UFC Strike 网站上购买数字卡包来赚取 Moments。在打开包时，收藏家可以从五个级别的分类中登陆 Moments。但是，并非每个包都包含每个级别的 Moments。\n\n一些包将包含过多的常用时刻（价值较小），而另一些则允许收藏家以非常小的百分比打包终极时刻。\n\n让我们看看各个层级以及每个层级都有多少Strike时刻：\n\n* **Fandom**：无上限的时刻\n* \\*\\*Contender：\\*\\*铸造 10,000 至 25,000\n* \\*\\*Challenger：\\*\\*铸造 250 至 999\n* \\*\\*Champion：\\*\\*铸造 25 到 99\n* \\*\\*Ultimate：\\*\\*铸造 1 到 10 个（最稀有）\n\n到目前为止，UFC Strike 平台上已经有四个独特的礼包掉落。您可以“加入投递”并在数字等候室等待购买一包。进入队列后，等待 UFC Strike 发送的电子邮件，显示您的队列 ID 收藏家可以在您结账时购买限量礼包。\n\n不幸的是，并不是每个站在数字线上的人都能带着包离开他们的浏览器。然而，一个开放的[市场](https://ufcstrike.com/p2pmarketplace)将允许用户跳过包装的随机化并购买他们喜欢的特定时刻。\n\n### 如何购买\n\nDapper 让购买 Moments 变得非常容易。\n\nDapper Labs 拥有自己的[区块链](https://boardroom.tv/tag/blockchain/)，每个 Dapper 账户都会将每个个人账户连接到一个数字钱包。数字钱包已连接到您的银行账户，这意味着收藏家无需拥有他们的[加密](https://boardroom.tv/category/bitcoin-and-crypto/)钱包即可购买任何 NFT。\n\n从您的钱包中，您可以从您的银行账户中存入资金来购买包。同样，所有者可以从钱包中为已售出的 Moments 提取资金。\n\n### 我拥有一个时刻。怎么办？\n\n现在，收藏家可以查看他们的整个收藏并惊叹于他们的所有权。时刻越稀有，价值会随着时间的推移而增加。把它想象成一种艺术投资。\n\n也许您正在寻求捕捉市场上的每一个 Conor McGregor Moment。或者，也许您想尝试从特定包中收集一整套 Moments。可能性是无止境。市场在估算时刻在任何给定时间的总价值方面做得非常出色。\n\n既然您知道如何赢得 UFC Strike时刻，是时候前往他们的网站并拥有一块数字资产了。与您的朋友分享瞬间，加入买家和卖家的Discord，让自己更接近您最喜欢的fighter。\n\n**By Zelig H.SPORT**", "timestamp": 1654529429, "digest": "WlLO6nGDkZW_sALon8JLMnTZv0UE0NYFP-LGlgJRUmw", "contributor": "0x25A015CF5556f68FAc3018caB4e95a15478e8D84"}
{"id": "ST1IVzlssNW0Okgm5r1MJ_c8SxMO4n6UAC51GsalN_0", "title": "Can I really wrote something?", "body": "Toujours ce problème de la page blanche. \n Encore moins facile quand l’on doit écrire dans une autre langue que sa langue maternelle.", "timestamp": 1654529416, "digest": "iOBc6HVharSK70ZbTVbuGB5fjmT2ixrbkgaUTKXERdg", "contributor": "0x5B9De7c6b24F1baf04b3bDde9F656F5550f6C9EB"}
{"id": "6oWVPSok8DMAFQe0Y4gbFy-ac9pSOJkELZ7CZR0jzao", "title": "Squarez: something to know before public beta.", "body": "The signal is rather simple : “buy” and “sell”. It will only make a “sell” call if it had make a “buy” call on the same collection.\n\nTo follow the signal, buy the floor when the bot tells you to buy and sell (even cut the floor if necessary) if the bot tells you to sell. I usually buy a little above the floor so that I won’t get a reverted transaction.\n\nWhen you follow the signal, also check these things out:\n\n* the reveal dates \n* If the collection is sold out (public sale phase/whitelist sale phase etc.) \n* If the collection is surely not a rug (I think my signal cannot identify if a collection is a rug or not. They could create fake hype.) \n\nOtherwise, always mind your risk.\n\nDisclaimer:  \n\n1. This signal tells you when you should buy/sell. However, the real usage is “not to buy at the top” and “not to sell at the bottom.” Of course, you can earn money following the trade, but I am not responsible for any loss.\n2. It is up to you whether to follow the signal or not. Try following those signals on the paper first, and you might want to change a little bit when/how to entry and the way to exit. This is just a tool, and I am not responsible for any loss. \n3. If more and more people are using the signal, then the market structure could change, too. I’ll keep updating the signal and do the necessary if the signal can’t work anymore under the new market structure.\n\nI also accept acquisition of the signal at 200eth so that you can use it on your own. In that case, I will return the mint price to NFT holders. So, if you want to buy Squarez from secondary, mind your risk, too.\n\nMint site: https://pinner-studio.xyz\n\nMint price: 0.05 eth\n\nSquarez! twitter :\n\n[https://twitter.com/Squarez_NFT](https://twitter.com/Squarez_NFT)\n\nDiscord:\n\n[https://discord.gg/TQUJks2yDZ](https://discord.gg/TQUJks2yDZ)\n\nAuthor’s twitter:\n\n[https://twitter.com/wayne567tw1](https://twitter.com/wayne567tw1)\n\n", "timestamp": 1654529702, "digest": "MeErR77QRP2DW6jD2_bSzLweQ7EQ7PwXe0PKnWmHTMQ", "contributor": "0x7674c3d61E9764fCa0Dc2FED6c9A914Fe2d9334d"}
{"id": "7bgo1q5xVrnnL2oJQzDkpeQUPS-0OyPtDVeky9_Djo0", "title": "Squarez: something to know before public beta.", "body": "The signal is rather simple : “buy” and “sell”. It will only make a “sell” call if it had make a “buy” call on the same collection.\n\nTo follow the signal, buy the floor when the bot tells you to buy and sell (even cut the floor if necessary) if the bot tells you to sell. I usually buy a little above the floor so that I won’t get a reverted transaction.\n\nWhen you follow the signal, also check these things out:\n\n* the reveal dates\n* If the collection is sold out (public sale phase/whitelist sale phase etc.)\n* If the collection is surely not a rug (I think my signal cannot identify if a collection is a rug or not. They could create fake hype.)\n* The volume. Sometimes it gives the signal on a collection with nearly 0 volume. It could still be a pre-pump signal but please wait until you see more volume first.\n* The price. Do some calculation on the gas price and don’t lose money because of this.\n\nOtherwise, always mind your risk.\n\nDisclaimer:\n\n1. This signal tells you when you should buy/sell. However, the real usage is “not to buy at the top” and “not to sell at the bottom.” Of course, you can earn money following the trade, but I am not responsible for any loss.\n2. It is up to you whether to follow the signal or not. Try following those signals on the paper first, and you might want to change a little bit when/how to entry and the way to exit. This is just a tool, and I am not responsible for any loss.\n3. If more and more people are using the signal, then the market structure could change, too. I’ll keep updating the signal and do the necessary if the signal can’t work anymore under the new market structure.\n\nI also accept acquisition of the signal at 200eth so that you can use it on your own. In that case, I will return the mint price to NFT holders. So, if you want to buy Squarez from secondary, mind your risk, too.\n\nMint site: https://pinner-studio.xyz\n\nMint price: 0.05 eth\n\nSquarez! twitter :\n\n[https://twitter.com/Squarez_NFT](https://twitter.com/Squarez_NFT)\n\nDiscord:\n\n[https://discord.gg/TQUJks2yDZ](https://discord.gg/TQUJks2yDZ)\n\nAuthor’s twitter:\n\n[https://twitter.com/wayne567tw1](https://twitter.com/wayne567tw1)\n\n", "timestamp": 1654529989, "digest": "MeErR77QRP2DW6jD2_bSzLweQ7EQ7PwXe0PKnWmHTMQ", "contributor": "0x7674c3d61E9764fCa0Dc2FED6c9A914Fe2d9334d"}
{"id": "AwkuwxaDZ140jRSREUCNcc9HYsPc6ku--n1CScmRsMM", "title": "论获得智慧的方法", "body": "自去年 8 月悟道（即获得智慧）以来，压抑的独处变成了积极的独处，对世界的看法由悲观变为了乐观，由一言不发变成了非常热爱演说，身心健康与幸福感大大提升。自生性的平静、充实、喜悦包围着我，这些东西的向外索求变成了内生供应。\n\n我不得不思考这其中的原因并试图总结。从直觉观感上，我发现首要的原因是苦难，第二个原因是对苦难的思考。\n\n从小到大，看过很多书和文字，但仔细想想：别人写下的，始终是别人知道的，我并不是真的知道。要得到真知，必须要亲自做一做。从这一点上来讲，阅读是无用的。如果我知道，读到作者也同样知道的东西时我会赞同；如果我不知道，读了只会没有反应。所以我排除了把阅读视为首要原因的可能性。那么，首要原因要从哪里找？是实践行为吗？\n\n实践行为是获得真知的方式，通过它，我可以真的知道。但知识并不等于智慧。知识是对具体事物的认识，是事实的映射；智慧是逻辑、思考、辨别、分析能力。一个知识渊博的人，也有可能是没有智慧的；一个获得智慧的人，也不一定对很多事物有很深的认识。知识是知识，智慧是智慧。行动可以获得知识，但无法获得智慧。\n\n那么，从何获得智慧？我认为，苦难是智慧的源泉。苦难包括了人们在生活中经历的艰难困苦，及其投射在人们心中的烦恼痛苦。有了苦难，才有可能有对于苦难的思考。没有苦难，人们只会悠然自得，对苦难的思考也就不会产生。\n\n当然，只有苦难也不行，还要有对苦难的思考，即思考苦难是什么、为什么、怎么办。这种思考应该有两个结果：一是没想通，从而放弃思考；二是想通了，从而获得了辨别苦难的正反面的能力、走向苦难反面的能力。还应该有一个过程，就是正在思考的过程。以上三者，就是思考的三种状态。\n\n为什么有苦难？这应当是思考中的核心。想清楚现实与心灵中痛苦磨难的根源，才能决定自己怎么办。因为决定其实是一种选择，依赖于辨别能力。也就是说，一旦思考清楚了为什么有苦难，就获得了智慧。\n\n因此，我认为智慧的获得来自于苦难与对苦难的思考。获得智慧的那一刻，自己就会知道自己已经确实得到了。\n\n[https://changshiban.com/](https://changshiban.com/)\n\n原文链接：<https://changshiban.com/on-the-method-of-getting-of-wisdom/>", "timestamp": 1654529862, "digest": "Zx-ZxjiY4ltRMRKUzfbf6lT_6Yr8YhfzPlvPkqC_r1w", "contributor": "0x102896Fd9591B1d41455d171F2dEec54fd8bAeb6"}
{"id": "hINS1Dx4u1y6bg54r-PtSDEuDpUTJ6Rjwriud4w18SE", "title": "Something Token: 下一个Web3的现象级产品？ ", "body": "**作者：@Polaris88899**\n\n下文的数据统计截止2022年6月4日\n\n![](https://images.mirror-media.xyz/publication-images/61Nk7484spw9cB2W-JC5S.png?height=720&width=1280)\n\n### 目 录\n\n> * **1.基本概况**\n> * 1.1 项目简介\n> * 1.2 NFT基本信息\n> * 1.3 团队成员\n> * 1.4 团队资金\n> * 1.5 稀有度、机制及权益\n> * **2. NFT数据**\n> * 2.1 筹码结构\n> * 2.2 蓝筹指数&巨鲸&名人持仓\n> * 2.3 NFT二级交易情况\n> * **3.官方运营事件**\n> * **4.个人分析**\n> * **5.Americana相关链接**\n\n## 前言\n\n**Something Token**是Americana公司发行的10K NFT系列。在发行Something Token前，Americana已发行了Probably nothing系列（总供应量100个，genesis资产）。Probably nothing(something)作为Crypto圈的一个梗，其名字自带了meme属性。\n\nAmericana将会专注于IRL NFT赛道，目前在NFT领域算是一个创新，本文的主要分析对象为**Something Token**。由于项目还在早期阶段，官方目前释放的消息较少，以下内容仅供参考。\n\n## 1. 基本概况\n\n### 1.1 项目简介\n\nAmericana Technologies 成立于 2021 年，帮助品牌和创作者将街头服饰、收藏品、汽车和艺术品等实物商品转化为 NFT，其核心产品是一款 NFTA 通用芯片，能连接到物理对象并将其链接到区块链，并且会开发一个将实体物品以NFT形式交易的平台。\n\nAmericana目前已发行了两个NFT系列，分别为Probably Nothing 以及Something Token，NFT持有者将会享受Americana交易平台的早期资格以及特殊权益。\n\nAmericana于2022年5月宣布完成690万美元融资，其交易平台（marketplace）计划于2022年夏天上线。\n\n### Americana愿景\n\n\\- 尝试让99%的普通消费者进入web3\n\n\\- 打造Web3的Amazon/Ebay\n\n\\- 实物上链，展示区块链的力量\n\n\\- Americana将保证实体商品的真实性\n\n\\- 让大量公司使用这个技术，让大品牌进入web3市场\n\n![](https://miro.medium.com/max/1400/1\\*TZWTTAuP8i6l3mCf3n94xQ.png)\n\n（创始人Frey 2021年12月的推文: This is how everything will be transacted in the (very near) future via [@AmericanaNFT](https://twitter.com/AmericanaNFT)）\n\n### 1.2 NFT基本信息\n\n* 项目名称（公司名字）：Americana\n* 主要NFT系列名称：Something Token & Probably Nothing\n* Americana推特粉丝数：23.8K\n* Discord人数：8.9K\n\n![](https://miro.medium.com/max/1208/1\\*u8hWk45EfiNbRAMu7tQXfw.png)\n\n### 1.3 团队成员\n\n**创始人：@frey**\n\n* 个人推特：https://twitter.com/frey\n* Discord: frey#2698\n* 钱包地址：jakefrey.eth，持有的NFT有3L、Doodles、invisible friends、Moonbirds，该地址在NFT上共花过250+ETH。\n* 个人简介：Americana创始人。曾在Apple、推特、snap、shopify等公司工作，在Apple负责设计和发行工作，来自美国宾夕法尼亚，住在10个国家。\n\n**VP：@terps**\n\n* 个人推特：https://twitter.com/NFTerps\n* Discord: Terps#0420\n* 钱包地址：nfterps.eth，持有的NFT有CloneX、Doodles等，该地址在NFT上共花过150+ETH。\n* 个人简介：有 11 年大型企业和非营利组织增长的经验。\n\n**其他成员推特**\n\ndozaster: <https://twitter.com/dozaster>\n\nChief.: <https://twitter.com/micah_eth>\n\nJett: <https://twitter.com/Jett_Frey>\n\nCody: <https://twitter.com/cody_0x>\n\nFloop: <https://twitter.com/0xFloop>\n\n### 1.4 团队资金\n\n**（1）一级收入**\n\n由于Probably nothing一级发售价格不固定，且仅有100个，该收入暂忽略不计。\n\nSomething Token总供应量10,000个，500个团队储备，100个给PN holder免费铸造，剩余9400个公售预计收入为：9400\\*0.069= **648.6 ETH**\n\n截止2022年6月4日，Something token在Opensea成交量为5.8K，版税5%，收入 **290 ETH**\n\n创始人Frey曾表示，一级和版税收入将全部放在社区钱包中（用于后续空投的gas支付、快递邮费等）。\n\n社区钱包地址为 0x5A1E54F7Dc927Dbfd25B1fDD7f860Cb3B8F733Ee，当前有 **750 ETH**\n\n![](https://miro.medium.com/max/1400/1\\*NwM1GLRaa0VW9H9KqytOyw.png)\n\n**（2）融资情况**\n\nAmericana于2022年5月3日宣布了**690万美元**的种子轮融资，领投方为776 Management，Opensea等参投，天使投资人有说唱歌手Future等。\n\n@alexisohanian为776创始人，Reddit联合创始人，BAYC#822持有人。他在推特为Americana发了一条视频，包含了和Frey的对话：https://twitter.com/alexisohanian/status/1521476794276368385\n\n![](https://miro.medium.com/max/1400/1\\*5ZlIEmF8JNHeO5GsWZxbvw.png)\n\n附融资PR：https://techcrunch.com/2022/05/03/americana-chip-turns-objects-nfts-funding-ohanian/?tpcc=tcplustwitter\n\n### 1.5 稀有度、机制及权益（Something Token）\n\n**Probably Nothing (PN)** 是Americana的创世NFT资产，总供应量为100个，每一个外观都不一样，将会获得Americana marketplace的早期资格以及终身折扣。\n\n![](https://miro.medium.com/max/1400/1\\*jS1w3KtY7SwlnySSnwB4cA.png)\n\n**Something Token (ST)** 同样为Americana推出的NFT系列，总供应量为10000个，按照稀有度分为四个等级，同样会获得Americana marketplace的特殊权益。\n\n![](https://miro.medium.com/max/1400/1\\*USVnAJpu32TGDHQ2dYd2RA.png)\n\n### （1）稀有度\n\nProbably Nothing总量仅为100个，为Americana的genesis资产，不做稀有度区分。\n\nSomething Token总量为10,000个，共有**4个等级**的稀有度，其等级分布如下：\n\n\\- Common (70%) — **7,000**\n\n\\- Rare (20%) — **2,000**\n\n\\- Epic (6.9%) — **690**\n\n\\- Legendary (3.1%) — **310**\n\n### （2）Stacking机制\n\nSomething Token将会有堆叠机制（Stacking），可以将若干低等级的Something Token通过该机制“得到”高一等级的NFT：4个Common等级可以堆叠出一个Rare等级，3个Rare等级可以堆叠出一个Epic，2个Epic等级可以堆叠出一个Legendary。\n\n全部堆叠后的理论总供应量如下：\n\n\\- Common: 0\n\n\\- Rare (Common 4:1): 3,750\n\n\\- Epic (Rare 3:1): 1,357\n\n\\- Legendary (Epic 2:1): 655\n\n附该机制的动画演示：\n\n![](https://miro.medium.com/max/1400/1\\*AuM3H6eXx45s9ZCtHTcL6A.png)\n\n[https://my.machinations.io/d/Something-Token-Stacking-v0-01/098a8251cd5011ec8c2902f943517e50](https://my.machinations.io/d/Something-Token-Stacking-v0-01/098a8251cd5011ec8c2902f943517e50)\n\n### （3）NFT权益\n\nSomething Token根据稀有等级不同，允许用户升级访问级别以获得更多奖励（例如堆叠机制）。这些包括但不限于 Americana 上更便宜的交易、优先供应商访问和 IRL 激活访问。\n\n![](https://miro.medium.com/max/1400/1\\*3Pwqi6nGLqD9jnw3pS9wDA.png)\n\n注：“TBD”表示官方暂未明确表述该条权益，相关文本说明使用了模糊处理。\n\n![](https://miro.medium.com/max/1400/1\\*UMkaQJ3RIbQbzeecrDL4xw.png)\n\n## 2. NFT数据（Something Token）\n\n### 2.1 筹码结构\n\n![](https://miro.medium.com/max/1400/1\\*BXekLr2knSVKysHmS0TDRw.png)\n\nSomething Token的筹码结构较为分散，持有人数为4.5K，人均持有2.2个NFT。\n\n持有1个NFT的人数为2974，占比65.41%；持有2\\~3个NFT的人数为1019，占比22.41%；持有4个及以上的人数为554，占比12.18%。\n\n持有100个以上NFT的共有3人，分别持有276，131，105个，共计512个。持有276个的地址为项目方钱包，持有105个的为888（@crypto888crypto）\n\n### 2.2 蓝筹指数&巨鲸&名人持仓\n\n* Something Token的蓝筹指数为24.87%（数据来源：coniun）\n\n\n* 巨鲸有34个（数据来源：NFTGo，巨鲸定义为持有的NFT价值超过$1M）\n\n> 以下为部分已知的巨鲸&名人持仓：\n>\n> * 888（@crypto888crypto），持有105个\n> * Fvckrender（@fvckrender），持有30个\n> * wave（@0xWave），持有16个\n> * SteveAoki（@steveaoki），持有10个\n> * ben.eth（@eth_ben），持有10个\n> * Redlioneye.eth（@redlioneye13），持有9个\n> * Mcanical · fik.eth（@mcanical），持有8个\n> * JRNY CLUB（@JRNYclub），持有6个\n> * 0xMunger.eth（@0xMunger），持有6个\n> * PAM （@cryptophilip），持有5个\n> * Umar Kamani（@UmarKamani），持有2个\n> * 275.eth（@DegenApeLife），持有2个\n> * Bharat Krymo（@krybharat），持有1个\n\n### 2.3 NFT二级交易情况\n\n![](https://miro.medium.com/max/1400/1\\*jrSPoUNoqZeK8yt8dXjaSA.png)\n\nSomething Token于4月初发售，在发售后一个月不到的时间内仅mint了几百个。然而在创始人Frey暗示Something Token仅有1个ETH的交易量但被Opensea添加了**蓝标认证**后，剩余的几千个在5月3日全部mint完，并且随着当天融资信息的公布，地板最高达到0.8E左右。\n\n由于有4个稀有度等级（Common, Rare, Epic, Legendary），在开图后地板大幅回调，近一个月各个稀有度等级的NFT均呈现下降趋势（成交价格分布如上图所示）。截止2022年6月4日，各个等级的地板价如下：\n\n* Common: 0.065\n* Rare: 0.14\n* Epic: 0.4\n* Legendary: 1.3\n\n当前Common等级的地板价已破发，低于公售价格（0.069）。\n\n## 3. 官方运营事件\n\n### 3.1 已发生的运营事件\n\n* 5月4日：宣布融资信息；Something Token开图\n* 5月7日：Something Token Holder抽奖，抽了一个Moonbird #9049（\\~25ETH）；公布stacking机制\n* 5月10日：Moonbird开奖，抽奖使用了基于polygon的合约，整个开奖过程透明\n* 5月13日：第一次AMA；公布团队成员推特\n* 5月15日：抽奖抽了一个Doodles，同样通过合约抽奖，5月19日开奖\n* 5月25日：抽奖抽了一个Probably nothing，5月28日开奖\n* 5月27日：第二次AMA；并公布了Something Token的utility\n* 6月4日：宣布赞助了两个今年NFT NYC的活动\n\n### 3.2 未来运营事件预期\n\n* 每双周AMA\n* 6月会参加NFT NYC并现场演示Americana的机制和交易过程\n* 持有者空投\n* 预计今年夏天上线Americana marketplace\n\n## 4. 个人分析\n\n### 4.1 对Americana团队的看法\n\n我个人对Americana团队的信任程度较高，认为rug风险较低，主要体现在：\n\n（1）核心成员Frey和Terp都有比较丰富的NFT经验，并且从Frey公开的信息中得知他曾为Apple Pay，Twitter等知名产品工作（可能是类似产品经理的岗位），因此个人对Americana的产品研发持一个乐观的态度。\n\n（2）Americana有资方（Reddit创始人、Opensea、rapper Future等）和明星、NFT巨鲸背书（888、SteveAoki等），一二级收入均打入社区钱包且公开透明，当前还有750+ETH以及690万美元融资，项目方短期内可能不缺资金。\n\n（3）从过往运营事件来看（虽然还不多），基本都按照既定的时间来交付，暂时没有看到跳票。从Discord、推特等互动反馈来看交付的质量比较好，相关的公告和文档说明可以看出是有统一标准和管理的。\n\n（4）整个5月抽了三次比较大的奖（Moonbird、Doodles、Probably Nothing），总价值约为40\\~50ETH，均是从二级购入后即发布抽奖信息。这几次抽奖所有过程都是公开透明，项目方会公布有效的地址列表（包括了稀有度加权计算明细）上传至IPFS存储，并且开奖过程通过智能合约来执行，增强了抽奖可信度，也可以看出项目方技术水平和效率很高，也舍得花钱。\n\n![](https://miro.medium.com/max/1400/1\\*qFIS2VPyWaE6YDgiDErzWw.png)\n\n（5）从发售完毕截止目前，项目方没有做过大型的营销活动，主要是创始人Frey和Terp在推特上发起Something token的NFT抽奖，以及和一些大v互动。无论是抽奖还是个人观点，推特互动数据都比较好，转赞评总数基本上都在三位数，抽奖的互动可以达到四位数（但是也不排除买互动数据、机器人的可能性，暂没有深挖）。\n\n（6）官网的设计比较一般，项目方在官网释放NFT的utility信息时留有悬念，关键信息还未释放出，给了大家想象空间。\n\n![](https://miro.medium.com/max/1400/1\\*UMkaQJ3RIbQbzeecrDL4xw.png)\n\n（7）从官方第一次AMA信息得知，Americana的部分dev是世界顶尖水平的，将会构建庞大的生态系统。芯片是Java定制芯片，dev目前正在开发公钥和私钥。\n\n### 4.2 对Something Token价格、价值及赛道的看法\n\nAmericana打算做一个IRL的NFT marketplace，而Something Token我个人将其定位成Pass卡类的NFT，因此他与常规的小图片不同，会更加注重于产品上线后的实用功能和权益。\n\n核心产品暂未上线，加上当前整体NFT市场环境来看，在没有重大利好的情况下，短期内Something Token的价格会处于低位横盘的状态，且项目方短期内也还没有重大的营销计划。从筹码结构，蓝筹指数和巨鲸持有数据来看，在未来没有重大利空的情况下，个人对其价格上涨持一个乐观的态度。\n\nAmericana计划的IRL NFT交易市场以及将实体物品NFT化这个想法比较创新，有很大的想象空间，且市面上暂时也没看到有力的竞争对手（可能是我还不知道），IRL的NFT赛道还处于蓝海阶段，如果能出圈可能会带来NFT玩家的指数级增长。但另一方面，IRL物品NFT化并且进行交易这个需求是否会被web2用户认可还有待考证，对于奢侈品、收藏品、艺术品来说可能会产生一定需求，具体落地可能出现的问题有：NFTA芯片是否会造假/丢失/掉包；芯片和交易的稳定性；对于web2用户准入门槛较高，需要科普一定区块链知识等。\n\nOpensea作为Americana的资方，将来有可能会接入Americana生态系统，并且此前Opensea推出Seaport协议，想象空间也很大。\n\nAmericana会在今年6月的NFT NYC上现场演示交易demo，届时可以关注一下。\n\n## 5. Americana相关链接\n\n‣ Americana 官网:\n\n[https://americana.io/](https://americana.io/)\n\n‣ Probably Nothing OpenSea:\n\n[https://opensea.io/collection/probablynothingnft](https://opensea.io/collection/probablynothingnft)\n\n‣ Something Token OpenSea:\n\n[https://opensea.io/collection/somethingtoken](https://opensea.io/collection/somethingtoken)\n\n‣ Americana 官推:\n\n[https://twitter.com/AmericanaNFT](https://twitter.com/AmericanaNFT)\n\n‣ Probably Nothing 官推:\n\n[https://twitter.com/probablynthng](https://twitter.com/probablynthng)\n\n‣ Something Token 官推:\n\n[https://twitter.com/SomethingToken](https://twitter.com/SomethingToken)\n\n## 免责声明\n\n**以下报告根据公开数据和信息进行整理分析，报告中的数据有效期截止时间为2022年6月4日，部分信息和观点可能是带有主观性的推测，大概率是错误的，不作任何投资建议，也不对任何投资结果负责，仅作为信息分享，也希望和大家多交流意见，DYOR。**\n\n## 版权信息\n\n**转载必须保留作者署名，并注明出处。**", "timestamp": 1654529836, "digest": "bxWrr1co2EpPg-r2t6_UUFDRRb1-NeO6Zj79JP7PSA4", "contributor": "0xa04190CDB2703Edc445594f60787b442EbbB2aC6"}
{"id": "iQ1RHlc4xFc9y5AdX7xpsa3WX8ux-3ZkGV8fOItVuS0", "title": "لایه 2 چیست؟", "body": "![](https://images.mirror-media.xyz/publication-images/UdHiONlPBVtw3kexSZ5ne.png?height=1500&width=3000)\n\nاصطلاحات \"Layer2\" یا \"L2\" نمونه هایی از اصطلاحات تخصصی وب 3 هستند که اگر در این فضا تازه کار هستید درک آنها دشوار است. خوشبختانه، L2 یک مفهوم نسبتاً ساده است که فقط با درک مقدماتی از چیستی شبکه‌های بلاکچین معنا پیدا می‌کند. اگر در این مورد نیاز به تجدید نظر دارید، مقاله ما را در مورد [درک شبکه ها](https://learn.zapper.fi/articles/understanding-networks) بررسی کنید.\n\nاین مقاله قصد دارد شفاف‌سازی را در مورد اینکه لایه ۲ چیست و L2 چه نقشی در ماشین مجازی اتریوم (EVM) ایفا می‌کند، ارائه دهد.\n\n**تعریف فنی در مقابل تعاریف عامیانه از لایه 2**\n\nبه یاد بیاورید که شبکه ها سیستم های به هم پیوسته ای از افراد یا چیزها هستند و در علم کامپیوتر، شبکه ها به سیستم های فنی اطلاق می شود که کامپیوترها را به هم متصل می کنند. اینترنت یک برنامه کاربردی است که بر روی زیرساخت شبکه اصلی رایانه های متصل ساخته شده است، و برنامه هایی مانند Google و Facebook لایه سوم دیگری هستند که بر روی زیرساخت اینترنت ساخته شده اند.\n\nدر وب 3، لایه های شبکه اصلی (یا لایه 1)، شبکه های بلاک چین هستند. بنابراین، یک L2 یک سیستم، برنامه یا پروتکلی است که بر روی لایه های اصلی شبکه ساخته شده است. این تعریف از نظر فنی دقیق است، اما ممکن است کمی گیج کننده باشد، زیرا استفاده روزمره از اصطلاحات لایه 2 و L2 در وب 3 در درجه اول به شبکه های بلاک چین ثانویه ساخته شده بر روی اتریوم اشاره دارد، نه صرفاً برنامه ها و پروتکل های ساخته شده در بالای شبکه اتریوم یا شبکه های بلاک چین لایه 1\n\n**مقیاس پذیری اتریوم با L2**\n\nگفتمان فعلی وب 3 پیرامون لایه 2 به شبکه های بلاک چینی که بر روی اتریوم ساخته شده اند اشاره دارد زیرا L2 ها به عنوان راه حلی کلیدی برای یکی از بزرگترین مشکلات EVM در نظر گرفته می شوند: مقیاس پذیری.\n\nبا پذیرش گسترده وب 3، میزان تراکنش‌هایی که در شبکه اتریوم انجام می‌شود، افزایش چشمگیری پیدا می‌کند. افزایش ترافیک شبکه به معنای رقابت بیشتر افراد برای فضای بلوک است که منجر به هزینه های گاز بیشتر برای استفاده از شبکه می شود. مهندسان در حال آزمایش راه حل های مختلف برای کمک به حل این مشکل مقیاس بندی هستند. لایه 2 یکی از این راه حل ها است.\n\nلایه‌های ۲ که به مقیاس‌پذیری اتریوم کمک می‌کنند، شبکه‌هایی هستند که مکانیسم امنیت و اجماع خود را از اتریوم می‌گیرند، اما برای دریافت و پردازش تراکنش‌ها با استفاده از سرور یا خوشه‌ای از سرورهای خودشان ساخته شده‌اند که از گره‌های اصلی اتریوم متمایز هستند. L2 ها با ارائه گزینه های تراکنش بیشتر به کاربران کمک می کنند تا برخی از محدودیت های ظرفیت اتریوم را کاهش دهند، در حالی که همان استاندارد بالای امنیت و عدم تمرکز ارائه شده توسط اتریوم را حفظ می کنند. یکی دیگر از مزایای استفاده از L2 این است که هزینه های گاز مرتبط با شبکه های لایه 2 به طور قابل توجهی کمتر از هزینه های گاز در شبکه اصلی است.\n\nبرخی از نمونه های محبوب شبکه های لایه 2 عبارتند از: Arbitrum،  dYdX، Metis Andromeda و Optimism. برای مشاهده لیست طولانی تر L2 ها و همچنین برخی آمار در مورد آنها می توانید به این [وب سایت](https://l2beat.com/) مراجعه کنید.\n\n**صبر کنید!!! من فکر کردم پالیگان (Polygon) یک L2 است؟**\n\nتمایز خوبی بین L2 و زنجیره جانبی وجود دارد و پالیگان (polygon)یک زنجیره جانبی است. زنجیره‌های جانبی شبکه‌های بلاک چین متمایز هستند که کاملاً بر پایه اتریوم هستند و با یک پل دو طرفه به شبکه اصلی (مینت) متصل می‌شوند. آنها به جای اینکه بر روی اتریوم ساخته شوند، به موازات اتریوم اجرا می شوند.\n\nزنجیره‌های جانبی نیز مکانیسم‌های امنیتی و اجماع خاص خود را دارند، بنابراین نسبت به اتریوم می‌توانند امنیت و غیرمتمرکز کمتری داشته باشند. ایده خوبی است که قبل از انجام تراکنش‌های یک زنجیره جانبی، درک کاملی از نحوه عملکرد یک زنجیره جانبی داشته باشید، زیرا تضمین نمی‌شود که در صورت تراکنش مکرر در شبکه اصلی (مینت)، از همان سطح امنیتی که ممکن است به آن عادت داشته باشید، داشته باشد.", "timestamp": 1654529822, "digest": "y4vh_Ctj6sGGD4GaJ3NMk1cc_4EhAzUJcUG5-el-YLM", "contributor": "0x523577070b3e578B998c6592ea9429687cb0f90e"}
{"id": "kV-RSY4P_wJ3jtDgPRGr3uODcZcWHMUDUNPSo4uxFEc", "title": "test", "body": "тестовый тест", "timestamp": 1654530022, "digest": "g2Vi6U-7nBRmGnjsWqOfKTTLzM9vvERyexT3ul9iIUc", "contributor": "0xB852790c99b297397875cEab449edC1350659c8E"}
{"id": "niKk_dGbNWmtRzHY3AAyjxD8PKTyLMBpcZRpSy2ePm8", "title": "لایه 2 چیست؟", "body": "![](https://images.mirror-media.xyz/publication-images/UdHiONlPBVtw3kexSZ5ne.png?height=1500&width=3000)\n\nاصطلاحات \"Layer2\" یا \"L2\" نمونه هایی از اصطلاحات تخصصی وب 3 هستند که اگر در این فضا تازه کار هستید درک آنها دشوار است. خوشبختانه، L2 یک مفهوم نسبتاً ساده است که فقط با درک مقدماتی از چیستی شبکه‌های بلاکچین معنا پیدا می‌کند. اگر در این مورد نیاز به تجدید نظر دارید، مقاله ما را در مورد [درک شبکه ها](https://learn.zapper.fi/articles/understanding-networks) بررسی کنید.\n\nاین مقاله قصد دارد شفاف‌سازی را در مورد اینکه لایه ۲ چیست و L2 چه نقشی در ماشین مجازی اتریوم (EVM) ایفا می‌کند، ارائه دهد.\n\n**تعریف فنی در مقابل تعاریف عامیانه از لایه 2**\n\nبه یاد بیاورید که شبکه ها سیستم های به هم پیوسته ای از افراد یا چیزها هستند و در علم کامپیوتر، شبکه ها به سیستم های فنی اطلاق می شود که کامپیوترها را به هم متصل می کنند. اینترنت یک برنامه کاربردی است که بر روی زیرساخت شبکه اصلی رایانه های متصل ساخته شده است، و برنامه هایی مانند Google و Facebook لایه سوم دیگری هستند که بر روی زیرساخت اینترنت ساخته شده اند.\n\nدر وب 3، لایه های شبکه اصلی (یا لایه 1)، شبکه های بلاک چین هستند. بنابراین، یک L2 یک سیستم، برنامه یا پروتکلی است که بر روی لایه های اصلی شبکه ساخته شده است. این تعریف از نظر فنی دقیق است، اما ممکن است کمی گیج کننده باشد، زیرا استفاده روزمره از اصطلاحات لایه 2 و L2 در وب 3 در درجه اول به شبکه های بلاک چین ثانویه ساخته شده بر روی اتریوم اشاره دارد، نه صرفاً برنامه ها و پروتکل های ساخته شده در بالای شبکه اتریوم یا شبکه های بلاک چین لایه 1\n\n**مقیاس پذیری اتریوم با L2**\n\nگفتمان فعلی وب 3 پیرامون لایه 2 به شبکه های بلاک چینی که بر روی اتریوم ساخته شده اند اشاره دارد زیرا L2 ها به عنوان راه حلی کلیدی برای یکی از بزرگترین مشکلات EVM در نظر گرفته می شوند: مقیاس پذیری.\n\nبا پذیرش گسترده وب 3، میزان تراکنش‌هایی که در شبکه اتریوم انجام می‌شود، افزایش چشمگیری پیدا می‌کند. افزایش ترافیک شبکه به معنای رقابت بیشتر افراد برای فضای بلوک است که منجر به هزینه های گاز بیشتر برای استفاده از شبکه می شود. مهندسان در حال آزمایش راه حل های مختلف برای کمک به حل این مشکل مقیاس بندی هستند. لایه 2 یکی از این راه حل ها است.\n\nلایه‌های ۲ که به مقیاس‌پذیری اتریوم کمک می‌کنند، شبکه‌هایی هستند که مکانیسم امنیت و اجماع خود را از اتریوم می‌گیرند، اما برای دریافت و پردازش تراکنش‌ها با استفاده از سرور یا خوشه‌ای از سرورهای خودشان ساخته شده‌اند که از گره‌های اصلی اتریوم متمایز هستند. L2 ها با ارائه گزینه های تراکنش بیشتر به کاربران کمک می کنند تا برخی از محدودیت های ظرفیت اتریوم را کاهش دهند، در حالی که همان استاندارد بالای امنیت و عدم تمرکز ارائه شده توسط اتریوم را حفظ می کنند. یکی دیگر از مزایای استفاده از L2 این است که هزینه های گاز مرتبط با شبکه های لایه 2 به طور قابل توجهی کمتر از هزینه های گاز در شبکه اصلی است.\n\nبرخی از نمونه های محبوب شبکه های لایه 2 عبارتند از: Arbitrum،  dYdX، Metis Andromeda و Optimism. برای مشاهده لیست طولانی تر L2 ها و همچنین برخی آمار در مورد آنها می توانید به این [وب سایت](https://l2beat.com/) مراجعه کنید.\n\n**صبر کنید!!! من فکر کردم پالیگان (Polygon) یک L2 است؟**\n\nتمایز خوبی بین L2 و زنجیره جانبی وجود دارد و پالیگان (polygon)یک زنجیره جانبی است. زنجیره‌های جانبی شبکه‌های بلاک چین متمایز هستند که کاملاً بر پایه اتریوم هستند و با یک پل دو طرفه به شبکه اصلی (مینت) متصل می‌شوند. آنها به جای اینکه بر روی اتریوم ساخته شوند، به موازات اتریوم اجرا می شوند.\n\nزنجیره‌های جانبی نیز مکانیسم‌های امنیتی و اجماع خاص خود را دارند، بنابراین نسبت به اتریوم می‌توانند امنیت و غیرمتمرکز کمتری داشته باشند. ایده خوبی است که قبل از انجام تراکنش‌های یک زنجیره جانبی، درک کاملی از نحوه عملکرد یک زنجیره جانبی داشته باشید، زیرا تضمین نمی‌شود که در صورت تراکنش مکرر در شبکه اصلی (مینت)، از همان سطح امنیتی که ممکن است به آن عادت داشته باشید، داشته باشد.", "timestamp": 1654529724, "digest": "AteqAAfHcuCyB-cRuSxmuGgXjKmrzCLX4BHjfzToaRo", "contributor": "0x523577070b3e578B998c6592ea9429687cb0f90e"}
{"id": "p2r263eqdNFg3D588cbXrlEFS7BZJFsswNRimgy2RSc", "title": "Photo Walk 001 - Testing my XA2", "body": "## \n\n## Testing A New Camera\n\nRecently I bought a new (old) camera, an Olympus XA2. I primarily shoot medium format film for most of my work, but I was looking for a compact but high quality 35mm point and shoot to add to my kit.\n\n![my \\*rare\\* blue olympus XA2](https://images.mirror-media.xyz/publication-images/gHP_1ZOMTLfqAgA9PCURB.JPG?height=1152&width=1440)\n\nThe XA2 checks all the boxes for me, and I found a really cute blue one so I decided to pull the trigger. I am headed to NYC later this month and really needed to snag a camera and properly test it beforehand. I don’t want to get too nerdy about why the XA2 is a good fit for me but this camera slides into my workflow in a way that not a lot of 35mm cameras can. I use a medium format range finder for most of my work, and because of that I end up zone focusing a lot. The XA2 is a zone focus system so it makes sense for me, and fits into my workflow so perfectly. I’ll get into the zone focus a little more later. So if you’re not sure that that means, sit tight. <3\n\n### Test Roll One\n\nThe day this camera came in the mail I flew to the local camera shop after work to grab some batteries and a roll of 35mm film (Ilford FP4+ to be specific) and then quickly headed back to my house to rip apart the box that was lovingly packaged and sent all the way from Japan.\n\nI was supposed to climb at a local crag with some buddies that evening, so I figured I’d just quickly fire off a roll and develop it when I got home later. Low-stress first roll. I just wanted to make sure everything worked.\n\n![a type of photo lovingly called 'first of the roll' // light leaks from loading the film obscure a portion of the first frame ](https://images.mirror-media.xyz/publication-images/anzoehKE6ekG39b5hte-w.jpeg?height=2136&width=2670&&&&size=medium)\n\nI really had barely looked at a manual for the XA2 online before I loaded up a roll of film, snapped a few shots in the backyard and then headed to go climb. I really only wanted to make sure the camera actually worked, I wasn’t too hung up on the roll being full of great pictures or even a single good picture. My main concerns were:\n\n* Does the meter work properly\n* How the fuck does zone focus work on this thing\n* How do photos look with flash during golden hour and blue hour (my fave time to shoot with flash)\n\n![the trail to IJAMs crag in Knoxville, TN ](https://images.mirror-media.xyz/publication-images/R5NsEOakjk5QraeHHxMns.jpeg?height=3204&width=2136)\n\n![my good friend Cai posed for a picture for me at the bottom of our favorite wall at IJAMs ](https://images.mirror-media.xyz/publication-images/uIK7r3k2mR5ghvLV8kAGI.jpeg?height=2660&width=2128)\n\n![practicing with flash; caught my friend John off guard a little ](https://images.mirror-media.xyz/publication-images/DL6qoEkNIh57PpLijdGGR.jpeg?height=2640&width=2112)\n\nOverall I was very happy with my quick first roll through this camera. When I did get the focus right, the lens is very sharp, and the in-camera meter worked really well for most of the scenes I shot. This was incredibly encouraging because the main reason I purchased this camera was to have something that was easy to use for quick snapshots but still capture high quality images. The fact that I was able to do this on my FIRST roll with the camera was the indicator that I needed. I already felt that this camera was going to be the perfect addition to my kit. I definitely did not shoot many great images on the first roll, but that is totally okay. Like I mentioned at the beginning, making great images was not my main focus. I just wanted to make sure the camera worked. However, I do want to share my favorite failures from the first roll and what I learned from them.\n\n![my favorite failures from my first roll ](https://images.mirror-media.xyz/publication-images/-lTOskX4Wj-uHVYk6w884.jpg?height=800&width=617)\n\nThe main issue that I knew I would have with this camera lies within the zone focus mechanics. Most 35mm point and shoots have an autofocus system, but I have never found a point and shoot that has an autofocus that cooperates with the way that I typically shoot. The XA2 has a zone focus, which means I have to manually select the focus. There are three focus ranges to choose from: 1 meter to 1.5 meters, 1.2 meters to infinity and 2.5 meters to infinity. Lots of overlap, lots of confusion for me. I didn’t know what was going to work for what types of scenarios. This has been the hardest part for me to understand and get right, especially on roll one. On the top image, I chose the closest zone (1 meter to 1.5 meters) and it was a little out of focus. The middle focus option would’ve been the better choice. For the bottom image, I accidentally left it on the middle zone (1.5 meters to infinity). I figured this would be okay since **technically** it should focus all the way to infinity right? Nope!! I know this now. I was very excited about both of these images so I was pretty bummed when they were out of focus, but thats why I set low expectations for the very first roll. I can only exceed them at that point.\n\nAll in all, very impressed with the camera and how quickly I got the hang of shooting it. It fit the task I had given it, and I was excited to continue to improve my abilities with it.\n\n### Test Roll Two\n\nThis past Thursday I found myself testing positive for Covid.. after a few days cooped up in the house I decided it was time for a walk. My neighborhood doesn’t have a lot of foot traffic so I figured my chances of coming into contact with someone was pretty slim. I also wanted to shoot one more quick test roll on the XA2. After the first roll I felt as if I had a great understanding of the camera and I wanted to shoot one more quick roll before I shot any serious work with it or shot any color film (its expensive!!). \n\n![a patch of flowers in a field near my house ](https://images.mirror-media.xyz/publication-images/m3Frt1oqHRksAtDBt7chg.jpeg?height=1682&width=2523&&&size=medium)\n\nI went out to shoot around 2/3 pm so the sun was still very bright. I figured this was a great chance to test out how the in camera light meter did with direct sunlight and high contrast situations. I also needed to try my luck with the zone meter again, especially with photos in that weird range between 1.5 meters and 2.5 meters. I wasn’t expecting much from this roll. I was sick and just needed to get out and take a walk and put the XA2 through some final little tests. However, I was really happy with few images from the roll. The above image of the little flower patch tucked into the tall grass was my absolute favorite. The flowers are glowing and it really separates them from the grass in the background, exactly the kind of look I was going for when I shot the image. Gonna share a few more of my favorite images below, really snagged a lot of photos I was happy with :) \n\n![testing the XA2's meter in a high contrast situation ](https://images.mirror-media.xyz/publication-images/sBQF0FicdAA0R-8IeJGqk.jpeg?height=2144&width=3312&&&size=medium)\n\n![southern suburbia // the XA2's meter really did well with these scenes ](https://images.mirror-media.xyz/publication-images/1uAINfQ3x3sH9oza5CtUy.jpg?height=898&width=1432&size=medium)\n\n![getting the hang of zone focus ](https://images.mirror-media.xyz/publication-images/edpaoHavPgc23YcyEsmm9.jpg?height=619&width=800&size=medium)\n\nI did not even shoot a full roll of 35mm but I feel as if I totally got the hang of all the techniques I struggled with on the first roll. The learning curve for this camera is so minimal, I am very impressed. One of the only cameras I have gotten great results with almost immediately. Plus, I have not even shot any serious work with the camera. Thus far it has only been casual test rolls, I am beyond excited to start experimenting and making lots of work with this camera. \n\nThe meter behaves exactly as I would expect it to when shooting high contrast scenes. The first image is a really good example of that. Shadows are quite dark but I was still able to get a lot of detail despite that. This is especially important to note for when I am taking portraits in similar lighting conditions and may need to add some extra light to my subjects face. The meter also nailed the exposure for the suburban scenes. The sky did not get overexposed and all the darker areas of the photo still have lots of detail as well. The balance is absolutely perfect. Also, when shooting with color film I will be able to get even more detail in the darker areas, so I am very excited to put a few rolls of color film through this camera. \n\nI also nailed the zone focus with this camera finally. I made a few mistakes still, but I am very proficient with the focus mechanics now. The focus mechanics give me a lot more confidence than I normally have with an autofocus point and shoot, so I will be using this camera a lot more than I have used my point and shoots in the past! \n\n### Closing Thoughts \n\nThe XA2 was the perfect purchase for me, it fits right into my shooting process and has already produced great images for me in a casual setting. I think this will help me make more photos and shoot more often! This is the camera I needed to revitalize my shooting process and get me excited to make new work again. Sometimes all you need is a new camera, so if you’re thinking of buying one.. DO IT!\n\nIt has been a lot of fun to walk through my shooting process this way, and I am very excited to see how this blog style format evolves for me. If you made it this far, thank you so much! I have always enjoyed writing but it has not been something that I practice often. But, I am determined to write a few of these each month. It is helpful for me to think about photography like this and I love utilizing mirror and the blockchain in this way. Web3 kinda cool :) ", "timestamp": 1654529686, "digest": "AQp5m6aL3gY3KUb8EB9Vy9s4pBNNh8Gb_-Ut-u3JHgU", "contributor": "0xB8a7d78021A83fb29263D0c121C839C96CF07Fc6"}
{"id": "T2JesjwPGNgxClEN4zNf6r6bKtOmJT9RkciTF71pFus", "title": "Don't use tactical busyness to cover up strategic laziness", "body": "Life is full of illusion. Maybe your busy is just lazy.\nWhen I first entered new Oriental, my one hour class fee was 140 yuan. Don't think it's too much. Just listen to me.\nThe tuition fee for students is 650 yuan per hour.\nAt that time, I just graduated. In order to make a living, I began to live ten hours a day. From sitting in the classroom at 8:30 in the morning to coming out at 9:00 in the evening, it is often a whirlwind.\nI work hard in class and speak fast. In order to enable students to receive the maximum amount of information in the shortest time, I often beat chicken blood. Sometimes I am afraid of sleepiness and even don't eat at noon.\nThere is no doubt that the mobile phone must not be turned on during class.\nBefore my parents called, they asked me if it was convenient for me? I said it was convenient, so I called; I have almost no time for friends to ask me. Many friends go farther and farther; No time for physical examination, the body is getting worse; The most interesting thing is that my girlfriend let me choose: ten hours a day or me.\nI said, how can you let me choose like this.\nShe said, do you choose.\nI hurriedly said, choose you.\nThe next day, I went to class for another ten hours.\nIn fact, in the end, I attributed the reason why we broke up to being too busy. I was too busy all day long to entertain and improve myself. I was too busy to spend time with my friends and her.\nHowever, until today, I have said goodbye to the crazy class state at that time. In retrospect, I was not busy, but lazy.\nI am too lazy to deal with work and interpersonal relationships, to change my life state, and to think about why I am so busy.\nLater, two other teachers and I resigned from New Oriental. We started our business together. That year, we had nothing, three people, three mouths and three hearts. Because we have reduced the intermediate steps, we have reduced the tuition fees of students. We find our own platform, prepare lessons collectively, recruit students, and then give lectures. Everything is not very tired. However, we have a lot of time to be liberated. The most important thing is that our salary is not only not less, but also several times more than before.\nNow, we have set up the CET-4 and CET-6, and have created a public welfare class with 199 yuan and 120 class hours, and all teaching materials are mailed. There are more and more students enrolled. There are more than 10000 students a month. As for ourselves, the salary has not decreased. The most important thing is that we have been liberated a lot of time and are not so busy.\nThere is an old Chinese saying, it's called busy and needy.\nIt means that the poorer the busier the busier. Those who are thinking and planning every day are the masters of life. They will not become slaves of the years. They will be led away by others all day and get tired.\nOn the contrary, those who have no time to plan and are unwilling to change are busy and tired. Busy is just lazy to think about why you are so busy, lazy to struggle with how to change the state of life, lazy to plan the next step.\nThink of your friend Jingjing.\nShe was a hard-working woman who never worked overtime after work and adjusted her work life very well.\nBut a few days ago, she broke up suddenly.\nShe constantly fills her life with work. She works overtime until 11 o'clock every day, dragging her tired body to work. She reduces social activities and even refuses the League building of her colleagues.\nLater, she made herself very tired, and her friends became indifferent to her one by one.\nWhen I saw her, she had acne all over her face and her eyes looked like giant pandas. She kept complaining about how busy I was.\nI said, you are just lazy.\nShe said, why do you say so? Do you know how hard I work.\nI said, you are too lazy to socialize, too lazy to think about why you broke up, and too lazy to face the feelings you lack in your heart.\nShe was stunned.\nLater, she finally began to socialize. She was not so tired. At a party, she found a boyfriend.\nThen again, the less busy state was restored.\nNow, occasionally I can ask her for tea.\nIn this world, there is a thing called the temperature of life. When you do something to the extreme and boring, have you ever thought that you are actually killing your love for it? When you are too tired and too busy, have you ever thought about changing your mind and direction to walk or take a rest, so that your efficiency will be higher.\nBeing dragged along by life all day, like being wound up, gradually forgets the power of thinking, and then forgets the reason for starting.\nLife is like this. In fact, you can slow down and enjoy the scenery around you. Perhaps it is more difficult to relax and make people comfortable than to get busy.\nPlan well and run again. Don't be lazy in thinking and planning. You will get nothing but fatigue in the end.", "timestamp": 1654529758, "digest": "Ur51KoPoydCUdy0wPnSIX6nUmpnadWeM53GdGI-Qj1Y", "contributor": "0xA559B99FFf2088750CA474D6001ec0E95DE5e63A"}
{"id": "u0SGITyYcpFPDBdtgD6K6ARxJrngUTHRf6admvLmcIE", "title": "YDF｜藏家奖励机制公布", "body": "随着Day 90烟花的揭晓，《你的白天烟花》的燃放过程已圆满完成，但它的生命周期仍将持续，我们还会将《你的白天烟花》以不同的形式带到更多的人群面前。为感谢大家对《你的白天烟花》的支持，我们选择在「蔡日历」的最后一天发布奖励机制，以#TheTRLabWay 回馈我们的忠实藏家。\n\n## 收藏了全套90款不同烟花的藏家们\n\n### 你们将从TRLab获得 (由TR承担费用)：\n\n* 一件蔡创作的纸上火药绘画（价值约10,000美金，由TRLab购买)\n* 将会获得参与蔡未来的线下展览观展旅程的独家机会\n* 在接下来TRLab Membership中享有惊喜福利（即将公布）\n\n### 你们将从蔡工作室获得：\n\n* 如果持续收藏这些作品，将获得邀请参加蔡在世界各地举办线下活动的开幕式\n* 在Discord中享有专属频道\n\n## 《想象这样的》的藏家们\n\n### 你们将从TRLab获得 (由TR承担费用)：\n\n* 由蔡亲笔签名的《天梯》系列版画（价值约1,500美金，由TRLab购买）\n* 在接下来TRLab Membership中享有惊喜福利（即将公布）\n\n### 你们将从蔡工作室获得：\n\n* 如果持续收藏这件作品，将获得邀请参加蔡在世界各地举办线下活动的开幕式\n* 在Discord中享有专属频道\n\n## 收藏齐一套9件特别款烟花的藏家们\n\n### 你们将从TRLab获得 (由TR承担费用)：\n\n* 获得一次蔡未来线下展览的观展机会\n* 在接下来TRLab Membership中享有惊喜福利（即将公布）\n\n### 你们将从蔡工作室获得：\n\n* 由蔡签名的小礼品\n\n## 拥有一件或以上烟花的藏家们\n\n### 你们将从TRLab获得 (由TR承担费用)：\n\n* 有机会参加抽奖获得蔡未来线下展览的观展机会\n\n\n* 在接下来TRLab Membership中享有惊喜福利（即将公布）\n\n为致敬2021年7月14日蔡老师于TRLab发布的首件NFT作品《瞬间的永恒——101个火药画的引爆》，我们将于2022年7月14日香港时间晚上10点进行此次奖励的快照，衷心感谢关心《你的白天烟花》和TRLab的所有朋友们！", "timestamp": 1654529986, "digest": "lgQkkJf1wDwAb0STtDz9T0bS92puCEvjUt47nMEAF7Q", "contributor": "0x442F8c3C4f8Ac46790c7fFB1D78F30F17BF73091"}
{"id": "uTYhNP7sxIPHjGLjzJL2wzxoH6DucPJZwI4SME76Ops", "title": "Introversion is not a mistake, but a gift from God", "body": "I am an introvert. When I was young, my mother said that before I was five years old, I had never taken a step alone. Every time I met a stranger, I kept hiding; After school, from primary school to middle school to college, I never liked the lively scene. I would rather sit quietly with a book in my hands; After work, I prefer to be alone on weekends and holidays in addition to necessary social activities at work. Even now, every weekend, I like to stay at home, reading, writing, learning, baking, taking photos... Immersed in my own world. I especially like the feeling of retreating from the crowd and being alone with myself. For introverts, immersion in their own world is a pleasure.\nHowever, I also know very well that while I enjoy my own world alone, I am also troubled by my own personality (I believe most introverts will have such a worry). After all, modern society is in such a value system as \"extroverted and ideal\", and all people hope that they are talkative and cheerful when they get along with others. Introverts live under the influence of extroverted ideality, just as women live in a male dominated social value form, their own value is greatly reduced.\nSo, many times, I began to force myself to change and make myself more outgoing. In the years after graduation from University, I have been engaged in media work, which requires skilled communication skills and strong writing skills. My specialty is writing, but communication is my weakness. But work is work. You must overcome your weaknesses. I still remember the anxiety and entanglement before I made an appointment with someone (especially the interviewee) every time when I was at work. Facing the phone, I have recited my lines over and over, but I still dare not pick up the phone and dial the number. Now I think, the reason why I was so afraid was that I was afraid of being rejected.\nI have to say that the experience of media work in recent years has really made me grow up a lot. When dealing with all kinds of people outside, I know how to deal with and deal with them. I even feel that my working experience in the media has made some corrections to my character, adding some \"extrovert\" factors to my character.\nWhen necessary, I will become very extroverted, and even pretend to be an extrovert and very successful. During the job interview, almost every interviewer will ask \"how do you evaluate your character?\" \"Are you an introvert or an extrovert?\" And so on. I believe that no one will be proud to say that he is an introvert. On the contrary, most people will say that he is an extrovert, or that he is half introverted and half extroverted. As we all know, modern workplace work needs teamwork, initiative, communication and leadership. The characteristics of introverts almost run counter to these workplace elements. In the eyes of most people, introverts are silent, not very confident, and dare not be frank about their ideas.\nHowever, even if you disguise yourself, you have to admit that the introverted gene in your bones cannot be changed. I can cheat others, but I can't cheat my true self.\nSince he was born to be an introvert, is it also doomed that he cannot have an absolute advantage in the workplace, and is it also doomed that the road of life is mediocre? No, No. I have read some biographies of literati, and I have also learned the stories of successful people in other fields. I am deeply surprised that many successful people are fundamentally introverts. Van Gogh, Maugham, Proust, George Orwell, Mother Teresa, Buddha, chendanyan, Li Na, Zhang Yining... The loneliness brought by introversion makes them know how to communicate with their own thoughts in the depths of their souls and find treasures in that quiet world.\nIf genius is 1% inspiration and 99% perspiration, generally speaking, we tend to worship the 1% part. We love its brilliance and its sparkle like a star, but the really great power exists in the 99%. What kind of magic does loneliness have? In many fields, only when you are a person can you really devote yourself to the 99% deliberate practice, which is the key to achieving outstanding achievements.\nI have come to realize that introverts and extroverts have no advantages or disadvantages. Each character is accompanied by luck and pain. You should recognize your own character, and then give full play to the advantages of this character.\nSusan Kane from the United States is a real introvert. She wrote a Book Quiet: the competitiveness of introverts. In this book, she tells us what advantages introverts have through a large number of character interviews and psychological experiments:\n\"Introverts are often attracted by the thoughts and feelings of the inner world, while extroverts tend to pay attention to people's external life and activities. Introverts tend to focus on their meaning of the things around them, while extroverts will devote themselves to events. Introverts will charge themselves when they are alone, while extroverts will charge themselves when social activities can not meet their needs.\"\n\"Introverts are slower and purposeful in dealing with problems. They prefer to devote themselves to one thing for a period of time, which makes them more focused. Such people tend to be relatively indifferent to the temptation of money and fame.\"\n\"Introverts are not the same as hermits or world weary people. Introverts may have hermit complex, but most introverts are friendly and prefer a peaceful environment.\"\n\"Introverts do a good job in formulating and implementing plans. They will strictly follow the plans.\"\n\"Introverts seem to think more carefully than extroverts. Extroverts are more likely to take some quick ways to solve problems, replacing accuracy with speed. With the progress of the task, they will make more and more mistakes. When the problem seems to become more and more troublesome, they may become deserters. Introverts will think about it before taking action, and fully digest the information they have obtained, even if they spend time on the task For a longer time, they will not give up easily, and they will finish it more accurately. \"\n\"Introverts are also very different in managing their attention: if they are allowed to act at will, introverts tend to sit down and think about things, imagine things, recall the past, and even make plans for the future, while extroverts focus on the things around them. It can be said that extroverts are paying attention to 'what' while introverts are asking 'what will happen'.\"\n\"Introverts tend to remain rational when all the people around them are irrational. Self denial is one of the biggest assets of introverts.\"\n……\nAs an introvert, I can feel these advantages: tenacity, focus, insight, thinking... More importantly, I began to appreciate and use these advantages that only introverts have. In fact, sometimes, many extroverts also want to have these advantages of introverts. A friend of mine is a typical extrovert, but every day she has to force herself to sit at her desk and practice calligraphy for an hour to exercise her concentration and endurance. She thinks this is what she lacks.\n\"In fact, the biggest challenge faced by introverts is to face up to and make full use of their own advantages. You may be busy making yourself behave like a warm and open extrovert all day long, avoiding your own talents, and eventually being despised by others. But when you fully devote yourself to the things you care about, you will find that your energy is infinite. So, please keep your nature, if you like to step by step Steady play, then don't be influenced by others and force yourself to accelerate. If you like deep exploration, you don't have to ask yourself to pursue breadth. If you prefer single tasks to multiple tasks, stick to your position. Only by sticking to your own path can you bring unlimited power. This is the result of introverts' independence from the world. \"\nWhen I was in college, our counselor said that ten years later, those who look the least impressive in college may become the best. At that time, I didn't think so. Now, if those taciturn people in the university can find their own right direction and approach it step by step according to their own rhythm, it's not surprising that they will be a blockbuster ten years later.\nThe secret of life is to put yourself under the right light. For some people, the light that suits them is the spotlight on Broadway. For people like me, a green light is enough. I like reading and writing. These are the advantages given to me by God - when others get together to sing K, go shopping and have fun, I prefer to spend an afternoon polishing my thoughts and practicing my writing. I like baking and making desserts. I have enough patience and perseverance to study and experiment until I make my own delicious food. I enjoy the feeling of being immersed in doing what I like from morning till night. I even like to sit in a coffee shop and do nothing to make myself think aimlessly\nDo what you like to do, do meaningful things, study hard and think deeply. For introverts, this is the most correct way to live.", "timestamp": 1654529975, "digest": "R1nH0cyMEP30WC-wMFy_Rl413IFhW5z4nWTKxZW9Zvs", "contributor": "0x0881b67Ad02b930dCf005431C7472e681cc67Ef6"}
{"id": "Z93vx__yp0fTzgPmRMzPqn_6dv6xb60PTLRLI1fARa8", "title": "I won't waste my time on unnecessary people and things", "body": "Nietzsche, the representative of narcissism class, once said that why I am so smart is that I have never thought about problems that are not problems--- I haven't wasted any energy on it.\nNietzsche admitted that he never spent energy on problems that did not become problems, or even did not think about them. He only spent energy on \"valuable problems\".\nIn terms of learning knowledge, he knows what to avoid and what to abandon. He doesn't like reading in general. He doesn't think that the more books he reads, the better. He only selects the books he has problems to study. Although he hasn't established a closed and huge philosophical system, his heroic and brilliant prose, maxims and aphorisms have deeply conquered me.\nDon't waste your energy on unnecessary things. It's the best way to achieve a person. It's also a luxury bag to relieve your tired heart from getting hurt. I think so.\nI think the waste of energy is reflected in the work, which is easily disturbed by irrelevant matters; Reflected in life, it is clearly beautiful that so many people have to struggle with themselves; Reflected in interpersonal relationships, it is to entertain strangers with kindness that should have been used to treat relatives; Reflected in the feelings of men and women, it is to abandon self realization and fall into the conjecture of whether he loves me or not.\nPeople's energy is limited. Negative emotions, subjective assumptions, trivial matters and frequently ringing mobile phones, like the Eight Power Allied forces, share precious, scarce and gone time and energy.\nMany people's calloused nerve endings are not aware of the energy consumption, because these things are too taken for granted and used to. If you are tired and feel hurt, you should try to clean up some bugs that take up the toilet and the memory slowdown.\nPeople with great energy will take the initiative to avoid interference.\nIn the past five to six years of my work, my previous bosses and colleagues have given me numerous invisible plaques such as \"energy storage maniac\" and \"efficient red flag bearer\". When leaving the first company, the boss asked him to stay three times; After I parted ways with my second employer, the manager filled the vacancy with three people; Now Dianjie often praises me for my high efficiency.\nIn addition, I guarantee 3-4 books per week; I go straight to the market to buy vegetables and cook after work on most weekdays; I don't have time to go to the gym. Anyway, my three piece exercise set of elliptical machine, belly wheel and yoga mat can also help me; Even though I worked overtime in Shenzhen, I also volunteered in the reform and opening up Museum.\nMany people have asked me how to allocate my energy so well. I am shameless to conclude that my energy should not be distracted by unnecessary things. Concretely speaking:\nSet the Taobao website as a restricted site, and do not buy online during working hours;\nWhen doing important tasks that require high concentration of attention, turn the mobile phones to flight mode;\nWhen passing by the tea room, mom's help and dating groups gather to chat, they should not stay long;\nIn my spare time, I do what I like to do. The accumulated positive energy is the hard inflation for me to overcome all hardships.\nMinimize ineffective input at work\nIn the workplace, people who really live more have no time to shout tired!\nI have a good female colleague who complained to me that she was either paralyzed by work tasks without flow, or tortured by interpersonal relationships that people know but don't know, or killed her brain cells by a small script that she directed and acted by herself.\nHowever, when I passed her computer, I saw that there was a Taobao web page that had not been closed in time. Sometimes, I had to return the color difference between the bought baby and the picture. I had to play games with the store owner and contact the express for an afternoon; After she went to the toilet, she came out to wash her hands. When she went in, the person in that room flushed the toilet. She struggled for a long time whether she flushed or not; I ran into the big boss of the group before the meeting, and was very upset because it was unnatural to say hello; Her mobile phone, which is not set to silent mode, ticks all day long. She picks it up and puts it down in a cycle. If the task is not completed, she can only work overtime.\nI often find that the same group of people who brush Taobao during working hours, think about things, receive express delivery, do chores, talk about things at leisure and complain about why they don't increase their work; Those who emphasize accumulating contacts and playing office politics are also worried about the medical examination form of the third senior high school, while lamenting the depth of the workplace and the warmth of human relations.\nSocial apps like shredders cut chunks of time into fragments. The news that pops up on the web page habitually makes the spirit spread. It is even more meaningless to study leaders' preferences and colleagues' gossip. Other people's wealth will not give you half a cent for no reason, and they will not ask you for power or power. Each leader should study how to be a business expert. The story that gossip colleagues have learned all day will make the personality to be an editor of bosom friend?\nIn my opinion, if you improve your professionalism and sense of occupation, you should not throw in the quasi sunk costs, and only those who concentrate can get a golden job.\nDon't cry because you miss the sun, or even the stars will be missed.\nIn those years, I failed in the college entrance examination and was not admitted to the school I secretly loved. At that time, he encouraged himself by saying, \"if you shed tears because you miss the sun, you will also miss the moon and stars.\" and \"the sky will fall, and the people will be responsible for it.\" so he went to college.\nWhen I go to school, I often see people lamenting the failure of the college entrance examination and worrying about future employment. Amid their gloomy cries, I have already formed the angel habit of getting up at 5 a.m. to recite English and running at 7 p.m; I have done all kinds of rigorous and careful social surveys that everyone has fooled. In order to investigate the fertility views of local people, I have taken questionnaires from the family planning bureau to the streets and alleys, from gynecologists to maternity ward beds, and every data is true and reliable; I made an appointment with the school bullies to set up a science and technology project. I worked for free in the Typewriting and copying shop next to the school. I was familiar with the use of office software and hardware. I traveled half of China with the money earned from work study program when I had a holiday. After graduation, the society has not been difficult for me.\nWhen you are stuck in a setback, your misplaced energy will lead to burnout.\nSome of my good friends ended their four-year relationship because of the man's cheating. After breaking up, they drank alcohol and got gastric ulcer, and their faces were full of bags; There were some excellent schools, but they were caught taking exams for others in their junior year. The school canceled the issuance of degree certificates, which made them angry about mild depression.\nIf the former cheer up, they may meet a good feeling of catching up from behind. If the latter gathers energy and concentration, they may get a master's degree directly by taking a postgraduate exam. There are many ill fated people like Fengtang yilao and Liguang Nanfeng in this world. Sadness is an instinct. If you are sad for too long, you will put yourself in the loser Petri dish.\nFor me, self acceptance is a practice, so I simply can't bear to let myself suffer, regret, regret and helplessness. When the barren reality, ferocious faces and malicious pranks attack me, even sighing is superfluous. Turning emotional injury into energy, turning frustration into motivation and loving myself are the ultimate romance of my life.\nNietzsche said that the reason why I am so smart is that I have not wasted energy on unnecessary things, but I would like to say that I am so smart that I will not waste energy on unnecessary things.", "timestamp": 1654529842, "digest": "T3FMBfqM2hnwTfMKzlAxdaSSJ9F5AY12mS869jKKFFY", "contributor": "0x2a179511b6285D651a6d1eF9E93dd059c10D2B47"}
{"id": "ZDm6CjNIm80f1nNiZA_y3ZlXsZ3q_OHO4wFZMSGP218", "title": "Squarez: something to know before public beta.", "body": "The signal is rather simple : “buy” and “sell”. It will only make a “sell” call if it had make a “buy” call on the same collection.\n\nTo follow the signal, buy the floor when the bot tells you to buy and sell (even cut the floor if necessary) if the bot tells you to sell. I usually buy a little above the floor so that I won’t get a reverted transaction.\n\nWhen you follow the signal, also check these things out:\n\n* the reveal dates\n* If the collection is sold out (public sale phase/whitelist sale phase etc.)\n* If the collection is surely not a rug (I think my signal cannot identify if a collection is a rug or not. They could create fake hype.)\n* The volume. Sometimes it gives the signal on a collection with nearly 0 volume. It could still be a pre-pump signal but please wait until you see more volume first.\n\nOtherwise, always mind your risk.\n\nDisclaimer:\n\n1. This signal tells you when you should buy/sell. However, the real usage is “not to buy at the top” and “not to sell at the bottom.” Of course, you can earn money following the trade, but I am not responsible for any loss.\n2. It is up to you whether to follow the signal or not. Try following those signals on the paper first, and you might want to change a little bit when/how to entry and the way to exit. This is just a tool, and I am not responsible for any loss.\n3. If more and more people are using the signal, then the market structure could change, too. I’ll keep updating the signal and do the necessary if the signal can’t work anymore under the new market structure.\n\nI also accept acquisition of the signal at 200eth so that you can use it on your own. In that case, I will return the mint price to NFT holders. So, if you want to buy Squarez from secondary, mind your risk, too.\n\nMint site: https://pinner-studio.xyz\n\nMint price: 0.05 eth\n\nSquarez! twitter :\n\n[https://twitter.com/Squarez_NFT](https://twitter.com/Squarez_NFT)\n\nDiscord:\n\n[https://discord.gg/TQUJks2yDZ](https://discord.gg/TQUJks2yDZ)\n\nAuthor’s twitter:\n\n[https://twitter.com/wayne567tw1](https://twitter.com/wayne567tw1)\n\n", "timestamp": 1654529936, "digest": "MeErR77QRP2DW6jD2_bSzLweQ7EQ7PwXe0PKnWmHTMQ", "contributor": "0x7674c3d61E9764fCa0Dc2FED6c9A914Fe2d9334d"}
{"id": "ZLN9vDKSA2cAMSGa3TBuCBQaoP7tBEQ72YbSC1bwF2Q", "title": "Squarez: something to know before public beta.", "body": "The signal is rather simple : “buy” and “sell”. It will only make a “sell” call if it had make a “buy” call on the same collection.\n\nTo follow the signal, buy the floor when the bot tells you to buy and sell (even cut the floor if necessary) if the bot tells you to sell. I usually buy a little above the floor so that I won’t get a reverted transaction.\n\nWhen you follow the signal, also check these things out:\n\n* the reveal dates \n* If the collection is sold out (public sale phase/whitelist sale phase etc.) \n* If the collection is surely not a rug (I think my signal cannot identify if a collection is a rug or not. They could create fake hype.) \n\nOtherwise, always mind your risk.\n\nDisclaimer:  \n\n1. This signal tells you when you should buy/sell. However, the real usage is “not to buy at the top” and “not to sell at the bottom.” Of course, you can earn money following the trade, but I am not responsible for any loss.\n2. It is up to you whether to follow the signal or not. Try following those signals on the paper first, and you might want to change a little bit when/how to entry and the way to exit. This is just a tool, and I am not responsible for any loss. \n3. If more and more people are using the signal, then the market structure could change, too. I’ll keep updating the signal and do the necessary if the signal can’t work anymore under the new market structure.\n\nI also accept acquisition of the signal at 200eth so that you can use it on your own. In that case, I will return the mint price to NFT holders. So, if you want to buy Squarez from secondary, mind your risk, too.\n\nMint site: https://pinner-studio.xyz\n\nMint price: 0.05 eth\n\nSquarez! twitter :\n\n[https://twitter.com/Squarez_NFT](https://twitter.com/Squarez_NFT)\n\nDiscord:\n\n[https://discord.gg/TQUJks2yDZ](https://discord.gg/TQUJks2yDZ)\n\nAuthor’s twitter:\n\n[https://twitter.com/wayne567tw1](https://twitter.com/wayne567tw1)\n\n", "timestamp": 1654529716, "digest": "MeErR77QRP2DW6jD2_bSzLweQ7EQ7PwXe0PKnWmHTMQ", "contributor": "0x7674c3d61E9764fCa0Dc2FED6c9A914Fe2d9334d"}
