{"id": "cxJ1KKgXBxzj6GwAaDNWr_mggLAks84FvEBh7NQNuTI", "title": "关于稳定币，USDC 及新金融体系平台的深入研究", "body": "稳定币既是一种数字货币，也是一种平台，可以在其上构建新的应用程序或改进旧的应用程序。但要实现这一承诺，他们需要真正保持稳定。如果稳定币可以保持锚定，那么开发人员就可以开始在稳定币轨道上构建金融产品，包括全新的应用程序和金融基础设施。\n\n像 USDC 和 DAI 这样的稳定币还有一个我们还没有触及但值得强调的好处：将货币的支付功能与货币的借贷功能分开。和传统银行体系不同的是，使用稳定币，任何人都可以进入 DeFi 借贷协议并借钱以产生高于0.01% 的回报，或者他们在储蓄账户中赚取的任何东西。", "timestamp": 1659162431, "digest": "4UdoSj1LXkAYmlT7njSyr_NRmurZUGAsoPc78VEwgDw", "contributor": "0x3f8515525F48e415EB3ab0305Ae3fFB130f277a4"}
{"id": "3QGKZ1RW6GYlapybUdHR6uq6WQIN5zWiwEKW1Y_3zrk", "title": "昨日要点和今日任务", "body": "棒棒哒！୧(๑•̀◡•́๑)૭୧(๑•̀◡•́๑)૭୧(๑•̀◡•́๑)૭୧(๑•̀◡•́๑)૭୧(๑•̀◡•́๑)૭\n\n**重点**\n\nlayer2\n\n**间或刷**\n\nweb3\n\n**每日打卡事情**\n\n**一、日常打卡**\n\n**四件套**： coinmarket,coingekco,世博，\n\n**discord:** defieye，banksea\n\n**web3:**\n\nplaybux.co/quest\n\nlayer3.xyz——简单项目就做掉\n\ncarv打卡\n\n**二、浏览discord群**\n\ndefieye的日报，mirror链上达人（每日必看），以及其他几个加入的群，三大的discord有空看一下（在chrome791）\n\n**三、微博**\n\n登记邮箱，推特扔号立即处理\n\n**四、链捕手**\n\n**五、邮箱**\n\n**六、Op,metamask,matcha，zksync的论坛**\n\n**七、油管**\n\n**昨日要点和今日任务**\n\n**一、本周剩下的把七个账号的via和cbridge完成——差第七**\n\n**二、本周主做layer2**\n\n**早上做新钱包aptos和sui，下午做rainbow钱包和L2网络——看网络情况**\n\n教程：\n\n[Bankless：如何在薅Layer2空投时收获双倍快乐](http://theblockbeats.info/news/31216?continueFlag=ed150799f682ea579371bfa431d4750b)\n\n[一次交互，双份空投的协议清单](http://theblockbeats.info/news/31216?continueFlag=ed150799f682ea579371bfa431d4750b)\n\n[theblockbeats.info](http://theblockbeats.info/news/31216?continueFlag=ed150799f682ea579371bfa431d4750b)\n\n\\+rainbow钱包交互\n\n**一鱼三吃**\n\n**三、周末gas低把几个有可能的gas低的项目都做了**\n\n**1.zk.money**\n\n**2.sudoswap**\n\n3\\.Playbid: create & add <https://partybid.app/>——1和888已完成，666创建，但是要至少投入0.01个ETH——**找不到666创建的partybid**\n\n4\\.fractional [fractional.art/fractionaliz](https://fractional.art/fractionalize%E2%80%94%E2%80%94%E5%88%9B%E5%BB%BA)e，找不到888创建的，好像有个问题\n\n参考此文：\n\nmirror.xyz/kuiqian.eth/kkaVfNe54p8_wRtKW5uHsRoK6OxSJgJBd7puKTjC6qk\n\n5\\.snapshot——666已创建\n\n6\\. gnosis也很重要\n\n**四、web3按照以下教程**\n\nforesightnews.pro/article/detail/6694\n\ndeca有新的项目\n\ncyberconnect了解一下discord为啥没有颜色\n\ndappback——在询问如何变成claimed\n\n**五、Syndicate——目前完成888带5-10,1带2-5,777，666带791-795**\n\n等8.1日看\n\n**六、liquild继续使用9——未**\n\n**七、两条新公链**\n\n公链——sui\n\naptos\n\n**八、yourairdrop教程多看看**\n\nmirror.xyz/yourairdrop.eth/MDOJo5cpWJe7FnSlD1-6Zfa4vtsWoxr6qHigSQzNvec\n\nbetop——直接换多币投票\n\nLayer0上面质押STG参与投票——要看怎么操作\n\n领noox徽章\n\ndefisaver的交互\n\nindexcoop.com可以使用rainbow交易\n\n**欠作业:**\n\n**大毛的新项目slash做二三十个钱包就好了——暂时不做**\n\n**万倍币也有测试币的新教程——暂时不做**", "timestamp": 1659162617, "digest": "Kr5dWqT6cv99_6-hSd3vxS4UIm2_Qw5f1bsnRK7H96M", "contributor": "0xfaCfF480c927281A50B4F1aa3B8ca6EbD7777777"}
{"id": "qm-otBwYmILXknDvp8HSi2zrf9gZXdBGXvxUIJlShyI", "title": "zkSync7月报告：1.0版本网络交易量突破1000万", "body": "zkSync 1.0 在 7 月交易量突破 1000 万！ \n\n \n \n\n8 月 2 日测试网将迁移到 Goerli。 \n\n \n \n\n 这意味着什么：Ropsten 上的测试网将转移到 Goerli，Rinkeby 上的测试网将转移到 Sepolia。预计发生这种情况时会有短暂的停机时间。您还需要在 Goerli 或 Sepolia 上重新部署测试环境，我们将在迁移前再分享一个提醒。 \n\n \n \n\n对于用户来说，这对 zkSync 1.0 Mainnet 上的资金没有影响 ", "timestamp": 1659162729, "digest": "qF2eB6ghP3ncKQIuC7rs9QzbbrEdr88CsUTf3U1ZwyY", "contributor": "0xa91C5Bd6f58Bc15d6cba1fD120f268192a0089f1"}
{"id": "qoNuBYK7hBccuNzyu0F40yPeFsHleSPx02I3HMMtP-0", "title": "$MART: BUILDING A WEB3 ACADEMY OF FINE ARTS", "body": "![](https://images.mirror-media.xyz/publication-images/3NhiRYozwLflxYQMG7jTG.jpg?height=3543&width=7086)\n\n**$MART is the governance token of Metavers Artspace DAO, whose mission is to build an academy of fine arts on chain, starting with the tokenization of** **exhibition space for the academicians and providing a large number of experts for the next generation of educational content. $MART governance tokens give holders the right to vote on issues that govern the development and operations of the blockchain project Metavers Artspace.**\n\nArt Education has always been gated by central authorities to accept only a small number of students for art schools, while measuring success depends on a board of directors, grades and credit points. At the same time, artistic education and creative thinking are underrepresented in the age of AI and automation. Opportunities to do business and sell artworks while studying are limited at traditional art schools.\n\nMetavers Artspace is expanding opportunities for art students with a decentralized system. The absence of a central authority and a P2P art evaluation system makes voting a key aspect. Metavers Artspace makes learning more fun with game-fi and social-fi elements. On the cyber-hybrid platform art students can browse lessons, respond and get rewards.\n\nMetavers Artspace DAO is launching a mirror $MART contract to develop the DeSci application, a web3 fine arts e-learning service focused on exploring metamodernism and artificial intelligence. The platform integrates art research into the blockchain economy and enhances education's reward system through a learn-and-earn mechanism.\n\n![Make your learnings count with $MART](https://images.mirror-media.xyz/publication-images/Tuggud0GYsmFe7xUXIgtS.jpg?height=1771&width=3543)\n\n## How does it work?\n\n1. Get a crypto wallet\n2. Back this project\n3. Enter an amount you want to exchange\n4. Get $MART (1 ETH = 1000 $MART)\n\n* Backers deposit ETH to fund Metaverse Artspace in exchange for $MART tokens.\n* Backers of the project automatically receive $MART tokens in exchange for their ETH. The token tracks how much each backer has contributed to Metavers Artspace. Tokens are issued at a ratio of 1000 tokens to 1 ETH.\n* The token represents a proof of patronage and an economic stake in the potential success of the platform by routing future revenue back to the token.\n* Backers can use their tokens to enter the community space and start the application process. $MART tokens represent the membership in the Metavers Artspace community and unlocks the token-gated server. In the educational model $MART governance tokens represent a more equitable, decentralized, and transparent governance method.\n* If the funding target is hit, Metavers Artspace will start to develop the DeSci platform.\n* If the stretch goal is hit, Metavers Artspace will start to implement more $MART burning mechanisms, use cases and earning functions.\n* $MART tokens can be traded like any ERC-20 token, or redeemed for underlying ETH.\n\n[crowdfund://0x4e62FDc9DED7B6b4F58DAD5877aCB37E78FEe2D2?features=overview,editions,podium,backers](crowdfund://0x4e62FDc9DED7B6b4F58DAD5877aCB37E78FEe2D2?features=overview,editions,podium,backers)\n\n### Rewards for Backers\n\nPatron Podium NFTs will unlock advantages and exclusive opportunities at the graduate shows of the Metavers Artspace academicians. The NFT Tier will unlock a special edition of the basic literature “Proof of Singularity”, which includes 3 generated texts created by my metaverse-mindclone as a co-author. \n\n**Proof of Singularity** is the first interactive eBook publication in web3. It is the living community mission that gets reviewed every season and re-written once every few semesters. The book is an everlasting act of co-creation with Metavers Artspace DAO as a co-author, who can vote on modifications. As basic literature for the application process, the NFT gives access to courses on the community server with an AI-Teacher.\n\nThe eBook publication on metamodernism, artificial intelligence and the concept of singularity addresses new technologies from an artistic perspective and analyzes the social impact. It is a guide for the aesthetic, conceptual handling of artificial intelligence and the philosophical-artistic attempt to describe an age that consists of the discrepancy and remix of many ages, the oscillation between norms and values ​​without a fixed perspective. It endeavors to make our complex, simultaneously accelerated and decelerated present capable of discourse by means of a glossary.\n\nThe NFT edition integrates web3 advantages into the publishing of eBooks: resell your eBook / get limited, collectable and rare editions of your favorite book / the book is your key to DeFi / using your book as collateral / collect your book as NFT and showcase the books you collect/ join the associated community server to engage with others that are on the same learning path as you, discuss questions, and connect.\n\n\\+Read the eBook on your favorite eBook reader (Kindle, iPad,…). The book is provided as PDF, ePUB and Kindle file.\n\nModifications and improvements to the publication will be driven by the community.\n\nMint on Polygon, a gas-free and carbon-neutral layer 2 solution to avoid high fees and energy consumption:\n\n[View on Opensea](https://opensea.io/assets/matic/0x2953399124f0cbb46d2cbacd8a89cf0599974963/94988497829294022065768734420273369591070485207675375681212029539418634191848/)\n\nMint on Ethereum:\n\n[https://create.zora.co/editions/0x179f72d79d3f445bb58b51e7067b59e0c03f12b0](https://create.zora.co/editions/0x179f72d79d3f445bb58b51e7067b59e0c03f12b0)\n\n![](https://images.mirror-media.xyz/publication-images/_lg5gtsWBiXWjRGCCS0WD.PNG?height=1997&width=1664)\n\n## Overview\n\n**$MART is the governance token of Metavers Artspace, a Web3 art education DeSci App with inbuilt Game-Fi and Social-Fi elements. $MART is used for art evaluation.**\n\n$MART is built around a sustainable social activity - studying and gaining knowledge. It is the first project for a blended-learning solution in the field of art education to effectively bring to life a functioning learn-and-earn concept. With the advancement of AI and automation, creative and abstract thinking becomes increasingly important.\n\nUsers equip themselves with NFTs in the form of learning material and get rewarded for educational activity. By responding to the materials, creative writing, project presentations, visiting a cultural place or exhibiting, users will earn game currency, which can either be used in-game, or cashed out for profit.\n\nWith game-Fi and hybrid learning, $MART aims to nudge millions toward a more fun and effective e-learning solution, combat the limitations of online learning and connect the public to Web 3.0. It supports academic researcher, artists, experts from the industry and students while simultaneously hinging on it’s Social-Fi aspect to build a long-lasting educational platform fostering user generated Web 3.0 content.\n\n## Governance and Art Evaluation\n\n$MART is used for voting as a P2P art evaluation system:\n\n$MART is the Metavers Artspace DAO governance token to vote on proposals and portfolio projects, access the community server and join community events. With the governance token, collectors are also listed on the allowlist for minting artworks at graduate shows. NFT Holders will earn $MART via l2e mechanism.\n\n### Voting System\n\nThe absence of a central authority makes voting on proposals as art evaluation a central aspect in metavers artspace.\n\nThe voting system also enables users to vote on modifications in articles from „Proof of Singularity“, the living community mission that gets reviewed every season and re-written once every few semesters.\n\nThe decentralized voting system allows users to create proposals and vote off-chain. It allows users to choose from multiple voting systems and use $MART to calculate voting power and to vote without gas. The POAP Plugin allows voters to claim a POAP badge as a proof-of-vote.\n\nThe voting system gives users the tools to customize governance for their community. It allows users to carry out governance in an organized way. It makes governance more accessible and affordable since the data is stored off-chain.\n\nVoting Type: Each voting type calculates the weight of an individual wallet differently:‍\n\n* Single Choice Voting: Each voter can choose a maximum of one option to support with their entire voting power.\n* Approval Voting: Each voter can select multiple options and their voting power will be distributed equally among the selected options.\n* Quadratic Voting: Voters spread their voting power across options. The number of voters is weighted higher than the number of votes than an option receives. This method of voting removes power away from the whales in your ecosystem.\n* Ranked Choice Voting: Voters rank options from most preferred to least preferred. Votes are counted for each voter’s top choice. If an option has more than 50% of the votes based on first-choice, that option wins. If not, the option with the least votes is eliminated and this process is repeated until a clear winner emerges or there is only one option left.\n* Weighted Voting: Similar to Approval voting where voters can select multiple choices, but voters are allowed to choose how much of their voting power to allocate to each vote.\n\nStart Date and End Date: Allows users to specify when a proposal goes live and stops accepting votes. It is important to specify a window that is not too short to allow the community members to have ample time to vote.\n\nBlock Number: Gives users the ability to decide who can or can’t vote, minimizing the chance that proposals will be influenced by a recent purchase of tokens by a Whale or by spreading tokens across multiple wallets.\n\nAn ENS name is required to use the voting system.\n\n### Professional Feedback System\n\nAdditional, small groups of specialists - “committees” or “pods” - making decisions over the evaluation of art.\n\n## Tokenomics\n\n### Token Name: $MART\n\n### Token Distribution\n\n![](https://images.mirror-media.xyz/publication-images/eBSjLd8POiNixjYwuVUOa.jpg?height=3543&width=3543)\n\n### Token Utility\n\n* Art Evaluation\n* Create Proposals\n* Vote on Proposals\n* Vote on modifications in articles from the basic literature „PROOF OF SINGULARITY“\n* Unlock Community Spaces and Server\n* Entry for Events\n* Pre-Sale/Allow List for graduate shows\n\n### Token Platform Use Cases\n\nIn-App Marketplace:\n\n* Mint Portfolio and Materials\n* Learn-and-Earn\n* In-App Wallet Swap\n\n### Token Burning Mechanics\n\n* Mint Portfolio\n* Upgrade Material\n* Level-Up Portfolio\n* Unlocking Certificates\n* Votings\n* Swap to USDC\n\n### Token Earning Mechanics\n\n* $MART is earned when a user responds to learning materials.\n* Each day, a set number of $MART will be unlocked to earn.\n* The daily release of $MART follows exponential decay pattern.\n\n### Token Earning Starting Date\n\nStage 1: Infrastructure: $MART Swap Function\n\nStage 2: Utility: Implement Use Cases\n\nStage 3: Burning: Install Burning Mechanisms\n\nStage 4: Earning: Learn-and-Earn kick off\n\n## Finance & Ecosystem\n\n### How the project profits\n\nMetavers Artspace takes small taxes from in-app activities, such as trading or NFT minting. All assets on the marketplace are owned by individual users and the majority of earnings in the app are made by users. A Royalty Fee is payable to the NFT learning material creators.\n\n### Materials\n\nThe quantity of the NFT learning materials represents the number of students who are admitted to a course. When students finish the course, they can sell the NFT to give the spot to another student. Each time the NFT is sold, the creator of the learning material gets a creator fee.\n\nThe quality of the NFT learning materials is approved by institutions, experts or researchers. Each learning material creator must have a professional background e.g. in academic research, art market, creative industry or blockchain economy.\n\nThe focus of the NFT learning materials is on exploring the concepts of AI and Metamodernism with contemporary art and creative writing in different ecosystems.\n\n## Roadmap\n\n![](https://images.mirror-media.xyz/publication-images/I0eDc2IeR2TNgFRkmYp7S.png?height=1086&width=2302)\n\n## Application Process\n\n1\\. Transcript\n\nActivate your prior knowledge with the basic learning material “PROOF OF SINGULARITY” ($INGULARITY). The first eBook publication in web3 unlocks eLearning courses with AI-Teachers.\n\n2\\. Application\n\nChoose a program and use $MART for the submission, governance and voting rights.\n\n3\\. Portfolio\n\nSubmit your portfolio that demonstrates your personal ideas and interests along with technical abilities.\n\n4\\. Rewards\n\nAccepted users can claim a subdomain on the metaversartspace.eth domain and will get the first reward. Soon they can enter the platform with an in-app marketplace, DEX and Wallet and respond to the tokenized learning materials to get earnings and certificates.\n\n## Vision\n\nThe vision Metavers Artspace DAO wants to achieve is to gather more and more real estate related resources, the growing publication of materials and the development of an actual Bachelor/ Master/ PHD system.\n\n## Join the community\n\n[Twitter](https://twitter.com/MetaversArtDAO)\n\n[Discord](https://discord.com/invite/yHeCcJCpkQ)\n\n[Snapshot](https://snapshot.org/#/metaversartspace.eth)\n\n[Zora](https://zora.co/0xD20195a3eE04DB764477D85f848711667Fb28137)\n\n[Opensea](https://opensea.io/MetaversArtspace)\n\n## About\n\n**Metavers Artspace was founded by the art researcher and curator Carina Lue with a notion of art as contemporary knowledge production that will last in our ever-changing world. As an education leader, she is an expert in hybrid aesthetic forms with a focus on how technological innovations and virtuality are affecting the physical world. Technology can not only generate sales arguments for consumers, it can also simplify access to education, enable new forms of education and strengthen collective awareness of abstract and international problem solutions.**\n\n[Contact](https://chat.blockscan.com/start)\n\n[Website](https://metaversartspace.eth.link/)", "timestamp": 1659162744, "digest": "nEI7fBhwXv4cub6qoMS4igAm9EQnGldiv9B3zTFHnOA", "contributor": "0xD20195a3eE04DB764477D85f848711667Fb28137"}
{"id": "tNemp-xwPTd2pFNqqBeOF-Ni8-oRTjdjBr1xwA4Ov-w", "title": "目前为止，DAO靠什么盈利？", "body": "把web3想象成你的高中。\n\n \n \n\nDeFi是微积分高手、拥有图形计算器的统计学大师和外向型体育运动员的归宿。\n\n \n \n\nNFT是艺术青年、戏剧明星、乐队和管弦乐队成员去的地方。\n\n \n \n\nDAO是所有的历史和文学书呆子的去处。(我就是其中之一。)\n\n \n \n\n事情变得有趣了。\n\n \n \n\n从日常的角度来看，对于DAO领域的历史和文学爱好者来说，DAO的工作可能相当有趣。你可能会在一个会议上看到一个古代苏美尔人的Zigguart占据了整个幻灯片屏幕。你可能开始在推特上谈论狩猎采集社会。你可能会在论坛上用哲学和理论而不是公认的商业最佳实践来支持你的想法。\n\n \n \n\n对我来说，在DAO领域中穿梭是一种丰富的智力体验。作为一名曾经的文科大学生，我可以整天谈论理论和思想。我曾就一部晦涩的莎士比亚戏剧中的一句话写了数千字文章。我喜欢这些东西。\n\n \n \n\n但是…即使是英语专业的我也会开始思考我们所做的事情的可持续性、盈利性和商业性。尤其是当我看到硅谷因为经济衰退而裁员时。\n\n \n \n\n感觉DAO走出了一种基于学术的、热爱理论的思维模式。这并不是一件坏事——它只是意味着我们需要在赚到足够的钱来支付贡献者并继续保持下去时发挥创造力。\n\n \n \n\n在这个高度金融化的领域，大多数DAO都没有盈利，这是一个巨大的悖论。这并不意味着他们永远不会盈利，或者他们不能作为有效的企业运作。但这确实意味着我们需要摆脱一些旧的观念，即成为一个成功的企业意味着什么，以及DAO需要什么来支持其核心团队。\n\n \n \n\n似乎将代币作为自己产品，并仅仅依靠“代币上涨”来支付贡献者的DAO已经过时了。但当涉及到其他融资模式时，DAO就会陷入僵局。他们并没有真正推出产品（还没有）。他们有时会提供服务，但这大多是在Web3内。他们不大谈论商业策略或利润和损失。\n\n \n \n\n这常常让人觉得我们生活在一个与企业运作方式不同的现实中。\n\n \n \n\n当然，这不全是钱的问题。但是…当你拥有一支熟练的贡献者队伍，将他们至少70%的工作时间奉献给组织(让我们现实一点……web3中有人只做一个项目吗?)，金钱是我们不能忽视的一个巨大问题。\n\n \n \n\n我认为这种对公然赚钱的恐惧部分来自于我们在web2中看到的纯粹贪婪。平台垄断、个人数据的销售、亿万富翁。那里的一切都变得很恶心。而在web3中，我们想要净化我们自己。\n\n \n \n\n我们在这里是为了退出，而不是选择重新加入。\n\n \n \n\n但如果我们不认真对待赚钱的问题，DAO将是一个非常短暂的实验。\n\n \n \n\n受到Orca twitter space和Hasu深入挖掘DAO盈利能力的I Pledge Allegiance章节的启发，我正在分析DAO将商业意识和DAO意识结合起来的方式。\n\n \n \n\n**接受艰难的决定，服从大局**\n\n在web2商业世界中，要想获得稳定的利润，通常意味着你要对发布的产品、雇佣的人、解雇的人、如何使用赛道资金以及公司的发展方向等问题毫不留情。(虽然这些无情的决定并非在所有web2组织中都是如此，但它们肯定是污点)。与web3的开源、公共产品和正和精神相比，这感觉很集中，也很不对劲。\n\n \n \n\n但是，为了建立一个持久的业务，这些决定需要在某个时刻做出。除非你非常幸运，否则我认为你需要做出许多艰难的决定才能获得真正且可持续的收益。\n\n \n \n\n对于DAO来说，硬式决策是艰难的，因为通常需要妥协才能将提案付诸表决，而妥协通常不是一个硬式决策，而是一个“双方都有点高兴，但也有点生气”的决定。\n\n \n \n\nDAO如何接受“服从大局”，即不管双方同意不同意，选择一条前进的道路，而不是绕着圈子寻找不存在的妥协？尤其是当推进某件事需要通过率和投票门槛时？\n\n \n \n\n一种方法是将大多数决策保留在负责DAO的资金和关键反馈的小团队内部。然后，让少数决定通过投票程序——但这些将是需要认真辩论和讨论的大项目。\n\n \n \n\n将大多数决策保留在公会/团队/小团体层面是推动组织快速前进的好方法。但是，这些团队仍然必须服从较大的DAO(成员、代币持有者、组织中的决策组)以获得资金。\n\n \n \n\n然后，你会得到这样一个金字塔:\n\n \n \n\n \n \n\n然后，在DAO级别做出最艰难和最关键的决定，将主题和小问题保留在团队内部。这使得DAO可以专注于一些而不是很多硬式决策。\n\n \n \n\n一旦决策必须在DAO级别做出，就会格外困难，因为这需要更长的时间才能达成共识。所以只应该保留最重大的决定。就像这个倒金字塔:\n\n \n \n\n \n \n\n在DAO中处理硬式决策的另一种方法借鉴了Teal哲学:当组织面临生存威胁时，关键领导人可以大规模地使用建议流程(向其他人征求关于某个想法的反馈和建议)来制定解决方案。\n\n \n \n\n让贡献者在这个问题上共同承担责任——在这种情况下，找到一条有利可图的前进道路——可以帮助激励新的领导者。\n\n \n \n\n“当员工在危机中充分参与建议过程时，他们会被要求为艰难决策分担责任，并被信任会做出贡献。这是一种赋权，有助于组织发展。”\n\n\\-Reinventing Organizations Wiki, Crisis Management\n\n \n \n\n简单地说，“我们需要找到一种方法，让我们在做X的时候赚到足够的钱来支付我们的核心团队Y。我们该怎么做呢?”这是推动关于盈利能力的对话的有力方式。领导者将会出现，新的解决方案也将会出现。\n\n \n \n\n拥有一位有远见的CEO并不是经营一家伟大公司的先决条件....拥有许多伟大的领导者才是。\n\n \n \n\nweb2中有一个普遍的想法，即一个有远见的CEO是公司成功的必要条件。史蒂夫·乔布斯和苹果、比尔·盖茨和微软、埃隆·马斯克和特斯拉、马克·扎克伯格和Facebook都是被吹捧为精英中的精英的远见卓识者。web2的商业领袖对DAO持怀疑态度是因为DAO缺乏那种单一的远见。\n\n \n \n\n对我来说，这就像是说一个伟大的国家需要被君主统治才能发挥作用:我就是不买账。\n\n \n \n\n公司是如此新的事物，以至于我认为，就公司的最佳实践和标准而言，我们仍然处于君权神授的阶段：我们充其量是在14世纪。\n\n \n \n\n我相信，有远见的CEO的理念更多的是关于相关性，而不是因果关系。在我们这个复杂、不可预测的世界里，在一个由其他因素和动因组成的复杂网络中，几乎不可能把因果关系归于某一个动因。虽然这些首席执行官们在他们的技术和领导能力方面确实很有天赋，但我相信我们正在超越这个工作阶段，进入一个全新的、让位于民主的阶段。\n\n \n \n\n对我来说，DAO不是无领导的：它们有多个具有不同背景和经验的领导者。这些不同的领导者可以为组织的方向定下基调，而不是一个傀儡。\n\n \n \n\n而且，只要他们被任务团结在一起，而不是被他们对任务的理解而分裂，这些领导人甚至可以领导DAO去完成一个比单一领导人能够领导的更大的使命。这就是“服从大局”发挥作用的时候了，推动组织朝着真正的目标前进必须优先于个人的自我和观点。\n\n \n \n\n \n \n\n将这一点与盈利能力联系起来，关键是DAO要有一个真正的目标，领导者可以围绕这个目标聚集在一起。如果有许多以自我为导向的目的都在争夺资源，那么DAO将永远不会赚到足够的钱来继续支付其核心团队的费用。统一的使命对于盈利来说是必要的。\n\n \n \n\n公共物品的理念有时会被应用到非公共产品的东西上……这阻碍了收入的产生。\n\n \n \n\n使用加密货币在不征税的情况下为公共产品提供资金是加密货币领域最具革命性的想法之一。但并不是我们在加密货币中建立的所有东西都是公共产品。\n\n \n \n\n我认为我们的很多公共产品精神都渗透到了DAO领域的所有事物中。\n\n \n \n\n在DAO中，我们通过回避谈论如何赚钱来表现得像一个公共产品。我们不知道什么时候或如何进入对话，因为它感觉有些不对劲。当我们试图成为Regen时，这感觉太Degen了。而且，由于DAO吸引了许多像我这样喜欢辩论理论和思想的人(同样，这并不一定是件坏事)，我们可能会在一个论坛帖子上兜好几年圈子。\n\n \n \n\n在最近一期的《I Pledge Allegiance》中，Hasu谈到DAO通常会把他们的所有收益都送给代币持有者，而不保留任何代币来运营他们的业务并带来利润。他们希望这些代币持有者会通过成为积极的贡献者或参与治理来回报它们，但现实是，大多数代币持有者只是抛售了代币。\n\n \n \n\n在这种情况下，在组织创建过程的早期，清晰地定义DAO的使命和在生态系统中的位置是至关重要的。DAO是否构建了一个公共产品，并资助一个小型核心团队来维持它的运行？DAO是否想要交付产品，赚取利润，并雇佣一个大型团队？在DAO中，尽早做出这样的关键决策非常重要。\n\n \n \n\n尽管我们处于所有权经济中，用户获得了前所未有的权力和所有权，但DAO需要在这与赚足够的钱来照顾其核心团队之间取得平衡。如果我们把每个DAO都当成公共产品，那么照顾核心团队这件事就永远不会发生。\n\n \n \n\n“未来的工作并不一定很糟糕”——这是我在twitter上听到的最好的话\n\n \n \n\n我在Twitter Space上与一些DAO服务提供商进行了交谈，那天我听到的最喜欢的一句话来自Twali的创始人Cokie:“未来的工作并不一定很糟糕。”\n\n \n \n\n因为现在，如果你想以全职DAO贡献者的身份谋生，那么不可否认，未来的工作会很糟糕。\n\n \n \n\n您可能会在多个DAO之间跳来跳去，试图获取赏金并担任一系列角色。你正在处理协调噩梦和没完没了的会议。你正努力在一条职业道路上取得进步，而不是随波逐流。你要自掏腰包支付医疗保健费用，而且可能会难以获得购买房屋的贷款。\n\n \n \n\n未来的工作不一定是这样的。这就是激励我每天不断努力使DAO变得更好的原因。\n\n \n \n\n而盈利能力是其中的很大一部分。\n\n \n \n\n我们这些文学和历史系书呆子会找到答案的。但如果我们不参考过去的企业、合作社、政府和公司，我们就无法弄清楚。", "timestamp": 1659162677, "digest": "Tfid0NWNTCOnyBHjgXbh7JDZGnh0ESTClEEEj7ekeNQ", "contributor": "0x7545C29D91957E45AAEB1aAE7CF27461fbeBe555"}
{"id": "Lzp8bITYAM9VE8-OfCwW2fyR_Ux32wr-wQIr0A0In78", "title": "Nomad 独特的设计想法", "body": "![](https://miro.medium.com/max/1400/1\\*d0Ww3NM8g1dme2j5Wdsmlg.png)\n\n[Nomad](https://docs.nomad.xyz/)是一种新颖的区块链互操作性方法，它利用一种乐观机制来提高跨链通信的安全性。使用 Nomad，开发人员可以安全地构建跨链应用程序（或 xApps）并在链之间桥接资产。Nomad 频道和旗舰 xApp，[即 Nomad 代币桥](https://app.nomad.xyz/)，在以太坊和 Moonbeam 上上线，更多链即将推出。\n\n在设计 Nomad 时，我们发现自己经常遇到困难的设计决策。至少可以说，互操作性是一个复杂的领域，将一种新颖的协议推向市场需要对设计空间进行深入思考。\n\n我们通过将这些点向后连接发现，Nomad 的设计有着一贯的理念。具体来说，我们的决策基于三个核心原则。通过在遇到艰难决定时依靠这一支柱，我们确保我们以坚持我们的价值观并优先交付[牦牛剃须](https://projects.csail.mit.edu/gsb/old-archive/gsb-archive/gsb2000-02-11.html)的方式开发 Nomad 。\n\n我们认为这些原则可能对其他处理棘手问题的团队有用，并且可以像它为我们所做的那样作为指南针。废话不多说，Nomad 背后的三个原则：\n\n## 用户高于系统\n\n*技术很重要。用户**最重要**。*\n\n为真实的人所经历的问题建立解决方案的能力是让我们早上起床的能力。优先考虑系统可以很容易地分散我们提供用户想要的优质产品的注意力。系统设计应为此服务；它本身并不是目的。\n\n* 我们更看重面向人类的实用程序，而不是有趣的原语。\n* 如果我们必须在应用程序和机制之间进行选择，我们选择应用程序。\n* 我们的成功是在野外而不是在实验室中衡量的。\n\n## 简单胜于复杂\n\n*复杂性是创新的**死亡**。*\n\n我们努力构建不比他们需要的更复杂的解决方案。我们避免使用新的密码学，并且喜欢重用他人的库。互操作性本质上是复杂的。我们的目标是让任何开发人员都能轻松使用它。\n\n* 我们重视平易近人和可维护的代码，而不是最少的代码。\n* 如果我们必须在文档和优化之间做出选择，我们选择文档。\n* 我们的成功是在集市上衡量的[，而不是在大教堂里](https://en.wikipedia.org/wiki/The_Cathedral_and_the_Bazaar)。\n\n## 安全胜过形式主义\n\n***实际伤害 ****比**理论伤害更重要。***\n\n我们努力利用每一种保护用户的工具。我们的目标是尽量减少安全问题的可能性和影响。我们的安全实践是通过形式分析获得的，但并不以它为中心。\n\n* 我们更看重用户和资金的现实安全，而不是加密经济模型。\n* 如果我们必须在智能合约安全和新白皮书之间做出选择，我们选择智能合约安全。\n* 我们的成功是通过主网攻击来衡量的，而不是 arXiv 攻击。\n\n# 应用我们的世界观\n\n这些核心原则帮助我们在构建 Nomad 时做出日常决策。它们是帮助我们自信地驾驭困难地形的路标。甚至在我们写下它们之前，它们就为系统的核心设计提供了信息。很容易看出它们对当今系统设计的影响：\n\n## 用户高于系统\n\nNomad 以通用的跨链消息传递协议为基础。但是，我们技术堆栈的核心不是网络层，而是 Nomad 通道支持的应用程序。\n\n为了构建应用程序，我们设计了[路由器模式](https://docs.nomad.xyz/#how-nomad-passes-messages-between-chains)。路由器支持快速、安全地开发可以使用*任何*跨链通道的 xApp，使我们能够在 Nomad Bridge 和我们的跨链治理 xApp 上快速迭代。这些应用比底层渠道更重要。\n\n## 简单胜于复杂\n\n跨链消息传递是一个巨大的问题空间。没有完美的、通用的解决方案。多年来，轻客户端一直是跨链技术的顶点。这些是 IBC、Near Rainbow Bridge 和 tBTC 的基础。轻量级客户需要在工作量证明和权益证明实施方面拥有深厚的专业知识，并且对新开发者来说是不友好的。\n\nNomad 的设计避开了轻客户端，转而支持消息树和欺诈证明。因此，开发人员无需成为共识专家即可为 Nomad 做出贡献。我们专注于使内部流程平易近人，并为 xApp 开发人员提供清晰的界面和明显的最佳使用实践。\n\n## 安全胜过形式主义\n\n当我们决定不在 Nomad 的设计中包含轻客户端时，我们也放弃了正式的安全性。虽然这个决定对简单性和运营成本有巨大的好处，但我们不得不承认 Nomad 不会被证明是安全的。Nomad 被设计为在实践中是安全的。\n\nNomad 的核心渠道依靠欺诈证明和发布证明来防止渠道故障。此外，它允许用户和应用程序开发人员委托信任保护者，他们可以减轻欺诈的危害。换句话说，Nomad 的系统设计选择通过护栏提供安全性，而它无法提供可证明的安全性。我们相信这是实现我们目标的唯一选择。\n\n# 没有解决办法，只有取舍\n\n这些信条不是普遍真理，我们尊重其他观点。我们相信形式主义和系统设计的力量，并且我们了解实现目标可能需要复杂性。\n\n我们尽可能使用这些工具来改进我们的产品。不幸的是，在现实世界中，有时必须做出权衡。我们不能总是一边吃蛋糕一边吃。当**必须**做出牺牲时，Nomad 设计原则指导我们做出复杂的决定，它们是我们衡量成功的标准。\n\n我们邀请您与我们一起踏上跨链未来的旅程，我们很乐意在我们的 Discord 和 Twitter 上收到您的来信。Nomad 团队正在孜孜不倦地工作，以确保我们提供最佳的桥接体验，我们很高兴看到这个新兴的生态系统在下个月、下一年及以后的发展方向！\n\n如果您有兴趣在外面外看到这些内容，[请查看我们的 GitHub](https://github.com/nomad-xyz/)，[阅读文档](https://docs.nomad.xyz/)，并[桥接一些令牌](https://app.nomad.xyz/)。", "timestamp": 1659162961, "digest": "ue4A_wSJI_axGxVswTuFZD-ZJSKwAkrOa85hUiaaGxU", "contributor": "0xF0CEAe38Ac7c4BD57fb200e1d9bdBFa37073E60C"}
{"id": "MGB7HhVb9nXd_w_IGExcSjvr0yvVGg6oV455OEfWD3M", "title": "Lovely Saiban", "body": "I love Saiban!", "timestamp": 1659162837, "digest": "6Ulwm3Ent-Y0QAWf7mBUCCPN3qO3zhe6mAK8pnrxmq8", "contributor": "0xD2D950E1c13348E0De65f9FD05F8a716b38ceaB9"}
{"id": "PbKbp97bkzW511up93YdN9YFeYSjUMDv_d05FMpAByM", "title": "跨链桥 Nomad 在 2240 万美元的融资中揭示了加密重量级的支持者", "body": "Coinbase Ventures 和 OpenSea 是 4 月融资轮的额外支持者之一。 \n 2022 年 7 月 28 日晚上 11:25 \n 更新时间：2022 年 7 月 29 日上午 12:21\n\n![](https://images.mirror-media.xyz/publication-images/C_w3d1GTzQBRq15X_OGUR.png?height=1080&width=1440)\n\n \n  \n 周四，跨链消息传递协议 Nomad[透露](https://www.businesswire.com/news/home/20220728005194/en/Nomad-Announces-Strategic-Investment-from-Coinbase-Ventures-OpenSea-Crypto.com-Capital-Polygon-as-Part-of-Seed-Funding)，一批加密货币重量级人物参与了[4 月份宣布的](https://medium.com/nomad-xyz-blog/nomad-raises-22m-seed-round-for-security-first-interoperability-5d6b15c96007)2240 万美元种子轮融资，估值为 2.25 亿美元。\n\n新宣布的支持者包括加密货币交易所 Coinbase 的风险投资部门、不可替代代币 (NFT) 市场 OpenSea、Crypto.com Capital、加密货币做市商 Wintermute、去中心化金融 (DeFi) 平台 Gnosis 和 Polygon 区块链。本轮融资由加密投资公司 Polychain 领投。\n\nNomad 允许应用程序在区块链和汇总之间发送数据，这是区块链可扩展性解决方案，重点是安全性。跨链网桥中的安全问题导致了引人注目且代价高昂的攻击，包括3 月份对 Axie Infinity 的 Ronin 网络的[6.25 亿美元攻击。](https://www.coindesk.com/tech/2022/03/29/axie-infinitys-ronin-network-suffers-625m-exploit/)Nomad 使用乐观验证，这为任何观看区块链的人提供了一个短窗口来质疑有问题的链上消息。\n\n\n***\n\n[根据协议的网站](https://docs.nomad.xyz/nomad-101/introduction#:\\~:text=How%20does%20Nomad%20work%3F,ferry%20these%20messages%20between%20chains.)，Nomad 的用例包括跨链桥接代币的用户、部署代币的资产发行人、执行跨链治理的去中心化自治组织 (DAO) 以及构建跨链应用程序的开发人员。\n\nNomad 目前存在于以太坊主网和 Moonbeam、Evmos 和 Avalanche 区块链上。这轮融资将在一定程度上帮助 Nomad 扩展到更多的连锁店。\n\n“由于 Nomad 为跨链消息传递提供了一个信任最小化的协议，因此有一些潜在的应用程序远远超出了代币桥接，”Polygon 联合创始人 Anurag Arjun 在新闻稿中说。“我们期待看到一些令人兴奋的新用例在链上实现。”", "timestamp": 1659162928, "digest": "hofy7efxwGTQ0FBU_MUx9KK-YNzFseSKFLvAzu3RQIA", "contributor": "0xF0CEAe38Ac7c4BD57fb200e1d9bdBFa37073E60C"}
{"id": "qqaFaHM5RLIWQyYdZfCmp44O8_09Qi9cCj4UXXn4OOU", "title": "皮卡丘", "body": "皮卡丘", "timestamp": 1659162944, "digest": "nDiIXa5_DlJ-KZtC3p_m3BthE52ER3RKLlEjjuXh1VY", "contributor": "0x0a4cbe8318b7bDA884e0dD91055B8d773192E736"}
{"id": "T6hvmVlaG_8XJSckWHk8i8E-zc9brDGUGURlXw_nqzc", "title": "皮卡丘", "body": "皮卡丘", "timestamp": 1659162908, "digest": "_A85ryidzjcJSaLSYPDLz5Y3xi5brvMJ1m5v0_l4dp4", "contributor": "0x0a4cbe8318b7bDA884e0dD91055B8d773192E736"}
{"id": "YSdPW3SPwBY3tV5nR9gb1Doot3d__3iskrEe3ErcIsQ", "title": "How woke do you want it? A hot take on the Norton Anthology of American Literature's \"Preface to the Tenth Edition\"", "body": "After going to print on the first of this month, the newest version of the Norton Anthology of American Literature was delivered to me by the exceptionally-rude DHL deliveryman today — and, after reading the \"Preface to the Tenth Edition,\" it is clear that this version of the quintessential doorstop promises to be (unsurprisingly) the wokest version yet.\n\n\"Diversity\" is certainly the keyword, here — given that it is repeated in place of synonyms throughout — as the preface tries to do its job of justifying why you just dropped nearly a couple hundred United States dollars on the Tenth Edition when the Ninth Edition would’ve almost certainly sufficed.\n\nOf the seventeen new writers included, it isn’t entirely clear from the onset if any of them are white males — not that there is anything resembling an underrepresentation of this demographic in the Anthology — but it is explicitly clear that most, if not all, are Black and/or women and/or Native American and/or Chinese and/or not Caucasian. **Not that there’s anything wrong with that!**\n\n[https://www.youtube.com/watch?v=rGAyQAkXajg](https://www.youtube.com/watch?v=rGAyQAkXajg)\n\nThe almost-exclusive addition of non-caucasion and/or women authors isn’t necessarily a bad thing. In fact, it’s presumably more interesting to see the addition of \"well-bred\" colonial women’s writing in Volume A than more uptight white dudes’, and the Modernist period is certainly ripe for today’s uber-woke discussions of identity politics.\n\nWhere the preface teeters on the border between the expected liberalism endemic to academia and full-blown wokeness, however, is in its not-so-subtle takes on racism in today’s American landscape. For example, it claims the Reconstruction’s legacy “is still being felt in the national reckoning with racism and inequality” (xxi) and separately addresses what it defines as \"the renewed reckoning with anti-Black racism that began in 2014, arising from shootings of young black men—particularly of Trayvon Martin in 2012 and Michael Brown in 2014.\" (xxiii) I’m not saying these two quotes aren’t true or anything, but…\n\nWhile I admittedly have not read these clusters (the books literally hit my doorstep today), it feels like a mild-to-moderate stretch to claim the United States of America in 2022 — in the midst of Covid-response consequences, an energy crisis, potential food shortages, rapid inflation, a potential recession, a widening wealth gap, political discontent, etc. — is still under any sort of noteworthy influence from 1877 America. (Many Americans probably don’t even know what the Reconstruction is.)\n\nLikewise, the President of the United States during the shootings of Trayvon Martin and Michael Brown was Barack Obama (not exactly Andrew Johnson), and one might argue that the larger issue at hand had more to do with systemic failings with the American police state/force and mainstream media fire-stoking — themes which I assume are not discussed in Volume E, though I would be happy to be wrong — than an organic resurgence in national racism.\n\n**TL;DR racism certainly exists in today’s America, but it is not black-and-white — there are many sociopolitical factors involved in a deeply complex and diverse country that should not be downplayed. (Maybe they aren’t, to be fair. I haven’t read it, yet.)**\n\nThat being said, nothing about the Tenth Edition’s changes is unexpected. They were very expected. It would have been sincerely shocking if the changes to the newest print were not intended to inject more diversity into the Anthology, but it is hard to not laugh at the preface’s somewhat-apologetic balancing by lengthening or adding high school favorites — *The Turn of the Screw* and *The Great Gatsby*, for example — to not \"shortchange\" the old white guys.\n\nNevertheless, I assume the trusty ol’ Norton Anthology of American Literature isn’t any worse for wear though the addition of more diverse authors. In fact, I’m almost certain it is better off. What will be interesting, though, are the editorial discussions accompanying each cluster — and whether or not they toe the line of objective study or inject wokeness when they’re explicitly not intended to impose interpretation upon the reader. Time will tell, but I’m betting on the latter.\n\n## Key notes and themes\n\n* The latest version of the Norton Anthology of American Literature has a focus on balancing traditional interests with diversity. \\[trad vs. woke\\]\n  * New clusters focus on \"race and aesthetics\", women’s rights, Civil War, Reconstruction, debating black art, The Great Depression and science fiction. (xix) \n* *\"\\[W\\]riters strive to produce artifacts that are both intellectually serious and formally skillful\\[…\\]writers should be understood in relation to their cultural and historical situations.\"* (xviii)\n  * *\"the complex interrelationships between literature and history\"* (xviii)\n* \"\\[C\\]ritical acclaim\" is relevant when recognizing contributions to the American literary record from \"diverse\" authors. (xviii)\n* Volume A has been \"streamlined\" for cohesiveness. (xix)\n  * Its focus is largely on European explorers trying to make sense of native North American cultures while justifying claiming the land.\n* Volume B has a focus on \"the omnipresence of race and slavery as literary and political themes\". (xx)\n  * Poetry was central to readers in the nineteenth century.\n* The historical challenges of 1865-1914 \"prefigure our own.\" (xxi)\n  * Reconstruction vs. today’s America\n* Volume D focuses on issues pertaining to \"racial and social geographies\" while connecting Modernism with today’s woke topics, and also adds sci-fi as a genre of the period.\n\n## Update history\n\n* This article was originally published and its NFT was minted on July 29th, 2022.\n* July 30th, 2022: The author added the \"Key notes and themes\" H2 and made some technical tweaks — such as changing quotation marks to straight quotes and adding page numbers. Also added the Seinfeld clip from YouTube and adjusted the wording in that section for clarity.", "timestamp": 1659162954, "digest": "YlhWjs4hCFuPr8e8FidkIEOpKgmbOXBkVy1CL2itlZw", "contributor": "0xd05422E95152508E847eCa307586d67C149a1190"}
{"id": "2IFy3JDsjGdO5UYUHI119naEgFJryCeFBYmETQG1U5s", "title": "DID 生态系统", "body": "[edition://0x1e27245c8a2FD2597B50A412a8fffe19F8289dCe?editionId=0](edition://0x1e27245c8a2FD2597B50A412a8fffe19F8289dCe?editionId=0)\n\nDID生态系统可以被分解成若干层，其中每一层都建立在底层协议之上。我们充分利用并略微修改了DIF的4层身份模型，按其主要重点来映射当前的DID项目，但要提醒的是，这是一个简化模型，大多数项目都超越了一层。\n\n分层的去中心化身份生态系统\n\nLayer 1：标识符和标准（Identifiers and Standerds）\n\n标准、标识符和命名空间创建了公共信任层，确保标准化、可移植性和互操作性。它们还允许网络注册和管理DID方法，为开发者和用户提供网络ID系统的规则和背景。\n\n去中心化身份基金会（DIF）是该层的关键角色，也是生态系统的基石。它作为开发、讨论和管理所有活动的中心，需要为DID堆栈（stack）创建和维护一个可互操作的开放生态系统。\n\nLayer 2：基础设施（Infrustructure）\n\n基础设施和代理框架允许应用程序直接与对方和可验证的数据注册中心进行互动。这些解决方案包括通信、存储和密钥管理。我们强调Ceramic和ENS是处于建设DID基础设施第一线的项目（虽然ENS的分类可以争论，但我们把它放在基础设施层，因为我们预见到凭证和应用程序将来会建立在ENS之上）。\n\nLayer 3：凭证（Credentials）\n\n凭证必须被管理、更新和交换。这一层的目的是设法解决DID如何协商控制和认证的证明，以及在身份所有者之间安全地传递数据。\n\nBrightID是这一领域的一个值得注意的项目。它是一个拥有超过3万名用户的社会身份网络，允许人们向应用程序证明他们没有使用多个账户，从而最大限度地减少Sybil攻击的机会。\n\nVitalik Buterin谈BrightID的潜在应用\n\nLayer 4：应用程序、钱包和产品（Apps、Wallets、and Products）\n\n这一层可能是读者最熟悉的，打算为消费者提供现实世界的用例和价值。一些项目，如Goldfinch（无抵押贷款），使用专有的唯一实体检查，但目的是在它们成熟时利用去中心化的ID解决方案。相比之下，其他应用已经利用了现有的DID技术，如TrueFi（带有链上信用评分的无抵押贷款）、Gitcoin（为公共物品提供资金）和Essign（去中心化的电子协议）。\n\nLayer X：横向的（Transversal）\n\n这些项目在很大程度上超越了任何单独的层，并在多个层面产生了影响。例如，欧洲的GDPR数据保护法对生态系统的所有领域都有影响。", "timestamp": 1659162924, "digest": "nSmjUE5P0ktA89wd-hPluqbUAfaZOg8cSBm-EboMS2w", "contributor": "0xD6353D54DE60760b551FB8eF05828e48E5bbaC31"}
{"id": "fPk_yYKBBIuC2wJtyhUE1rfYOBP7lVo-bMx9vC_E6dE", "title": "Nomad 独特的设计想法", "body": "![](https://miro.medium.com/max/1400/1\\*d0Ww3NM8g1dme2j5Wdsmlg.png)\n\n[Nomad](https://docs.nomad.xyz/)是一种新颖的区块链互操作性方法，它利用一种乐观机制来提高跨链通信的安全性。使用 Nomad，开发人员可以安全地构建跨链应用程序（或 xApps）并在链之间桥接资产。Nomad 频道和旗舰 xApp，[即 Nomad 代币桥](https://app.nomad.xyz/)，在以太坊和 Moonbeam 上上线，更多链即将推出。\n\n在设计 Nomad 时，我们发现自己经常遇到困难的设计决策。至少可以说，互操作性是一个复杂的领域，将一种新颖的协议推向市场需要对设计空间进行深入思考。\n\n我们通过将这些点向后连接发现，Nomad 的设计有着一贯的理念。具体来说，我们的决策基于三个核心原则。通过在遇到艰难决定时依靠这一支柱，我们确保我们以坚持我们的价值观并优先交付[牦牛剃须](https://projects.csail.mit.edu/gsb/old-archive/gsb-archive/gsb2000-02-11.html)的方式开发 Nomad 。\n\n我们认为这些原则可能对其他处理棘手问题的团队有用，并且可以像它为我们所做的那样作为指南针。废话不多说，Nomad 背后的三个原则：\n\n## 用户高于系统\n\n*技术很重要。用户**最重要**。*\n\n为真实的人所经历的问题建立解决方案的能力是让我们早上起床的能力。优先考虑系统可以很容易地分散我们提供用户想要的优质产品的注意力。系统设计应为此服务；它本身并不是目的。\n\n* 我们更看重面向人类的实用程序，而不是有趣的原语。\n* 如果我们必须在应用程序和机制之间进行选择，我们选择应用程序。\n* 我们的成功是在野外而不是在实验室中衡量的。\n\n## 简单胜于复杂\n\n*复杂性是创新的**死亡**。*\n\n我们努力构建不比他们需要的更复杂的解决方案。我们避免使用新的密码学，并且喜欢重用他人的库。互操作性本质上是复杂的。我们的目标是让任何开发人员都能轻松使用它。\n\n* 我们重视平易近人和可维护的代码，而不是最少的代码。\n* 如果我们必须在文档和优化之间做出选择，我们选择文档。\n* 我们的成功是在集市上衡量的[，而不是在大教堂里](https://en.wikipedia.org/wiki/The_Cathedral_and_the_Bazaar)。\n\n## 安全胜过形式主义\n\n***实际用途比****理论伤害更重要。*\n\n我们努力利用每一种保护用户的工具。我们的目标是尽量减少安全问题的可能性和影响。我们的安全实践是通过形式分析获得的，但并不以它为中心。\n\n* 我们更看重用户和资金的现实安全，而不是加密经济模型。\n* 如果我们必须在智能合约安全和新白皮书之间做出选择，我们选择智能合约安全。\n* 我们的成功是通过主网攻击来衡量的，而不是 arXiv 攻击。\n\n# 应用我们的世界观\n\n这些核心原则帮助我们在构建 Nomad 时做出日常决策。它们是帮助我们自信地驾驭困难地形的路标。甚至在我们写下它们之前，它们就为系统的核心设计提供了信息。很容易看出它们对当今系统设计的影响：\n\n## 用户高于系统\n\nNomad 以通用的跨链消息传递协议为基础。但是，我们技术堆栈的核心不是网络层，而是 Nomad 通道支持的应用程序。\n\n为了构建应用程序，我们设计了[路由器模式](https://docs.nomad.xyz/#how-nomad-passes-messages-between-chains)。路由器支持快速、安全地开发可以使用*任何*跨链通道的 xApp，使我们能够在 Nomad Bridge 和我们的跨链治理 xApp 上快速迭代。这些应用比底层渠道更重要。\n\n## 简单胜于复杂\n\n跨链消息传递是一个巨大的问题空间。没有完美的、通用的解决方案。多年来，轻客户端一直是跨链技术的顶点。这些是 IBC、Near Rainbow Bridge 和 tBTC 的基础。轻量级客户需要在工作量证明和权益证明实施方面拥有深厚的专业知识，并且对新开发者来说是不友好的。\n\nNomad 的设计避开了轻客户端，转而支持消息树和欺诈证明。因此，开发人员无需成为共识专家即可为 Nomad 做出贡献。我们专注于使内部流程平易近人，并为 xApp 开发人员提供清晰的界面和明显的最佳使用实践。\n\n## 安全胜过形式主义\n\n当我们决定不在 Nomad 的设计中包含轻客户端时，我们也放弃了正式的安全性。虽然这个决定对简单性和运营成本有巨大的好处，但我们不得不承认 Nomad 不会被证明是安全的。Nomad 被设计为在实践中是安全的。\n\nNomad 的核心渠道依靠欺诈证明和发布证明来防止渠道故障。此外，它允许用户和应用程序开发人员委托信任保护者，他们可以减轻欺诈的危害。换句话说，Nomad 的系统设计选择通过护栏提供安全性，而它无法提供可证明的安全性。我们相信这是实现我们目标的唯一选择。\n\n# 没有解决办法，只有取舍\n\n这些信条不是普遍真理，我们尊重其他观点。我们相信形式主义和系统设计的力量，并且我们了解实现目标可能需要复杂性。\n\n我们尽可能使用这些工具来改进我们的产品。不幸的是，在现实世界中，有时必须做出权衡。我们不能总是一边吃蛋糕一边吃。当**必须**做出牺牲时，Nomad 设计原则指导我们做出复杂的决定，它们是我们衡量成功的标准。\n\n我们邀请您与我们一起踏上跨链未来的旅程，我们很乐意在我们的 Discord 和 Twitter 上收到您的来信。Nomad 团队正在孜孜不倦地工作，以确保我们提供最佳的桥接体验，我们很高兴看到这个新兴的生态系统在下个月、下一年及以后的发展方向！\n\n如果您有兴趣在外面外看到这些内容，[请查看我们的 GitHub](https://github.com/nomad-xyz/)，[阅读文档](https://docs.nomad.xyz/)，并[桥接一些令牌](https://app.nomad.xyz/)。", "timestamp": 1659162992, "digest": "TqIBMXlsMo6JFWrLPybO17CS63V0XF2Q6OKZkI0tKGY", "contributor": "0xF0CEAe38Ac7c4BD57fb200e1d9bdBFa37073E60C"}
{"id": "3YuYMs3SNUnFjFmYvq8gRqpJIucW_YNY9F6B1QBwu_s", "title": "延迟满足感——币圈赚钱的重要能力", "body": "**○**\n\n首先问大家一个问题，在币圈赚钱，拥有什么样的能力最重要？\n\n对于这个问题，相信答案一定是众说纷纭。但在我看来，最终的答案只有一个——延迟满足感。\n\n \n\n一\n\n相信大多数人都听过著名的一个实验：棉花糖实验。\n\n实验人员给一群小孩每人发了一颗糖，然后告诉所有的小孩，如果能够拿着这颗糖不吃，那么在半个小时之后就可以再得到额外的一颗糖。\n\n在半个小时之后，大多数小朋友都选择将糖吃掉，只有少数的小朋友忍住了诱惑，从而得到了额外的一颗糖。\n\n30年后，实验人员对当年的这些小孩进行了回访调查，**发现那些能够坚持半个小时不吃糖的小朋友，现在在学业或事业上的成就，普遍高于那些没有能够坚持不吃糖的小朋友。**\n\n其实这个实验目的就是为了测试这群小朋友的一种叫做“**延迟满足感”**的能力。而这个能力从某种意义上来讲，**能够决定今后我们人生的高度**。\n\n \n\n二\n\n扎克伯格在创立了Facebook之后，公司发展迅速并成为了独角兽公司，此时雅虎希望以10亿美元的价格收购Facebook。\n\n这时扎克伯格就需要作出一个选择：*接受雅虎的收购，立刻得到10亿美金，不仅可以立即兑现满足感，而且下半辈子也就不愁吃穿了；或者不接受收购，继续把公司做下去，并冒着公司失败的危险，延迟满足感*。\n\n而最后，扎克伯格做出了正确的决定，并选择了后者，因为扎克伯格拥有大多数人所没有的延迟满足的能力。\n\n \n\n三\n\n现在很多人都想减肥，但是最终成功的人都是极少数。那么为什么减肥那么困难呢？我认为其实还是大多数人都没有“延迟满足感”的能力。\n\n许多人在坚持减肥没几天之后，就觉得应该放松一下，好好犒劳下自己了。*于是去大吃一顿，结果使得自己之前一段时间的努力全部白费了。*\n\n今日头条的创始人张一鸣也曾经反复提到“延迟满足感”的重要性。要想取得大的成就，请能够先耐得住寂寞，**延迟你的满足感！**\n\n \n\n四\n\n在币圈投资同样也是如此，大多数人都不具备延迟满足的能力，往往在赚了很少一部分钱之后，就急于卖出变现，因此错过了更大的上升浪。\n\n我们常常将比特币在这10年间上涨了数百万倍，但真的能够拿住比特币大部分利润的人可谓是屈指可数。\n\n因此，是否具备延迟满足的能力，决定了一个投资者在币圈能够取得多大的成就。", "timestamp": 1659163297, "digest": "c3NevuPij_6jQdwHtkx6zGBJSEIC6wv-evh23KVhloU", "contributor": "0x1b687F8295FB2bb110C0957B204e583df3cdDe9d"}
{"id": "86qkZqwQbqZcfqnjw73bsf_Rsn2OtAvuTz_BCNvjklE", "title": "AMD超越了对手英特尔", "body": "[AMD](https://www.cnbc.com/quotes/AMD) surpassed rival [Intel](https://www.cnbc.com/quotes/INTC)’s market cap on Friday.\n\nAMD stock rose over 3% for the day, giving the chipmaker a market capitalization of $153 billion. Intel fell nearly 9%, a day after [disastrous earnings](https://www.cnbc.com/2022/07/28/intel-intc-earnings-q2-2022.html) that missed expectations for profit and showed declining revenue. Intel’s market cap was $148 billion at the end of trading on Friday.\n\nThe shift is mostly symbolic, but it signifies a much more competitive market for PC and server chips, where the two companies compete directly.\n\nThe milestone also suggests that investors may value an asset-light chipmaker over one that’s investing heavily in manufacturing. AMD outsources production to outside “fabs,” or chip factories, whereas Intel has said it plans to continue building and operating plants.\n\nIn recent years, AMD chips have become much more competitive with Intel’s products in terms of performance, even surpassing their speed and efficiency for some applications.\n\nIntel said on Thursday that its disappointing report reflected execution issues and dropped its forecast for full-year earnings per share from $2.30 to $3.60. Intel also blamed a slowing PC market and macroeconomic conditions for its miss.\n\nIntel CEO Pat Gelsinger compared the company’s comeback strategy to [climbing Mount Kilimanjaro](https://twitter.com/dee_bosa/status/1553092283565613061) in an interview with CNBC on Friday.\n\nAMD reports fiscal second-quarter earnings on Tuesday, when investors will be watching to see if it is facing the same macroeconomic challenges as Intel as PC sales [drop around the world](https://www.cnbc.com/2022/04/11/pandemic-boom-in-pc-sales-is-over.html).", "timestamp": 1659163340, "digest": "H3Rip6m_gxv-5X7sSmALa1F9byQLVwHsc72bPv3d3KQ", "contributor": "0xE81b7814eF50eF5af43d0d93cD1d94ef62b712cb"}
{"id": "jNPp76f8vzqUGoIpywEhxeQGyv16Htn43GK1mjtQwsY", "title": "论自律", "body": "人为什么会自律，一定是有更高的使命，更崇高的追求，才会抑制住内心的渴望，去做可能枯燥或者困难的事情，这是一个跟自己斗争的过程，可能很难取胜，或者说很多时候只是暂时靠意志力做到，长期的话还是要有奖励的机制，自律也是需要有成果，才会有更为原始的冲动，而不是单纯靠意志力来维持。", "timestamp": 1659163489, "digest": "_ryEcn83VzThGl9pRqUu51sAbWnMUIPff0fmchx7eLc", "contributor": "0x2b93C4C6f84553FF4275bc0f9581622711D1e6Cb"}
