{"id": "bvtpofkp-3hW2hLWa0kITC6hosu5t7RlOIVkQscVt8E", "title": "SHAGGED", "body": "this is what i did to ur mum\n\n[ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/223](ethereum://0xabEFBc9fD2F806065b4f3C237d4b59D9A97Bcac7/223)\n\n", "timestamp": 1654528339, "digest": "autR2SYaD78Os5-pg6HOyJ5S6QYREpUs7SeRWDjEm6s", "contributor": "0xde0FE8538Cc42fF4d846Cf8Ca4Bf0345517a274D"}
{"id": "DLcu7INobxazsS5SzNw-JhVvbAOwR4iPnGWzmzqXenQ", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年6月，基本上经历了一整轮市场从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528153, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "G5qGwN8cmjDMfaqAjBe3y2nqfDP3J6pmaT48C-pMpsI", "title": "Less is More", "body": "Less is More", "timestamp": 1654528275, "digest": "l4XtOGOTcDrm--9YJIvT41MSnJFUknuFu5mQogev4RM", "contributor": "0x0933e58414E5772113cCa71b3c13964d682435D6"}
{"id": "nZiudryz2oLpiBCrLL6IrK4cRBY_UIU5YY2Uo2TeXaw", "title": "Tìm hiểu về Zetachain - Giao thức tương tác Omnichain (Vietnamese version)", "body": "## Bối Cảnh\n\nBạn có nhớ cụ thể có bao nhiêu cách để kết nối các mạng lưới blockchain khác nhau hiệu quả?\n\nThực tế có rất nhiều cách khác nhau làm được điều này. Phương thức phổ biến nhất người dùng và các nhà phát triển DeFi thông qua các ứng dụng cầu nối và các giao thức chuỗi chéo để kết nối.\n\nNhưng thực tế là giải pháp này cũng không quá dễ dàng với đa số người dùng, đặc biệt là người dùng mới. Hãy cũng tìm hiểu cách vận hành này:\n\n![Cách vận hành giao dịch chuỗi chéo hiện nay](https://images.mirror-media.xyz/publication-images/1CzHuq8CwIRRG_znUYCBQ.PNG?height=885&width=691)\n\nThêm vào đó, các ứng dụng cầu nối và các giao thức chuỗi chéo còn thường xuyên gặp phải sự tấn công từ các hacker vì tiềm ẩn nhiều lỗ hổng bảo mật. Điều này đã gây ra nhiều thiệt hại rất lớn cho người dùng.\n\nChính vì vậy, Zetachain được ra đời với sứ mệnh khắc phục những vấn đề này thông qua phương pháp tiếp cận đa chuỗi, cho phép bất kỳ tài sản thuộc bất kỳ mạng lưới nào cũng có thể lưu thông dễ dàng, tự do.\n\n![Zetacahain - Giao thức tương tác dựa trên hợp đồng thông minh Omnichain](https://images.mirror-media.xyz/publication-images/XLfUDlDGIfxeVeg7bIDJJ.PNG?height=643&width=665)\n\n## Zetachain Là Gì?\n\nZetachain là một giao thức cơ sở hạ tầng chuỗi chéo được xây dựng trên Cosmos SDK. Zetachain giới thiệu một concept mới là Omnichain Dapps (odApps). Với kiến trúc của mình, Zetachain cho phép các nhà phát triển tạo ra các odApps dễ dàng giống như việc phát triển dApps cho một mạng đơn lẻ như Ethereum hoặc Polygon trong khi có thể tận dụng khả năng tổng hợp trên các mạng.\nKhả năng của Zetachain là vô tận nhưng với vị thế là một người dùng phổ thông, hãy hiểu về các lợi thế mà Zetachain mang lại:\n\n* Chuyển đổi tài sản, dữ liệu xuyên chuỗi đáng tin cậy theo mã thông báo gốc mà không cần phải bọc.\n* Cầu nối phi tập trung giữa các dữ liệu, mạng lưới.\n* Hợp đồng thông minh Omnichain giám sát và vận hành liên mạng lưới.\n* Omnichain Dapps (odApps) gia tăng hiệu quả sử dụng vốn, tính thanh khoản trong DeFi.\n* Mang đến các sản phẩm đầu tư mới trong DeFi với những ưu điểm khắc phục nhược điểm của các sản phẩm cũ (các giao thức cho vay, năng suất, AMM Dex chuỗi chéo, ứng dụng Omnichain NFT).\n\n![](https://images.mirror-media.xyz/publication-images/SIW8tO--4qPE-f7NtgeAB.png?height=700&width=1400)\n\n## Về Bảo Mật\n\nTrong xu hướng Multichain, các giao thức chuỗi chéo là thành phần quan trọng giúp tăng thanh khoản và sự tương tác giữa các blockchain.\nTuy nhiên đây lại là \"mắt xích\" yếu nhất khi bị hack liên tục.\n\n* Ronin Bridge: 620 triệu USD\n* Poly Network: 610 triệu USD\n* Wormhole: 325 triệu USD\n\n  (Nguồn: Coin98 Insights)\n\nNhận thấy vấn đề này, đội ngũ phát triển Zetachain tập trung tối ưu khả năng kết nối dữ liệu và tài sản trên các mạng lưới thông qua việc áp dụng tendermint cho cơ chế đồng thuận và xây dựng cơ sở hạ tầng phi tập trung. Tất cả các giao dịch và quyết định được thực hiện (thông qua thay đổi trạng thái) đều được ghi lại trong các khối ZetaChain có sẵn, không thay đổi, có thể xác minh và hoàn toàn minh bạch.\n\n![](https://images.mirror-media.xyz/publication-images/weOX1-oX--Xyk3Ptsj3T1.jpg?height=500&width=582)\n\n## Mã Thông Báo $ZETA\n\n$ZETA là mã thông thông báo đại diện cho giao thức Zetachain, được sử dụng để để thanh toán phí gas cho mạng lưới và duy trì tính bảo mật chuỗi khối thông qua các hình thức bonding/staking/slashing.\n\nTheo như đội ngũ Zetachain, họ sử dụng $ZETA đại diện cho giá trị cross-chain vì:\n\n* Giảm bớt đi hình thức đại diện cho cùng một loại tài sản vì không cần bao bọc tài sản đó nữa.\n* Giảm bớt sự tấn công, giúp việc kiểm toán dễ dàng và cải thiện bảo mật vì chỉ có những giá trị gốc được cross-chain thông qua $ZETA.\n* Sử dụng $ZETA làm phí cho các dịch vụ mà Zetachain cung cấp.\n\n## Nhận Xét\n\nTheo những gì được giới thiệu, đội ngũ Zetachain đã có kinh nghiệm trong lĩnh vực tiền điện tử từ năm 2013 và các thành viên đều đã từng làm việc cho các dự án lớn như Coinbase, Brave, 0x. Dù mới chỉ bắt đầu và còn nhiều thông tin chưa được công bố chính thức nhưng đội ngũ Zetachain cho thấy sự trau chuốt cho sản phẩm của mình khi các kênh thông tin về dự án luôn được cập nhật thường xuyên hướng đến việc giáo dục cộng đồng tốt hơn. Ngoài ra, đội ngũ cũng rất chú trọng đến việc phát triển cộng đồng của mình thông qua việc tổ chức các sự kiện (cuộc thi meme, cuộc thi viết, chương trình đại sứ). Nếu bạn muốn tìm hiểu thêm về Zetachain, hãy tham gia cộng đồng sôi động này:\n\n* [Discord](https://discord.gg/NKAUn7d5vX)\n* [Telegram](https://t.me/zetachainofficial)\n* [Twitter](https://twitter.com/zetablockchain)", "timestamp": 1654528179, "digest": "NCiV9HPuvZisu0G0SrbbcypffONqLAFkANpOCc2neGM", "contributor": "0x3d54DbEE5C5d0215246199e177F629e607CEb7d5"}
{"id": "QXcXspUA_JMBdCGI5r0QrmwBMPZDESBbc0zlwBpIKnU", "title": "SHAGGED", "body": "this is what i did to ur mum", "timestamp": 1654528216, "digest": "NiKShYDpUtTiIk8iVH8aBGM6Dg0oeiflCn8EkQmAh8Q", "contributor": "0xde0FE8538Cc42fF4d846Cf8Ca4Bf0345517a274D"}
{"id": "qxWzjQ3cxldTZ0kjUm79D-IpTAT0OdHYTurZOVFQAGM", "title": "ทำความรู้จัก Synthetix - Derivatives Liquidity Protocol", "body": "## Synthetix คือ อะไร\n\nSynthetix (ซิน-เธ-ทิค) เป็นระบบการเงินรูปแบบใหม่ ที่สร้างสินทรัพย์ (synthetic assets) ขึ้นมาใหม่ โดยอิงกับราคาสินทรัพย์จริง เช่น ETH เป็น sETH, USD เป็น sUSD, XAU เป็น sXAU(ทอง) เป็นต้น เพื่อที่นำเอา synthetic assets ไปต่อยอดสร้างสินค้าอนุพันธ์ต่างๆ (Derivatives) และให้ผู้ใช้ได้เข้าถึงสินทรัพย์เหล่านี้บน Blockchain ได้\n\nSynthetix เป็น Decentralize Finance อยู่บน Ethereum L1 และ L2 optimism, Synthetix เริ่มต้นบน Ethereum L1 ปี 2018 (2561) และในปี 2021 ก็ได้ทำการย้ายมาที่ Optimism. การซื้อ-ขายจะทำผ่าน contracts ซึ่งจะทำให้ปลอดภัยและเข้าถึงได้ง่าย. Synths(ตัวย่อของ Synthetix assets) ของ Synthetix นั้น สามารถอิง assets ครอบคลุมถึง คริปโต, หุ้น, น้ำมัน, ค่าเงิน และอื่นๆ ในอนาคต\n\nการสร้าง Synths นั้น จะเริ่มจากที่ Synthetix stakers จะเป็นผู้ค้ำประกัน sUSD ที่ถูก mint มาจาก dApp โดย stakers จะต้องนำเอา SNX (Synthetix Token) มาล็อคไว้และ mint sUSD ซึ่งคำนวนจากมูลค่าของ SNX ในอัตรา 300% มาค้ำประกัน ยกตัวอย่าง Stakers นำ SNX ที่มีมูลค่า $300 (SNX) ไป mint ที่ dApp ซึ่งจะได้มาเป็น $100 sUSD เป็นต้น หลังจากนั้นเมื่อผู้ใช้(ใครก็ตามไม่จำเป็นจะต้องเป็น stakers) มี sUSD ไม่ว่าจะได้มาจากการ mint หรือซื้อมาจาก dApp อื่น เช่น Curve, Uniswap หรือ AAVE ก็สามารถเปลี่ยน sUSD ไปเป็น synths อื่นๆ ตามที่ต้องการได้ (sETH, sBTC, หรือ sXAU) โดยนำ sUSD ไป swap ผ่าน Frontend ที่ทำการนำ Synthetix Protocol ไป integrate เช่น Kwenta\n\n> Synthetix เลยมี single pool ที่เรียกว่า debt pool เพื่อเป็นศูนย์กลางของ Synths ทั้งหมด ซึ่งจะถูกรับผิดชอบโดย stakers. Synthetix จึงเป็นเหมือน “**Liquidity pool”** บน DeFi ที่เป็นพื้นฐานสำคัญให้ Protocols อื่นๆ นำสภาพคล่องนี้(Liquidity) ไปต่อยอดสินค้าอย่าง Derivatives ได้อย่างหลากหลาย\n\n### ทำไมต้อง Synthetix\n\n* **Best price execution** **:** ผู้ใช้งานสามาถแลกเปลี่ยน synths ในราคาที่ดีที่สุดโดยแทบไม่มี slippage เลย ทำให้มั่นใจได้ว่าราคาที่แลกเปลี่ยนนั้นคงที่\n* **Lowest Downtime & Liquidation Risk :** ใน CEXs นั้น ในช่วงที่ตลาดมีความผันผวนมาก จะเป็นการยากที่จะทำการซื้อ-ขายในช่วงนั้น(downtime) การซื้อ-ขาย synths ทำผ่าน Optimism network ซึ่งก็มั่นใจได้ว่าผู้ใช้สามารถเทรดได้ และผู้ใช้จะไม่ถูก forced selloffs หากกำลังเผชิญกับ cascading liquidation ที่เกิด downtime แบบใน CEXs\n* **Simulated Liquidity** **:** ผู้ใช้สามารถเทรดโดยไม่ต้องกังวลกับคู่เหรียญ เช่น sETH > sXAU, หรือ sCHF > sSOL ได้ โดยยังคงคุณสมบัติ best price execution\n* **Secure Layer 2 : อยู่บน** Optimism ที่เป็น EVM equivalent และใช้ security ของ Ethereum Mainnet, มีการโค้ดโปรแกรมที่ง่ายทำให้เงินของผู้ใช้ปลอดภัย\n* **Any Asset Class :** สามารถเพิ่ม asset class อะไรก็ได้ โดยจะถูกบริหารผ่าน community\n* **Low Gas and Fees :** บน L2 นั้นใช้ gas น้อยกว่า L1 มาก ซึ่งก็จะมีโอกาสถูกลงไปเรื่อยๆ และทำธุรกรรมเสร็จโดนทันที\n* **Stake & Earn :** ผู้ใช้สามารถนำเอา SNX โทเค็นไปค้ำประกันโดยการ stake และจะได้รับรางวัลเป็น SNX โทเค็นจากการเพิ่มขึ้นของ SNX supply(Tokenomics) และ sUSD จาก fees ที่ได้รับจาก protocol ในทุกสัปดาห์\n* **Permissionless & Composable** **:** โปรเจ็กอื่นๆ สามารถนำเอาจุดเด่นของ DeFi blockchain โดยนำเอา perpetual futures contracts ไปใช้ในประโยชน์ต่างๆ ได้\n\n## SNX Ecosystem\n\nLiquidity pool นั้นเป็นหนึ่งในหัวใจสำคัญของ Synthetix มี Protocols นำประโยชน์จาก Synths นี้ไปต่อยอด เช่น Kwenta(Futures), Lyra(Options), Thales(Parimutuel Markets), Aelin, Curve, 1inch, Paraswap, dHedge, Yearn และยังมีอีกหลาย Protocols ต่อยอดไปจาก Lyra อีก เช่น Polynomials, Brahma, Fuerte เนื่องจาก Composable ของ Blockchain เปิดทางให้ Protocols นั้นเชื่อมต่อกันได้ง่าย มันจึงมีโอกาสอีกมากมายที่ทำให้ Synthetix เติบโตได้ในหลายรูปแบบ การที่หลายๆ Protocols นำเอา Liquidity ไปใช้นั้น จะทำให้ Synthetix ได้รับ fees จากธุรกรรมที่เกิดขึ้นและเป็นรายได้เข้าสู่ Synthetix และตกสู่ SNX Stakers หรือ SNX Holders ในที่สุด\n\n![Synthetix ecosystem](https://images.mirror-media.xyz/publication-images/IzS9IccxY8hlsQJv4QUKK.png?height=406&width=637)\n\n### Kwenta (เควน-ต้า)\n\nKwenta เป็น Decentralized Exchange Protocol ที่มีไว้ให้ผู้ใช้ซื้อ-ขาย Synths แบบ Spot หรือ Futures โดยนำ Liquidity และกลไกการซื้อ-ขาย(Exchange Mechanism) ที่ล้ำหน้ามาใช้เป็น Frontend ให้กับ Synthetix\n\nKwenta เป็นโปรเจ็กที่ใกล้ชิดกับ Synthetix มากที่สุด ซึ่งก่อนหน้านี้ Synthetix มี Synthetix.exchange แล้วเปลี่ยนมาเป็น Kwenta ใน L1 Mainnet หลังจากนั้น Synthetix ก็ได้ย้ายมา Optimism network เหตุเพราะว่า L1 นั้นไม่สามารถ scale ได้และมี fees ที่สูง จึงเป็นข้อจำกัดของการเติบโตของ Synthetix. Kwenta เป็นโปรเจ็กที่แยกออกมาจาก Synthetix เพราะจะมีความคล่องตัวที่สูงกว่ามาก หากแยกการทำงานออกมา และ Kwenta ก็มีโทเค็นของตัวเองด้วย\n\n[https://kwenta.io/](https://kwenta.io/)\n\n### Thales (เธ-ลีส)\n\nThales เป็น Parimutuel Markets Protocol ที่เป็นตลาดเปิดให้ผู้ใช้เข้ามาทายผลไปในทิศทางใดทิศทางหนึ่ง เช่น มูลค่าของคริปโตหนึ่งจะมีค่ามากขึ้น/หรือน้อยลง(Binary options), ทำนายผลกีฬา, เกม และเหตุการณ์ต่างๆ เป็นต้น\n\nThales ใช้ sUSD เป็นตัวกลางในการทำธุรกรรมต่างๆ ซึ่งก็เป็นหนึ่งใน usability ของ sUSD โปรเจ็กนี้เริ่มมาจาก Binary options ของ Synthetix และได้แยกออกมาเป็น Protocol ของตัวเอง และพัฒนาจาก Binary options เป็น Parimutuel Markets Protocol ซึ่งเพิ่มความหลากหลายและเข้าได้กับความต้องการของผู้ใช้ในรูปแบบต่างๆ ได้มากขึ้น\n\n[https://thalesmarket.io/](https://thalesmarket.io/)\n\n### Lyra (ไล-ร่า)\n\nLyra เป็น Options Trading Protocol ที่เหมือนกับ options ในตลาดการเงินแบบดั้งเดิม แต่ถูกพัฒนาด้วยเทคโนโลยีบล็อกเชนเพื่อให้ไปได้ไกลกว่า options แบบดั้งเดิม เช่น การใช้ Automated market makers(AMM), Tokenomics, Composable หรือ Permissionless\n\nสิ่งหนึ่งที่ทำให้ Lyra เป็น Protocol ที่น่าสนใจ เพราะการนำ liquidity pool ของ Synthetix มาใช้ในการค้ำประกันสินทรัพย์ของ options และป้องกันความเสี่ยง(hedging) การที่ Synthetix ไม่มี slippage เลยนั้น ทำให้ Lyra ลดต้นทุนและความเสี่ยงของราคาได้\n\n[https://www.lyra.finance/](https://www.lyra.finance/)\n\n### Aelin (เอ-ลีน)\n\nAelin เป็นตัวกลางที่ให้ protocols อื่นที่ต้องการจะหาทุนไปพัฒนาโปรเจ็กตัวเองใช้ในการระดมทุนจากผู้ใช้บล็อคเชน โดยไม่ต้องระดมจาก venture capitals ผู้ที่เปิดระดมทุนนั้นอาจจะให้เป็นโทเค็นจากการได้ทุนและจะถูกล็อคไว้ในระยะเวลาหนึ่งตามที่ตกลงกันไว้\n\nโปรเจ็กนี้เกิดขึ้นโดยบังเอิญ จากการที่ Kain (Founder ของ Synthetix) ได้พูดคุยทาง Twitter และได้เกิดไอเดียว่าน่าจะมีการะดมทุนผ่านผู้ใช้บล็อกเชนมากกว่า VCs. Deals ที่เกิดขึ้นบน Aelin นั้นบางส่วนจะใช้ sUSD ในการระดมทุนด้วย\n\n[https://aelin.xyz/](https://aelin.xyz/)\n\n### Protocols อื่นๆ\n\n* Curve ใช้ประโยชน์ของ slippage ในการ swap assets อย่าง stablecoin สกุลอย่าง sUSD, sEUR, sCHF, sETH, หรือ sBTC ที่ให้ผู้ใช้ curve ได้เรทที่ดีขึ้น\n* DEXs อย่าง Uniswap, 1inch หรือ ParaSwap ก็สามารถ integrate ประโยชน์ของ Slippage ได้เช่นกัน\n* dHedge นั้นเป็น asset management protocol ที่ให้ผู้ที่มีความสามารถผู้จัดการในการลงทุนบน DeFi สามารถสร้างกำไรให้แก่ผู้ที่ต้องการลงทุน ซึ่งก็สามารถเทรดจาก synths ได้เช่นกัน\n* มี protocols อีกมากมายที่ใช้ Synths ซึ่งไม่ได้ใช้โดยตรงจาก Synthetix แต่ก็ต่อยอดอีกไปจาก protocol อย่าง Lyra\n\n![other protocols](https://images.mirror-media.xyz/publication-images/lzqiVH7zy_92ZnlJC9BjL.png?height=164&width=649)\n\n## SNX Token ทำอะไรได้บ้าง\n\n* **Stake :** นอกจากการถือโทเค็นไว้เฉยๆ แล้วก็สามารถนำเอา SNX มาค้ำประกัน (collateral) โดยการ stake บน optimism dApp ของ Synthetix. stakers จะได้รับรางวัลเป็น SNX โทเค็น (จากการเพิ่มขึ้นของโทเค็นใน Tokenomics) และ sUSD (จากการที่ protocol เก็บ fees)\n* **Governance vote** : Stakers(ไม่ใช่ SNX holder) สามารถมีส่วนร่วมโดยการโหวตเลือก Spartan council, Ambassadors council, Grants council และ Treasury council เพื่อที่ให้ผู้ที่ถูกเลือกเข้าไปบริหาร protocol\n\n## จะ Bridge มา Optimism ได้อย่างไร ?\n\nการจะย้ายทุนมายัง Optimism นั้น แนะนำว่าให้ทำผ่านลิงค์ [app.optimism.io/bridge](http://app.optimism.io/bridge) ของ Optimism ซึ่งจะถูกอัพเดทอยู่สม่ำเสมอ\n\n[https://app.optimism.io/bridge](https://app.optimism.io/bridge)\n\n## จะ Stake SNX ได้อย่างไร ?\n\n* การ stake ต้องทำผ่าน dApp > [staking.synthetix.io](http://staking.synthetix.io)\n* แอดมินได้ทำไกด์เพื่อสอนวิธีการ stake และแนะนำอย่างละเอียด\n\n  [วิธีการ Stake $SNX](https://mirror.xyz/0x4412f44c7A3E60E9E1d545901b1EeB6DF0F92155/AcVqFDhHXk8Db-3PsVVbFyND_e5MBQcq0PT4veGPlUA)\n\n## Tokenomic\n\nในเดือนมีนาคม ปี 2019, Synthetix เริ่มต้นมีโทเค็นทั้งหมด 100 ล้านโทเค็น และมี Tokenomic แบบ Inflationary ซึ่งหมายถึงจะมีโทเค็นเพิ่มขึ้นเรื่อยๆ และไม่มี max supply\n\nอย่างไรก็ตามจำนวนการแจกโทเค็นนั้นถูกเปลี่ยนมาครั้งคราวเพื่อปรับให้สอดคล้องกับปัจจุบันให้มากที่สุด และล่าสุดเดือนพฤษภาคม 2022 นี้ทาง Synthetix แจกรางวัลอยู่ที่ 2,282,493 SNX ต่อสัปดาห์\n\n[https://www.coingecko.com/en/coins/synthetix-network-token](https://www.coingecko.com/en/coins/synthetix-network-token)\n\n## ประวัติ\n\nSynthetix นั้นเริ่มก่อตั้งมาตั้งแต่เดือนกันยายนปี 2017 ในโปรเจ็กที่ชื่อว่า Havven (HAV) โดยเป็น stablecoin และหลังจากนั้นในปลายปี 2018 ก็ได้เปลี่ยนชื่อเป็น Synthetix โดยมี Founder ที่ชื่อว่า Kain Warwick, มี Peter McKean เป็น CEO, Jordan Momtazi เป็น COO และ Justin J. Moses เป็น CTO\n\nSynthetix อยู่บน Ethereum ในช่วงเริ่มต้นนั้นมี synths และ inverse synths (ยกเลิกใช้แล้ว) และมีการค้ำประกันเริ่มต้นที่ 750%, Synthetix เป็นหนึ่งใน DeFi ที่เป็นที่รู้จัก และมี Community ที่แข็งแกร่งที่สุดในช่วง DeFi summer 2020 แต่หลังจากที่ Ethereum มีค่าแก๊สมากขึ้นจน stakers ไม่สามารถทำธุรกรรมคุ้มกับรางวัลที่ได้รับ ก็ทำให้ Synthetix จำเป็นต้องย้ายไป Rollup network ซึ่งเป็น Optimism โดย Synthetix เป็นโปรเจ็กแรกๆ ที่ร่วมมือกับทีม OP ในการใช้ระบบ และจึงทำให้ Ecosystem ของ Synthetix ขยายเป็นหลายโปรเจ็กในปี 2021\n\n![Kain Warwick (Founder)](https://images.mirror-media.xyz/publication-images/ruEAeD1cFrt9H_BMUevdQ.jpg?height=461&width=692)\n\n### ศึกษาข้อมูลเพิ่มเติม : \n\n[https://discord.com/channels/413890591840272394/937742470807162910/965982666308616224](https://discord.com/channels/413890591840272394/937742470807162910/965982666308616224)\n\n\n---\n\nผู้เขียน : [Miracle-](https://mirror.xyz/0x8c50651d964B1a573ba0cf51980CA51D9e42623C)", "timestamp": 1654528193, "digest": "FpdFYgqlBj5aTE2s9Wfu87pXoR0Y9yZgOFb2JjdIJNw", "contributor": "0x4412f44c7A3E60E9E1d545901b1EeB6DF0F92155"}
{"id": "-U5GBFoPEjM3Ktpjcl8ma19ZEJ8L2xyeoWSmiBZjAwU", "title": "After brand identity: a designer’s journey", "body": "### Storytelling lessons from a web3 branding project\n\nI recently saw this image in my Twitter feed, captioned with the sentence: \"Literally every web3 project\".\n\n![\"Literally every web3 project\"](https://images.mirror-media.xyz/publication-images/FCdzKQriJVwICMRy5ZJXp.jpg?height=751&width=1500)\n\nI giggled along at first. Later, I thought about that tweet again, and I realised it was right! At the time, I was designing prototypes for our web3 app, [After.](https://after.fund/)\n\nMy experience was so interesting and enlightening that I felt it could be helpful for other designers, too. So, here I will showcase my **brand-design journey**, and describe the lessons I have learned.\n\n### Preliminary research\n\nMy eye-opening research on different web3 projects brought up **a wealth of identikit brands** that reflected everything the infamous tweet describes.\n\n![Similar illustrations and font style among web3 projects websites](https://images.mirror-media.xyz/publication-images/0Jrl6CSsOymorWTZDwDgi.jpg?height=1080&width=1920&&size=medium)\n\nThese results also show that when it comes to branding a web3 project, designers can be somewhat clueless. This is partly because such projects tend to focus on rigid technical concepts that feel abstract and unfamiliar.\n\nOther designers simply feel **overwhelmed by the infinite possibilities at their feet.**  Consider that most of these projects live exclusively in the digital world: hence, just about anything is possible! So why is it that we keep on doing the same things?\n\n### Storytelling is the answer\n\nThis is not the first time I have talked about \"storytelling\".  That’s because for me, **storytelling is more than a buzzword.**\n\nStorytelling is my only way of working, and **the only path that leads a brand towards a strong, relatable sense of identity and purpose.** This is compounded when we consider that, most of the time, both (identity and purpose) are sorely lacking from web3 brand identities.\n\nIn the following paragraphs, I will illustrate the three steps that helped create our company's story.\n\n## Lesson01. Write your story from who you are, no matter how complex the technology or intangible the project.\n\nMost web3 projects try to paint a sophisticated brand identity, often using abstract and/or futuristic illustrations and imagery (*lesson 03*), blunt typography, and neon colours to explain who they are.\n\nThis is as far as their identities go, so no wonder they all look alike.\n\nFrom experience, I understand all too well that if you can’t explain “who you are” through images, you’ll also struggle to communicate your unique identity through words (aka content, *see lesson 02*).\n\nThe task becomes even more complicated when even you don’t know why your brand exists!\n\nTo overcome this issue, the first stage in branding your next web3 project is to **define your key differentiators** (in the form of a mission, vision, values and purpose). Only then will you **create a story that allows others to understand and share your beliefs.**\n\n**After** uses the blockchain technology of smart contracts to create **an automated, transparent, immutable, and private distribution of assets** at an event-based future trigger (for example the death of a person, or a change in their Will).\n\nAnswering Marty Neumeier's questionnaire (a set of 17 questions to find the *Onliness Statement*, that cardinal distinction that can help the business owners to create a prosperous brand.), we defined that our company's mission is **to help people realise the power of wealth.**\n\nFor this reason, the main inspiration for our story derives from the keys of Pluto. According to the Orphic Hymn to Pluto, among many other attributes, Pluto owns the keys that connect with God's capacity to give humanity wealth.\n\nIn ancient Greek burial practices, the **keys** symbolised revelations that the deceased was obligated to keep secret, along with a coin placed in their mouth to ensure a safe passage into the next world.\n\nWith such rich references to draw upon, the key became an essential visual element of After's branding, while the coin became **After's utility token #OBOL.**\n\n![After brandmark](https://images.mirror-media.xyz/publication-images/1lEDbqUMzrvrBRm4WMmDt.jpg?height=1080&width=1920&&size=medium)\n\n**After's brandmark is a key**, which features a bespoke design of the capital letter A on the top. This brandmark is enclosed in a geometric hexagonal shape, representing the value of privacy and secrecy.\n\nThis sophisticated and elegant brandmark is paired with **a bespoke sans serif typeface** representing the bold encrypted structure behind creating a Will through After's platform.\n\nThe design of the capital letter above the key is also used to represent the utility token #OBOL.\n\n![#OBOL symbol and tokenomics](https://images.mirror-media.xyz/publication-images/7AYiTtGX0_1h-DNybLFJV.jpg?height=1080&width=1920&&size=medium)\n\n## Lesson 02. Build a community through content, and project personality through fonts.\n\nIn a world that is entirely digital, such as web3, typefaces can break traditional print-rules and enjoy the freedom they deserve on-screen… where they can be the stars!\n\nUnfortunately, when they are overused, large, animated typefaces create a bustling environment that tires our eyes and drains our minds’ focus from the rightful heart of the brand’s storytelling: **content.**\n\nOne beautiful side of the de-centralised web is the **communities** that form from similarities in specific ideas, and your project’s unique values (as explained in *lesson 01*). So, the right content is critical.\n\nIf this interaction is missing, you will deprive your users of **meaningful participation in the web3 experience.** No matter how fancy and futuristic your project is, make sure your typeface is also clear, legible, and humanly expressive, so it can properly introduce your project to its users.\n\nFor **After**, we wanted to build a community whose **values could inspire future generations.** After must communicate a sense of immutability and permanence, because this is our promise to the community.\n\nOur content also reflects how After speaks to **a primal human need** (the desire to ensure a better future for our loved ones), which is powered by blockchain technology (immutability and permanence).\n\n![Organization of the content on After landing page](https://images.mirror-media.xyz/publication-images/pj0WuTw5eHDE-_MRYa1c3.jpg?height=1080&width=1920&&size=medium)\n\nOur values and duality are revealed in our specific choice of typeface.\n\nWe opted for **Frank Rhule Libre**, the digital version of a traditional serif typeface used mainly in print.  We then paired this with a modern sans serif font, **Lato**, which is exclusively designed for the digital world (though it looks good in print, too!).\n\nThe sans serif has been used in every header, to deliver essential concepts and help readers to scan the page effortlessly.\n\nLato, meanwhile, has been widely used in long paragraphs for its semi-rounded details that aid readability, as well as offering a sense of gravitas.\n\n![Some slides of our pitch deck to illustrate the usage of the typeface](https://images.mirror-media.xyz/publication-images/kt4Ms5XBxN853vjLjAkIH.jpg?height=1080&width=1920&&size=medium)\n\nStorytelling also helped us to elaborate the delicate **concept of death** in a personal and expressive way, focusing on positive legacy rather than heartbreak. For this reason, the word **\"departure\"** was chosen over “death”.\n\nOur users are referred to as **Afterists**: people who have taken control of defining a positive future for their loved ones.\n\n**After** also promises to make the **journey** towards creating a Will both pleasant and accessible – a simple process that is literally at their fingertips.\n\n## Lesson 03. Illustrate your story: create differentiation with your own visual language.\n\nColours and illustrations are powerful storytelling methods.\nHowever, if your web3 project's visual language feels similar to that of so many other projects, **how can you differentiate yourself?**\n\nAs we have already touched upon, the alarming similarity is likely due to your attempt to explain the technology behind the project (which most of the time is complicated and feels unfamiliar), rather than explaining the values and purpose of your brand.\n\nWhen illustrated with intention, **a compelling story has the power to spark conversation.**\n\nIf you explore your company's key differentiators (mission, values and purpose), you will be forced to **think creatively about your brand's unique story**, and how you can harness its competitive power.\n\nIn the case of **After**, our values inspired our colours: from the very light, like white and pink (emotion, afterlife, purity, clarity, meditation, light), to darker, more sophisticated shades like purple and black (wealth, death, meaning, passage, spiritual).\n\n![After brand colors and values associated with each color ](https://images.mirror-media.xyz/publication-images/zqXv2o4DfhxfKWGldDAxW.jpg?height=1080&width=1920&&size=medium)\n\nThis content (including our mission and purpose) inspired our illustrations.\n\nAs we mentioned in *lesson 02*, we used the words *journey* and *departure* to introduce and explain our app. An inspirational story, the Myth of Pluto, describes **the journey in the afterlife.**\n\nHence, I created a series of illustrations that visualise the passage of our Afterists to a world that is peaceful and everlasting, crafted from expansive architecture and infinite skies.\n\nThe illustrations are also part of **a** **non-fungible token (NFT) collection called Elysium** (from the Greek, *Ēlýsion pedion*; a conception of the afterlife developed over time by some Greek religious and philosophical sects and cults).\n\nThe Elysium artworks, or NFTs, will be distributed as a ‘pass’ to join the community. Only pass holders can unlock community-specific channels, or gain access to exclusive perks and rewards.\n\n![Samples of Elysium NFT collection](https://images.mirror-media.xyz/publication-images/Q1zRxx_Gl6Btv7C73z3hr.jpg?height=1080&width=1920&&size=medium)\n\n## Takeaways\n\nIn a world that changes so rapidly, storytelling can help web3 projects hold users’ attention, as they build lasting and memorable community connections. Working on our After's narrative, we learned:\n\n* Your mission, vision, values, and personality will **build your unique storytelling strategy.**\n* Your story will guide you towards choosing the right words for your content, and a typeface that clearly **expresses your ethos.**\n* Storytelling inspires illustrations that focus on the key differentiators, helping you forge **meaningful connections with your customers.**\n\n**We hope you enjoyed my designer's journey!  If you would like to start a new journey all of your own, that cares for and protects your loved ones, [you can visit After’s website to find out more.](https://after.fund/)**", "timestamp": 1654528172, "digest": "Wg9Dm5EOzloeGG0B0uNAzlh1EgcV96P9wQN1THSIC7w", "contributor": "0x38647F20D41ADE5BE2D68992dD6EFAE0ff0E0B24"}
{"id": "urEfH9ZAqzOloAfKact5ywRVOyCstGveQHmu3HZbEDo", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年初，基本上经历了一整轮从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中后期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528412, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "YtjZwslxza77MjvY0SYpUkj10aGdc-JrXWgCOCR0E-w", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年6月，基本上经历了一整轮市场从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，市场环境也不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员补助，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528190, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "E6FeJG1ydvr0SzpNrDnDjeApCkZbEtUXt1bCMCgXYBg", "title": "聊聊web3创业心酸史以及总结", "body": "写这个文章主要是记录创业中个人领悟出来经验和教训以及提醒自己后面应该怎么做。基本上都是个人主观想法，团队最后也算得上很失败，所以有不认同的点欢迎探讨。\n\n前景介绍： 我本科毕业后一直在互联网干码农，17年进场币圈当韭菜一枚，后来又读了个硕士。2020年初开始all in web3，一直持续到2022年初，基本上经历了一整轮从最熊到了最牛以及最后没落的完整经历，技术团队从5人到30人最后又到5人的过程。我们团队主要是做某公链底层的研发，涉及到节点软件算法架构等开发，只承接B端业务，无C端产品等，所以坦荡地讲没做过任何对不起任何人的事情，这点认识我的朋友基本都知道～团队每年的研发成本大概在一个A8，也就是说每年没赚到A8的钱就是亏，当然整体现在看下来一直是亏损的状态，中间也尝试过对接资本方，但是最终也种种原因放弃了。\n\n### 个人经验\n\n1\\. **合伙人**\n\n在整个web3的创业过程中，我觉得最重要的就是**合伙人的选择**，这个是至关重要的。在一个核心团队中，一定是需要不同的人能够承担起不同的责任，并且起码在自己的责任范围之内干好自己的事情，一个好的web3团队必须有好的技术,产品,运营甚至财务,法务,公关等。例如一开始我其实是偏向技术方向的，在公司刚开始运转的时候确实可以一个人把杂七杂八的事情承担起来，在2020年初基本上所有的技术商务产品等都是我在思考设计产出，也就是说我一个人基本上承担了公司绝大多数的重要业务。但是公司在整体开始运作了一段时间就很明显的感知到，缺少了产品缺少了运营商务等核心人物，光员工并不能处理好这些事情，后面业务稍微多了起来就开始扩招，在扩招阶段其实是有点盲目。合伙人并不是员工，合伙人要做的事情也不是仅仅做好老板安排好的活，而是主动积极的为团队搬砖添瓦，在挑选合伙人这个事情上不能有半点马虎，不仅仅要求个人能力出众也需要有奉献精神，也需要有达成一致的共识。在事情没有完全成功之前基本上必须保持一个付出的状态，而不是在公司起步没多久的时候就开始收获。合伙人要做的事情也不仅仅只是个完成本职工作，而应该是想怎么为团队的未来做更多有意义的事情。让一个合伙人加入各方面都得考察到位，深思熟虑之后才能决定。当然这个是难点所在，如何考察合伙人。在这个事情上我做的挺失败的，可以说当初是比较茫然的，觉得需要人来干活了，这个人挺合适的，立马邀约，没有一套自己的评判标准和审核机制。这件事情最后到头来依旧还是什么都得自己操心，在一次两次不靠谱之后你就很难完全相信他们能做得让人满意。放手让他们做吧最后往往都是他们不够上心，没法保证保质保量的完成，然后又回到了全盘操盘的模式。\n\n在合伙人这件事情上，每个人需要发挥自己的优势，扬长补短。一个团队要做的事情非常的多，没有人是万能的，没有人能做好所有的事情，但是一个合伙人必须能干好其中的擅长的负责的某一部分，而不是让所有人来操心。在我这次创业过程中，交给你这件事我放心这句话，我能讲出去的时候少之又少，我就知道后面会更难。但这已经是在中后期了，意识到问题的时候几乎无能为力了。\n\n**2.过苦日子**\n\n**创业就是吃苦，吃不了苦的人不用创业。**\n\n因为早中期公司业务还不错，绝大多数的时候我们的福利待遇比传统互联网公司更好，薪资待遇更高，办公环境也更好，各种小福利也不少，加班也几乎没有。后面员工过来的时候甚至基本上过上了外企的生活，我并不认为这样不对（我个人是支持1065的，并且公司一直都是这么执行），但是注意，我们还在创业，我们不是躺着就能睡大觉，无忧无虑的那种公司，在工作时间内保质保量完成任务这个是基本条件，但是核心是**效率高**，在效率足够的情况下，准时上下班我觉得没有问题，我之前在互联网公司的时候基本上一天的活高度集中效率2小时足够干完，剩下的基本上都是杂七杂八的杂事。在效率不够高的时候，拖拖拉拉的完成任务，这显然不是一个创业团队应该做的事情，对于创业来说效率和时间都是相当重要的。你慢了几个月你可能就错过了活下去的商机。在我们团队全程期间，基本上全程都是养老的状态，除了我大多数日子都是007，可以说我替所有员工打工。作为一个员工确实可以养老，但是如果加入创业公司是为了工资，可以有更好的选择，稳定的大厂也是不错的地方。在创业公司的优势就是你可能拿到早期股票，我们团队基本核心员工都持有股票，在事情没成功之前看起来确实是空头支票，但是也这个是我每百分比真金白银的投资进去的，甚至到中期融资的时候也有不错的估值，可以说创业公司最大的好处就是，你的付出是有可能有大回报的，虽然这个概率极低。但是在保证稳定收入不低于互联网的同时有搏一搏高收益的机会，不去争取的话是不是显得毫无意义。我们中后期团队基本上懒散，没人愿意多干一点活，没人愿意多想一点事情，不安排任务就不会主动想一点工作上面的事情，在团队人数稍微多一点的时候，不可能让我来安排每个人每天要干什么，绝大多数人都得有自觉力和自控力。早中期福利待遇比较优越，导致缺乏的上进心也是很明显的暴露出来的问题。\n\n核心团队在创业初期就是得吃苦耐劳，主动承担，创业不是来享受。或者说去公司享受也没问题，但是你没可能变成核心人物。\n\n**3.管理**\n\n我们整体来说管理上也是有很多问题，人少的时候倒不会暴露出来，稍微一多各种问题其实就很明显。互联网公司的等级制度或者说KPI都是有他存在的道理，甚至说在公司层面必须有完整的一套管理制度，任何事情按照制度来，也需要有对应的员工考核制度，不能说因为某个人某个事而特殊对待。在这个事情上我们做的挺失败的，我基本上把每一个员工当兄弟看待，每天嘻嘻哈哈欢欢乐乐的，但是事实上这样子执行久了，会丧失领导力，是会有大问题的，在整体执行能力上会极大的减弱效率，效率就是创业公司的生命线。模糊了上下级边界之后，指挥起来就会更加的困难，就像车的方向盘不能控制车轮方向一样，致命危机。这个事情在团队后期缩减之后准备转型做投研的时候爆发的更为明显，我们团队中其实是有专业的数据分析，配合上对技术底层的理解，其实在整体市场非情绪方面的方面对各种项目的研究是比较准确的。刚开始转型与每一个人沟通之后大家都说乐意干投研，但是事实上没一个人愿意干这件事情，每天仿佛就只有我一个主讲，讲完每一条赛道每一个方向的研究分工之后，落下地的却是第二天依旧我主讲，现场鸦雀无声，提问一问三不知，最令我生气的是在我指定了某某研究某某项目之后，依旧鸦雀无声。因为没人觉得我就要听你的，我不说话你也不能拿我怎么样。每天除了晚来早走，讲不出一句话，这样又磨了几个月耗干了我最后一点精力，让我放弃带领他们做好投研的思路。\n\n在管理上面，公司非人情世故，必须有一套完整的规章制度，并且按照执行，公司就是公司，在公司层面无论如何，上级就是上级，在个人层面我们兄弟还是兄弟，这并不冲突。\n\n**4.规划**\n\n无论是公司还是个人都得有一个规划，可以分短期中期长期，在公司层面比如说1年，2年，5年等规划，时间近的必须制定详细，长远一点的有好思路或者方向即可，因为这个可能变的概率还是蛮大的。在规划这件事情上我们也挺失败的，可以说就是造，有钱有业务就扩招，一直到2021年中下我才开始筹划资金如何度过后面的熊市，开始准备融资，扩大业务多囤点资金。其实时机上已经错过了最好的机会，如果早点做准备，后面可以很从容的应对这一切，而不是赶鸭子上架。行情不好配和上国内各种政策的限制，公司资产绝大多数都是币的情况下也极度缩水，也就进而导致后面出现的资金问题。早点为未来做好规划和打算，给公司多留一条后路也是相当重要的。短期规划来看其实就是技术业务产品的成长，长期来看就是路线的发展，其实留给国内公司的发展路线也并不多，真正想合法地做好事情限制还是相当多的，我们所有的流程业务都是合理合法，所以也被限制住了手脚。我们后期主要业务也是政企联盟链业务，怎么说呢阉割版区块链的，做的并不是很开心。但是为了活下去还是承接了做了起来，可能这就是规划赶不上变化的。\n\n对于创业团队来说，大方向的规划必须随着时代的发展来进行调整，有什么好的机会一定要抓住。一旦开始迷茫，可能就是走上死亡之路。\n\n5\\.未完待续后续补充\n\n#### 总结：\n\n从2021年中后期到现在，公司基本上全靠我贴钱运营，包括开始转型投研的前期资本，后面裁员赔偿，封城了还有工资发放，各种其他费用，整体来说对于我个人亏损巨大，但是在这次完整的创业过程中，其实学习到了很多无论是课本上还是工作上都没法教你的知识，也认识了许多优秀的人，结交了不少web3的创业者，也认识了很多大忽悠和大骗子。在build web3的过程中，其实是快乐的，我热爱的是这份事业，并且愿意一直奋斗下去，无论亏盈。在6.6号这个日子里我正式的解散了奋斗两年多的公司，并且在努力的赚钱结清各种费用，幸运的是我个人一直在投研，长线看营收还算不错，能够贴得起亏损。贷款创业千万不可取，轻易不要尝试，人也要懂得及时止损。创业路上不可能一帆风顺，现在的我加入了一个新的团队，即将润出国（我慎重考虑过，觉的挺不错的），又能学习到很多新的知识，认识更多有趣和牛皮的人，边学习边前进，为web3搬砖添瓦。\n\n我敬佩每一个敢去创业的人，创业过才知道其中的心酸。\n\n如果你也是个创业者，欢迎多沟通，我这个失败者向你们学习～\n\n[https://twitter.com/Daniel_eth2](https://twitter.com/Daniel_eth2)\n\n", "timestamp": 1654528427, "digest": "BOK04Su_gtcN3HDzvsZv3jSWTNbv4Bmkpl6B6NfkHv0", "contributor": "0x6EaD271a45ACc328Af22b369870509471a46f59D"}
{"id": "HV7HGt8UY-yxlYVo80ko6xN_BPys7Y3MDgKEvywTwPY", "title": "Saying Goodbye", "body": "I don’t even know how to begin. What am I writing? This is goodbye. So long to people. I am trying my best to write this in earnest. This is my life. Money is simply a tool and we tool each other. Enough of that. Let’s get to it. The heart. That’s where the story begins. Let there be light, *Für Elise.*\n\n![NOSTALGIA LITE: Lambo VHS Casette Rewinder](https://images.mirror-media.xyz/publication-images/CIZtqss8DW0D39mr0YSK9.png?height=688&width=802)\n\nA moment exists between birth and memory, the weeks, months and years therein shape your identity without your knowing. I call this *the first draft.* The ink that spills between the lines of our lives. Identifying with this record is outside of our waking boundaries; escaping us completely yet rooted in our essence. For the sum of our emotional impressions gathered during *the first draft* remain. Who we are *is what that is*. We spend our lives returning time again in search of. I found myself back home with her.\n\nAir, the space between our thoughts, shaped mathematically is the sound of music. Patterns resulting in harmony, melody, sonic texture and more. The world today is a kaleidoscope of sound; Music Industry revenues are forecasted to grow 84% by 2030. That’s a whole lot of 000s, but let’s get to the point. Why. do. we. do. this? *Für Elise*. I first met her on Christmas day, before I could even remember my own name. This VHS cassette rewinder was shaped like a lambo, and when you rewinded the cassette it would play Für Elise. It became my singularity, like someone turned the lights on.\n\nIn my life, this moment defined me. I’ve even told my friend that this lambo VHS tape rewinder was my personality. It had utility, it had style. It was an instance of culturally significant technology. Most people had the normie VHS cassette rewinder. If you had this lambo VHS tape rewinder, you were for sure one of the lucky ones.\n\n![NINETYONEMGMT Graphics Standard Manual (2017)](https://images.mirror-media.xyz/publication-images/kI2Z5gkJ_mddRZjnZ96-t.jpg?height=2160&width=3840)\n\n## Getting Lost\n\nSchool, work, love, fuck. If you’re doing alright, you’d do all four. What happened was that at some point life became vaporware and then things weren’t alright anymore. But they weren’t bad either, they were just.. okay. It happens to the best of us. When you wake up, you just get back on track. I quit my day job and chased the dream. Las Angeles, my only friend. She felt natural and I was too. A one way ticket never hurt nobody. 2017 was the year of the sofa; the same year NINETYONEMGMT was born, too. Explicitly or not, we managed an artist by the name of Riz La Vie and worked out of the SONGS Publishing office in LA to coordinate his one and only hit, Napkins.\n\n![Sunset Boulevard, West Hollywood (2017)](https://images.mirror-media.xyz/publication-images/NCUKqmqX_ZgVBJ1AMoi5d.jpeg?height=1050&width=1400)\n\n[Success ensued](https://mega.nz/file/pAkx3ZBC#3tq4Tt0RpVy09C5hy9SsGfALFeII7A3En6riCjaQbps), but we weren’t happy. I got into the business to make massive records with artists I love and holistically champion their estate. Yet somehow, we were not incentives nor values aligned. I had to split. I got into a wreck both [figuratively](https://mega.nz/file/EYNynZCY#4_ecD4Cp967BEDQZFx4W0v1EL0IXOz9Yl-M_fT_etMU) (2019) and [literally](https://mega.nz/file/NFliFTBS#5tq7dYDGSedJPybHBylt7hl5ln8KK7oLVlLGRk1URBE) (2020). Ask anyone close to me and they’ll tell you I am lucky to be alive, or re-alive, or rebirthed. You’re down bad when you fall from heaven and I felt cast away like Lucifer when he fell. Revenge captured me; for the last two years I’ve been working through contempt, feeling loathsome of myself and my situation. I had to remember who I was to forget who I’ve become.\n\n## Rewinding The Cassette\n\nThey say that life is like a movie, but do they mention anything about sequels? Because I’d like to get what’s mine this time. My mind had become like the lambo VHS cassette rewinder. I got back to the music with each rewind. Für Elise, a song dedicated to a muse, a maid or a love interest perhaps; reminds me of a yearning. It’s a bittersweet tune with remnants of euphoria, a fitting synchronization to the movie I had just lived. I need to outgrow myself now and that’s why I’ve got to say goodbye.\n\n![Songwriting Sessions (2017)](https://images.mirror-media.xyz/publication-images/V-ibnwOYd055gltwu735e.JPG?height=3024&width=3024)\n\nIt was not without its moments, friends, and memories made. While still I act in full capacity as a talent manager, I no longer operate under this manifestation. NINETYONEMGMT had become Vaporware. Its time under the sun nearing an end. Dreamt up by a headstrong founder and creative, it is responsible for hit records, millions of streams, many dozens of shows, and lives changed. It had fulfilled what the founder had imagined, because at the time of its inception, the founder was very naive. We’ve got new dreams to dream, new songs to sing.\n\n## It’s up to \\*us\\*\\*\n\nMusic. Music. Music. It’s always been about the Music. Remembering who I am and what I was about, that saved me. Music saved me. The first time experience of Für Elise was like my own genesis. Simultaneously, I’ve forgotten who I am and remembered who I was. This is what you call a moment of clarity. The sum of my combined experiences remain, yet my outlook, attitude, and vision are born again. This time I’d like to take it to heights never before imagined.\n\n![Rooftop at Live Nation, West Hollywood (2018)](https://images.mirror-media.xyz/publication-images/cWKm3Exim8CTm6q0JLAfu.JPG?height=2726&width=4096)\n\nI borrow a piece of our old lore to explain our new direction:\n\n> “We are vanguards of creation and approach our work with a sense of exaltation and wonder.”\n>\n> \\- *NINETYONEMGMT ETHOS (2017-2022)*\n\nI’ve reached singularity again. Friends, I bid you farewell. I won’t be long, but I won’t be around much either. Now I spill my ink anew, a second draft on the way. I am back home and feeling well. I leave this text in memoriam. In honor of what we accomplished and with respect to the truth.", "timestamp": 1654528464, "digest": "nHGMwfBKvg1a_AtNa5DXXlO6Km2Akl12cfVTLbwx__Q", "contributor": "0xB6f7ddD59cf4Ce557bA2de0d7d1B2F4Bc948e133"}
