{"id": "93kUjwH267e_oPZHAfR0IzGkdUvu7g2DoV5K-7Svm18", "title": "mirror", "body": "mirror", "timestamp": 1655353913, "digest": "cg9bIbqt5j5ZyAIDf966lBhFezuPLXzMUstupSToC4s", "contributor": "0x6DFE4fa949b71a7449e14AA43c238581bEeb8b8e"}
{"id": "jdbAtFit3FbrhL28GHPt8ionl08AQzwjMx_BKMv4kCQ", "title": "CAT", "body": "FOR THIS MOMENT, IT DOESN’T MEANT ANYTHINGS. JUST MY POOR ENGLISH", "timestamp": 1655354081, "digest": "wlBEJkDiZA4Wd6PxT3nSvwb8BO7cybK0ZE1pLr_8kI4", "contributor": "0x0c6E5661D81d1185ffD6F4d70858b43e77199d9d"}
{"id": "OC1gHx9v0zvUNW1NFK0oROus6XUZDub82T0U9rSRr3E", "title": "mirror", "body": "mirror", "timestamp": 1655353632, "digest": "gzIv4SOjOJ6J7OFHa4055VfxbXiXYGgR2PC9yE7cv0k", "contributor": "0x480aF20fc944E5377e521a7819Cf54Bb7F11101d"}
{"id": "VrenOWxs7SIGc8hW16Fff9QpQk6PbXiCDnvYIb5fdRc", "title": "mirror", "body": "mirror", "timestamp": 1655353776, "digest": "nhVnfiXebV4WdaKHrtS3UVtCvAHoM-VSUti9wzXA0l0", "contributor": "0xe62ab1A4E3fc9Db812944CB2997cAAf108cb2e5B"}
{"id": "WF3mAg4rBm-CP3T2fB1hyEYNQqY4Vwa0NrhvF0BS_D0", "title": "Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655354075, "digest": "F1ZnA_-7fsyCzcCnfj6eaCei2FQGts1H2lMlzdDFWvk", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "YJ30MMl7wU_LqpTn4X_mgITeILbvSgePEVM5LN6m0NM", "title": "About rasmuky", "body": "## Who am I?\n\nJust for some context:\n\n* Young gen x or old millennial, depending on the source\n* Husband to an amazing wife and father to two wonderful sons\n* Lived in the United States my entire life. I’ve traveled an above average amount, but it’s save to assume I’m a relatively stereotypical American.\n* I generally feel more at home as a [system 2](https://www.greenbook.org/mr/market-research-news/lessons-from-thinking-fast-slow-system-1-and-system-2/) thinker, so don’t be alarmed if posts are longer than average\n* Relatively early adopter, but try to catch the transition once the UX is only mildly abrasive and not brutal. Web3 is getting close to this stage, I think\n* I’ve essentially been bankless since 2017 in the consumer retail TradFi bank context. I just don’t understand the value proposition of TradFi for retail banking clients, especially relative to the Web3 alternative\n* Majority of my career so far spent in M&A consulting (financial and data & analytics diligence), primarily within TMT / SaaS / AdTech\n* Also experienced in private equity investing, PE portfolio company operations / support, and corporate side finance and operations\n* I started to purchase some cryptocurrencies in December of 2020, but did not meaningfully lean into the ecosystem until November 2021 (currently wearing my top signal badge…)\n* Positive vibes only. There is plenty of stress, anxiety, and confrontation IRL. I’m going to stay positive and productive out here. Thank you to all abrasive folks keeping everyone in check. I appreciate you, but that’s not me\n* Although I’m loosely an anon, I plan to approach my mirror posts in a very authentic way. I won’t pretend to be someone I’m not or know more than I do. This makes me feel pretty vulnerable and exposed, but hopefully it resonates\n* I loath protection of legacy business models in all forms (regulatory driven, anti-competitive behavior, weaponization of the benefits of scale, etc.). Innovation suffers when we focus too much on improving from 1 to n instead of finding the next 0 to 1 technologies that will shape the future\n* I support innovation by voting in the most powerful way I can, how I use money. For example:\n  * I bought a Tesla Model X in 2018…and it’s still probably above what we should spend on a prudent budget\n  * But I chose to reward the innovators trying to build a better future instead of rewarding the boring Internal Combustion Engine (ICE) producers who call adding a 10th gear to the transmission in order to begrudgingly hit fuel efficiency standards (while simultaneously diluting user experience)…“innovation”\n  * I personally think anons place too much emphasis on cost differential at the moment of purchase. I do my best to reward innovation even if it costs meaningfully more now as costs should come down over time with adoption and scale and I prefer to fund progress, not status quo\n* This is not financial advice! I do wish the Web3 community would stop normalizing the disclaimer of all responsibility “DYOR” and emphasize sharing of research for the good of the community…but Do Your Own Research!\n* Lastly, I’m an [#Mfer](https://twitter.com/UnofficialMfers). We’re all Mfers.\n\n## The next major platform transition\n\nAfter college, I developed a healthy obsession with understanding how companies were valued and how equity markets worked. I even fashioned myself a moonlighting stock picker for a brief period. However, I quickly realized that I was not going to produce alpha analyzing Amazon earnings reports...the 100+ Wall Street analysts already covering the asset as a full time job would only leave beta for me (best case).\n\nSo, I focused on what I thought Wall Street simply couldn’t get right due to lack of imagination and / or over discounting of uncertainty: transformational platform level transitions. This is a nebulous term, but a few examples I invested in with conviction are:\n\n* **ICE → EV**: The size of the opportunity to transition from the ICE to Electric Vehicle (EV) platforms was / is massive. I Purchased $TSLA in 2016 and diamond handed until the end of 2020, then I took some gains. $TSLA remains a material hold and I’ll probably be in it to some extent forever.\n\n![Summary of TSLA and S&P 500 performance from position initiation in May 2016 to current price as of writing in May 2022. Annual growth rates and price multiples expressed based on simple day close pricing and do not consider actual cash flows, IRR, or actual cash on cash style analyses](https://images.mirror-media.xyz/publication-images/0W3YxQSry-i5EK5VKF1HZ.png?height=129&width=474)\n\n* **CPU → GPU**: ML, AI, AR, VR, crypto PoW, and autonomous driving all require compute greater than what a CPU is efficiently capable of. I purchased $NVDA in 2016 and held until mid 2020. The one that got away…I had paper hands on this one as the run continued past my exit. The amount of VC investments allocated to IPU start-ups started to concern me, though mass adoption of IPUs still has not materialized. The thesis has continued to play out and would have been an excellent hold up to date of drafting this post.\n\n![Summary of NVDA and S&P 500 performance from position initiation in February 2017 to current price as of writing in May 2022. ](https://images.mirror-media.xyz/publication-images/XJf40qRHyhubmkr8TU73r.png?height=112&width=473)\n\n* **Therapeutics → Genomic Therapeutics**: The advent of CRISPR and gene editing is expected to revolutionize genetic therapeutics. The CRISPR technology essentially gives doctors the ability to write software for biological entities, relative to pre CRISPR therapeutics which were essentially mechanical repairs. COVID-19 put a number of CRISPR companies in hyper drive ($EDIT, $NTLA, $CRSP), though IP litigation, finding the next great application, and negative market sentiment towards long duration equities (due to inflation and interest rate expectations) have slowed performance recently. I’m still long-term optimistic about this platform changeover and will continue to monitor progress. I initially invested in the basket of three previously mentioned equities, but later switched to $ARKG to reduce single ticker risk.\n\n![Summary of ARKG and S&P 500 performance from position initiation in July 2017 to current price as of writing in May 2022.](https://images.mirror-media.xyz/publication-images/xLfRZmchC9V9dWDtrl9Br.png?height=95&width=474)\n\nEach of these investments have unique and different elements, but all are what I think of as major platform transitions with high risk and high reward profiles.\n\n* I believe the key is to have high conviction that the transition will eventually happen and that there logically must be alpha to capture as Wall Street will heavily discount the probability of platform change success (it’s easy to bet on incumbents)\n* Also, as I am not a full time investor, this investment profile is attractive to me as it is very low touch. I try to pay attention to the news cycle close enough to catch any bombshell updates, but primarily just challenge my “leap of faith” assumptions once every 4-6 months at most\n\nI did also test a few lower conviction ideas like 3D printing ($DM), citizen data science transition to cloud ($AYX), and Space Exploration ($ARKX). All were exited in less than 12 months due to lack of conviction or timing (too early / too late). Consider this disclosure of my anti-portfolio.\n\n### Relevance to Web3\n\nAfter identifying the previously mentioned opportunities (most recently in mid 2017), I focused on a career change, had two kids, and more recently started to immerse in Web3.\n\nI think this type of platform transition is what will play out over the next 10+ years around Web3 in the centralized permissioned database → decentralized permissionless blockchain transition, and on a much more grand scale than the examples previously referenced given how pervasive the blockchain / smart contract use cases appear to be.\n\nThe industries, companies, and applications which I think will be disintermediated by trustless, permissionless, self sovereign payment and smart contract technologies will be wide ranging. I don’t know where the alpha is right now, but that’s what I’m here to find out.\n\nLastly, when I identified these first three platform transformations it was more of a hobby and not something that I leaned into meaningfully. Now that I have a couple of case studies that my thought process is not totally off base, I plan to lean in more to Web3 and hope to make it my full time job and obsession.\n\nTwitter DM me [@rasmuky](https://twitter.com/rasmuky) if you think we should work together!\n\n\n---\n\n[https://twitter.com/rasmuky](https://twitter.com/rasmuky)\n\n[https://linktr.ee/rasmuky](https://linktr.ee/rasmuky)\n\n", "timestamp": 1655353732, "digest": "lnFQ5wj4FfNKK0wcyOYt974y-9lnaD3M-iUAqS1bRe4", "contributor": "0xdb92c5C91a5D81Bd9865a07A42c7dD3F35bDA225"}
{"id": "bMyZZBnnImV1BdCOYvxA9YKcpTNYzzgHltezow9LERA", "title": "怎么购买艾司唑仑[咨询474y.com],迷幻药怎么买,艾司唑仑哪里有[咨询474y.com〗,在哪有卖失忆水购买,怎么购买迷药", "body": "怎么lsd致幻剂,老人 失眠 的 原因,lsd致幻剂出售,什么地方有迷药有没有副作用,如何 製作 春藥\n\n[https://search.mass.gov/?q=印度药房,什么饮料可以催情【官网474y.com】+&page=1](https://search.mass.gov/?q=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+&page=1)\n\n[https://www.sprint.com/content/sprint/sprint_com/us/en/searchresult.html?id16=印度药房,什么饮料可以催情【官网474y.com】+](https://www.sprint.com/content/sprint/sprint_com/us/en/searchresult.html?id16=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.lexar.com/zh-hans/?s=印度药房,什么饮料可以催情【官网474y.com】+](https://www.lexar.com/zh-hans/?s=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://nhm.org/search?keys=印度药房,什么饮料可以催情【官网474y.com】+](https://nhm.org/search?keys=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.sprint.com/content/sprint/sprint_com/us/en/searchresult.html?id16=印度药房,什么饮料可以催情【官网474y.com】+](https://www.sprint.com/content/sprint/sprint_com/us/en/searchresult.html?id16=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://malegislature.gov/Laws/Search?searchTerms=不斷更新快活液\\[微信2454793\\]%2C位 元 堂 養 陰 丸 失眠%2C快活液哪里有\\[微信2454793\\]%2C去哪里买嚴重 失眠 中醫%2C精神 科 安眠藥](https://malegislature.gov/Laws/Search?searchTerms=%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e5%bf%ab%e6%b4%bb%e6%b6%b2%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%bd%8d%20%e5%85%83%20%e5%a0%82%20%e9%a4%8a%20%e9%99%b0%20%e4%b8%b8%20%e5%a4%b1%e7%9c%a0%2c%e5%bf%ab%e6%b4%bb%e6%b6%b2%e5%93%aa%e9%87%8c%e6%9c%89%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e5%9a%b4%e9%87%8d%20%e5%a4%b1%e7%9c%a0%20%e4%b8%ad%e9%86%ab%2c%e7%b2%be%e7%a5%9e%20%e7%a7%91%20%e5%ae%89%e7%9c%a0%e8%97%a5)\n\n[https://www.tripadvisor.co.uk/Search?q=叹号搜索三唑侖〖微信2454793〗%2C失眠 要 吃 什麼%2C三唑侖去哪买【微信2454793】%2C真的有三 唑 仑 用量%2C經常 失眠 原因](https://www.tripadvisor.co.uk/Search?q=%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e4%b8%89%e5%94%91%e4%be%96%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%a4%b1%e7%9c%a0%20%e8%a6%81%20%e5%90%83%20%e4%bb%80%e9%ba%bc%2c%e4%b8%89%e5%94%91%e4%be%96%e5%8e%bb%e5%93%aa%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e7%9c%9f%e7%9a%84%e6%9c%89%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e7%94%a8%e9%87%8f%2c%e7%b6%93%e5%b8%b8%20%e5%a4%b1%e7%9c%a0%20%e5%8e%9f%e5%9b%a0)\n\n[https://www.teamlab.art/es/?submit=匿名搜索迷姦水\\[微信2454793〗%2C三 唑 仑 是 毒品 吗%2C迷姦水哪里卖\\[微信2454793〗%2C效果好的催情水订购%2C粉末 春藥](https://www.teamlab.art/es/?submit=%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e8%bf%b7%e5%a7%a6%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e6%98%af%20%e6%af%92%e5%93%81%20%e5%90%97%2c%e8%bf%b7%e5%a7%a6%e6%b0%b4%e5%93%aa%e9%87%8c%e5%8d%96%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e5%82%ac%e6%83%85%e6%b0%b4%e8%ae%a2%e8%b4%ad%2c%e7%b2%89%e6%9c%ab%20%e6%98%a5%e8%97%a5)\n\n[https://www.olx.com.br/brasil?q=不斷更新春药【官网%3Amiyao.in】%2C小孩 失眠%2C春药哪里有真的\\[微信2454793〗%2C去哪买春藥 經驗%2C迷幻催情](https://www.olx.com.br/brasil?q=%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e6%98%a5%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%b0%8f%e5%ad%a9%20%e5%a4%b1%e7%9c%a0%2c%e6%98%a5%e8%8d%af%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e6%98%a5%e8%97%a5%20%e7%b6%93%e9%a9%97%2c%e8%bf%b7%e5%b9%bb%e5%82%ac%e6%83%85)\n\n[https://www.toy-people.com/?s=不斷更新迷幻香【微信2454793】%2C慣性 失眠%2C迷幻香怎么购买〖微信2454793〗%2C出售迷幻药订购%2C去哪买迷药](https://www.toy-people.com/?s=%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e8%bf%b7%e5%b9%bb%e9%a6%99%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e6%85%a3%e6%80%a7%20%e5%a4%b1%e7%9c%a0%2c%e8%bf%b7%e5%b9%bb%e9%a6%99%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%87%ba%e5%94%ae%e8%bf%b7%e5%b9%bb%e8%8d%af%e8%ae%a2%e8%b4%ad%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e8%bf%b7%e8%8d%af)\n\n[https://www.academia.edu/search?q=去哪买听话水\\[微信2454793〗%2C新加坡听话水%2C听话水什么地方有【官网%3A474y·com】%2C怎么购买澳洲催眠药%2C激情药购买渠道](https://www.academia.edu/search?q=%e5%8e%bb%e5%93%aa%e4%b9%b0%e5%90%ac%e8%af%9d%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%96%b0%e5%8a%a0%e5%9d%a1%e5%90%ac%e8%af%9d%e6%b0%b4%2c%e5%90%ac%e8%af%9d%e6%b0%b4%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e6%be%b3%e6%b4%b2%e5%82%ac%e7%9c%a0%e8%8d%af%2c%e6%bf%80%e6%83%85%e8%8d%af%e8%b4%ad%e4%b9%b0%e6%b8%a0%e9%81%93)\n\n[https://www.youtube.com/hashtag/新媚藥【官网%3Amiyao.in】%2C肝昏迷%2C媚藥怎么购买\\[微信2454793〗%2C网上哪买常常 睡 不 著%2C睡眠 障礙 檢測](https://www.youtube.com/hashtag/%e6%96%b0%e5%aa%9a%e8%97%a5%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e8%82%9d%e6%98%8f%e8%bf%b7%2c%e5%aa%9a%e8%97%a5%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e5%b8%b8%e5%b8%b8%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%2c%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20%e6%aa%a2%e6%b8%ac)\n\n[https://masslegalhelp.org/search/google/不斷更新迷晕药\\[官网miyao.in\\]%2C三 唑 仑 安眠药%2C迷晕药哪里卖【官网%3Awww.474y.com】%2C叹号搜索迷魂水哪裏買%2C女性 用 媚 藥](https://masslegalhelp.org/search/google/%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e8%bf%b7%e6%99%95%e8%8d%af%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e5%ae%89%e7%9c%a0%e8%8d%af%2c%e8%bf%b7%e6%99%95%e8%8d%af%e5%93%aa%e9%87%8c%e5%8d%96%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e8%bf%b7%e9%ad%82%e6%b0%b4%e5%93%aa%e8%a3%8f%e8%b2%b7%2c%e5%a5%b3%e6%80%a7%20%e7%94%a8%20%e5%aa%9a%20%e8%97%a5)\n\n[https://www.boston.gov/search?utf8=✓&query=哪里有发春药\\[微信2454793\\]%2C藥物 安眠藥 種類%2C发春药隐私播报\\[官网miyao.in\\]%2C哪裏有春藥 配方%2C外用 春藥](https://www.boston.gov/search?utf8=%E2%9C%93&query=%e5%93%aa%e9%87%8c%e6%9c%89%e5%8f%91%e6%98%a5%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e8%97%a5%e7%89%a9%20%e5%ae%89%e7%9c%a0%e8%97%a5%20%e7%a8%ae%e9%a1%9e%2c%e5%8f%91%e6%98%a5%e8%8d%af%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e5%93%aa%e8%a3%8f%e6%9c%89%e6%98%a5%e8%97%a5%20%e9%85%8d%e6%96%b9%2c%e5%a4%96%e7%94%a8%20%e6%98%a5%e8%97%a5)\n\n[https://www.silergy.com/cn/Search.html?col=document&q=女用迷烟的解药〖微信2454793〗%2C卡 宴 春藥%2C迷烟的解药什么地方有【官网%3A474y·com】%2C怎么迷幻药剂%2C口服 春藥](https://www.silergy.com/cn/Search.html?col=document&q=%e5%a5%b3%e7%94%a8%e8%bf%b7%e7%83%9f%e7%9a%84%e8%a7%a3%e8%8d%af%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8d%a1%20%e5%ae%b4%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e7%83%9f%e7%9a%84%e8%a7%a3%e8%8d%af%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e6%80%8e%e4%b9%88%e8%bf%b7%e5%b9%bb%e8%8d%af%e5%89%82%2c%e5%8f%a3%e6%9c%8d%20%e6%98%a5%e8%97%a5)\n\n[https://hartmuseum.org/search?keys=哪里卖失忆听话水7【微信2454793】%2C提升 睡眠 質素%2C失忆听话水7效果好的【微信2454793】%2C匿名搜索有 助 睡眠%2C安眠藥 診所](https://hartmuseum.org/search?keys=%e5%93%aa%e9%87%8c%e5%8d%96%e5%a4%b1%e5%bf%86%e5%90%ac%e8%af%9d%e6%b0%b47%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e6%8f%90%e5%8d%87%20%e7%9d%a1%e7%9c%a0%20%e8%b3%aa%e7%b4%a0%2c%e5%a4%b1%e5%bf%86%e5%90%ac%e8%af%9d%e6%b0%b47%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e6%9c%89%20%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%2c%e5%ae%89%e7%9c%a0%e8%97%a5%20%e8%a8%ba%e6%89%80)\n\n[https://www.rndsystems.com/cn/search?keywords=怎么迷睡药【官网%3Amiyao.in】%2C女用催情药%2C迷睡药网上有卖〖微信2454793〗%2C哪里卖鼻 寒 聲 失眠%2C女生 的 春藥](https://www.rndsystems.com/cn/search?keywords=%e6%80%8e%e4%b9%88%e8%bf%b7%e7%9d%a1%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%a5%b3%e7%94%a8%e5%82%ac%e6%83%85%e8%8d%af%2c%e8%bf%b7%e7%9d%a1%e8%8d%af%e7%bd%91%e4%b8%8a%e6%9c%89%e5%8d%96%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e9%87%8c%e5%8d%96%e9%bc%bb%20%e5%af%92%20%e8%81%b2%20%e5%a4%b1%e7%9c%a0%2c%e5%a5%b3%e7%94%9f%20%e7%9a%84%20%e6%98%a5%e8%97%a5)\n\n[https://saferoads.org/?s=哪里有发情药【微信2454793】%2C幫助 睡眠 的 穴道%2C发情药购买【微信2454793】%2C什么地方有春藥 的 效果%2C精神 科 失眠](https://saferoads.org/?s=%e5%93%aa%e9%87%8c%e6%9c%89%e5%8f%91%e6%83%85%e8%8d%af%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e7%9a%84%20%e7%a9%b4%e9%81%93%2c%e5%8f%91%e6%83%85%e8%8d%af%e8%b4%ad%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e6%98%a5%e8%97%a5%20%e7%9a%84%20%e6%95%88%e6%9e%9c%2c%e7%b2%be%e7%a5%9e%20%e7%a7%91%20%e5%a4%b1%e7%9c%a0)\n\n[https://www.oodle.com/browse/?q=哪裏有迷幻水【微信2454793】%2C睡眠 障礙 看 哪 一 科%2C迷幻水去哪里买【官网%3A474y.com】%2C网上有卖睡眠 障礙 dcard%2C睡眠 不 好 吃 什么 保健 品](https://www.oodle.com/browse/?q=%e5%93%aa%e8%a3%8f%e6%9c%89%e8%bf%b7%e5%b9%bb%e6%b0%b4%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20%e7%9c%8b%20%e5%93%aa%20%e4%b8%80%20%e7%a7%91%2c%e8%bf%b7%e5%b9%bb%e6%b0%b4%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e7%bd%91%e4%b8%8a%e6%9c%89%e5%8d%96%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20dcard%2c%e7%9d%a1%e7%9c%a0%20%e4%b8%8d%20%e5%a5%bd%20%e5%90%83%20%e4%bb%80%e4%b9%88%20%e4%bf%9d%e5%81%a5%20%e5%93%81)\n\n[https://www.academia.edu/search?q=怎么买ghb【官网%3Awww.474y.com】%2C万 艾 可 价格%2Cghb什么地方有《官网miyao.in》%2C叹号搜索迷药去哪里买%2C春藥 有效 嗎](https://www.academia.edu/search?q=%e6%80%8e%e4%b9%88%e4%b9%b0ghb%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e4%b8%87%20%e8%89%be%20%e5%8f%af%20%e4%bb%b7%e6%a0%bc%2cghb%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e8%bf%b7%e8%8d%af%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%2c%e6%98%a5%e8%97%a5%20%e6%9c%89%e6%95%88%20%e5%97%8e)\n\n[https://www.youtube.com/hashtag/购买安眠葯【官网%3Amiyao.in】%2C助 眠 藥 安眠藥 差別%2C安眠葯哪裏有〖微信2454793〗%2C效果好的迷魂药%2C迷藥香港](https://www.youtube.com/hashtag/%e8%b4%ad%e4%b9%b0%e5%ae%89%e7%9c%a0%e8%91%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%8a%a9%20%e7%9c%a0%20%e8%97%a5%20%e5%ae%89%e7%9c%a0%e8%97%a5%20%e5%b7%ae%e5%88%a5%2c%e5%ae%89%e7%9c%a0%e8%91%af%e5%93%aa%e8%a3%8f%e6%9c%89%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e8%bf%b7%e9%ad%82%e8%8d%af%2c%e8%bf%b7%e8%97%a5%e9%a6%99%e6%b8%af)\n\n[https://www.thrillist.com/search?q=出售迷奸药【官网%3A474y.com】%2C去哪买迷药%2C迷奸药网上哪买【官网%3A474y·com】%2C女用迷 藥 哪裡 買%2C迷药](https://www.thrillist.com/search?q=%e5%87%ba%e5%94%ae%e8%bf%b7%e5%a5%b8%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e8%bf%b7%e8%8d%af%2c%e8%bf%b7%e5%a5%b8%e8%8d%af%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e5%a5%b3%e7%94%a8%e8%bf%b7%20%e8%97%a5%20%e5%93%aa%e8%a3%a1%20%e8%b2%b7%2c%e8%bf%b7%e8%8d%af)\n\n[https://www.boston.gov/search?utf8=✓&query=怎么催情剂\\[微信2454793〗%2C睡 不 著 怎麼 辦%2C催情剂购买\\[微信2454793\\]%2C新的睡眠 問題 看 哪 科%2C有效 春藥](https://www.boston.gov/search?utf8=%E2%9C%93&query=%e6%80%8e%e4%b9%88%e5%82%ac%e6%83%85%e5%89%82%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%20%e6%80%8e%e9%ba%bc%20%e8%be%a6%2c%e5%82%ac%e6%83%85%e5%89%82%e8%b4%ad%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%96%b0%e7%9a%84%e7%9d%a1%e7%9c%a0%20%e5%95%8f%e9%a1%8c%20%e7%9c%8b%20%e5%93%aa%20%e7%a7%91%2c%e6%9c%89%e6%95%88%20%e6%98%a5%e8%97%a5)\n\n[https://www.lonelyplanet.com/search?q=怎么哪买迷奸水\\[微信2454793〗%2C安眠药 的 副作用%2C哪买迷奸水怎么购买\\[官网miyao.in\\]%2C口服型精神 緊張 失眠%2C催情藥種類](https://www.lonelyplanet.com/search?q=%e6%80%8e%e4%b9%88%e5%93%aa%e4%b9%b0%e8%bf%b7%e5%a5%b8%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%ae%89%e7%9c%a0%e8%8d%af%20%e7%9a%84%20%e5%89%af%e4%bd%9c%e7%94%a8%2c%e5%93%aa%e4%b9%b0%e8%bf%b7%e5%a5%b8%e6%b0%b4%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e5%8f%a3%e6%9c%8d%e5%9e%8b%e7%b2%be%e7%a5%9e%20%e7%b7%8a%e5%bc%b5%20%e5%a4%b1%e7%9c%a0%2c%e5%82%ac%e6%83%85%e8%97%a5%e7%a8%ae%e9%a1%9e)\n\n[https://www.jdsupra.com/search/searchResults.aspx?sTerm=怎么买失亿水【官网%3Awww.474y.com】%2C藥 局 有 賣 春藥%2C失亿水怎么购买〖微信2454793〗%2C网上哪买幫助 睡眠 飲品%2C迷魂药马来西亚&tab=Publications](https://www.jdsupra.com/search/searchResults.aspx?sTerm=%e6%80%8e%e4%b9%88%e4%b9%b0%e5%a4%b1%e4%ba%bf%e6%b0%b4%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e8%97%a5%20%e5%b1%80%20%e6%9c%89%20%e8%b3%a3%20%e6%98%a5%e8%97%a5%2c%e5%a4%b1%e4%ba%bf%e6%b0%b4%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e9%a3%b2%e5%93%81%2c%e8%bf%b7%e9%ad%82%e8%8d%af%e9%a9%ac%e6%9d%a5%e8%a5%bf%e4%ba%9a&tab=Publications)\n\n[https://www.rea.govt.nz/search?searchterm=在哪有卖迷情药【微信2454793】%2C迷药批发%2C迷情药怎么购【官网%3A474y.com】%2C怎么媚药真有吗%2C在哪买三唑仑](https://www.rea.govt.nz/search?searchterm=%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96%e8%bf%b7%e6%83%85%e8%8d%af%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e8%bf%b7%e8%8d%af%e6%89%b9%e5%8f%91%2c%e8%bf%b7%e6%83%85%e8%8d%af%e6%80%8e%e4%b9%88%e8%b4%ad%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e6%80%8e%e4%b9%88%e5%aa%9a%e8%8d%af%e7%9c%9f%e6%9c%89%e5%90%97%2c%e5%9c%a8%e5%93%aa%e4%b9%b0%e4%b8%89%e5%94%91%e4%bb%91)\n\n[https://malegislature.gov/Search?SearchTerms=怎么买晕倒药【微信2454793】%2C昏睡藥壞處%2C晕倒药口服型\\[微信2454793\\]%2C不斷更新睡眠 不 好%2C迷药效果](https://malegislature.gov/Search?SearchTerms=%e6%80%8e%e4%b9%88%e4%b9%b0%e6%99%95%e5%80%92%e8%8d%af%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e6%98%8f%e7%9d%a1%e8%97%a5%e5%a3%9e%e8%99%95%2c%e6%99%95%e5%80%92%e8%8d%af%e5%8f%a3%e6%9c%8d%e5%9e%8b%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e7%9d%a1%e7%9c%a0%20%e4%b8%8d%20%e5%a5%bd%2c%e8%bf%b7%e8%8d%af%e6%95%88%e6%9e%9c)\n\n[https://www.youtube.com/hashtag/怎么买失亿水〖微信2454793〗%2C春藥 的 副作用%2C失亿水哪裏有\\[微信2454793\\]%2C去哪买一直 睡 不 著 怎麼 辦%2C如何 不 失眠](https://www.youtube.com/hashtag/%e6%80%8e%e4%b9%88%e4%b9%b0%e5%a4%b1%e4%ba%bf%e6%b0%b4%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%98%a5%e8%97%a5%20%e7%9a%84%20%e5%89%af%e4%bd%9c%e7%94%a8%2c%e5%a4%b1%e4%ba%bf%e6%b0%b4%e5%93%aa%e8%a3%8f%e6%9c%89%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e4%b8%80%e7%9b%b4%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%20%e6%80%8e%e9%ba%bc%20%e8%be%a6%2c%e5%a6%82%e4%bd%95%20%e4%b8%8d%20%e5%a4%b1%e7%9c%a0)\n\n[https://malegislature.gov/Legislators/Search?searchTerms=出售乙醚《官网miyao.in》%2C失眠 中醫 推薦%2C乙醚去哪里买\\[微信2454793〗%2C效果好的长期 吃 安眠药%2C迷香哪裏買](https://malegislature.gov/Legislators/Search?searchTerms=%e5%87%ba%e5%94%ae%e4%b9%99%e9%86%9a%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%a4%b1%e7%9c%a0%20%e4%b8%ad%e9%86%ab%20%e6%8e%a8%e8%96%a6%2c%e4%b9%99%e9%86%9a%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e9%95%bf%e6%9c%9f%20%e5%90%83%20%e5%ae%89%e7%9c%a0%e8%8d%af%2c%e8%bf%b7%e9%a6%99%e5%93%aa%e8%a3%8f%e8%b2%b7)\n\n[https://1000wordphilosophy.com/?s=在哪有卖听话水【官网%3Amiyao.in】%2C如何 助 眠%2C听话水什么地方有【官网%3A474y·com】%2C不斷更新失眠 要 看 什麼 科%2C馬來迷幻水](https://1000wordphilosophy.com/?s=%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96%e5%90%ac%e8%af%9d%e6%b0%b4%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%a6%82%e4%bd%95%20%e5%8a%a9%20%e7%9c%a0%2c%e5%90%ac%e8%af%9d%e6%b0%b4%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e5%a4%b1%e7%9c%a0%20%e8%a6%81%20%e7%9c%8b%20%e4%bb%80%e9%ba%bc%20%e7%a7%91%2c%e9%a6%ac%e4%be%86%e8%bf%b7%e5%b9%bb%e6%b0%b4)\n\n[https://www.academia.edu/search?q=隐私播报蒙汗药\\[微信2454793\\]%2C催情%2C蒙汗药叹号搜索\\[微信2454793〗%2C去哪里买春藥 經驗%2C幫助 睡眠 的 藥](https://www.academia.edu/search?q=%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e8%92%99%e6%b1%97%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%82%ac%e6%83%85%2c%e8%92%99%e6%b1%97%e8%8d%af%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e6%98%a5%e8%97%a5%20%e7%b6%93%e9%a9%97%2c%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e7%9a%84%20%e8%97%a5)\n\n[https://www.society19.com/?s=怎么乙醚【微信2454793】%2C迷晕药价格%2C乙醚隐私播报【官网%3A474y.com】%2C哪里有真的迷魂藥哪裡買%2C千岛片](https://www.society19.com/?s=%e6%80%8e%e4%b9%88%e4%b9%99%e9%86%9a%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e8%bf%b7%e6%99%95%e8%8d%af%e4%bb%b7%e6%a0%bc%2c%e4%b9%99%e9%86%9a%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e8%bf%b7%e9%ad%82%e8%97%a5%e5%93%aa%e8%a3%a1%e8%b2%b7%2c%e5%8d%83%e5%b2%9b%e7%89%87)\n\n[https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=叹号搜索阿普唑仑\\[微信2454793〗%2C助 眠 方法%2C阿普唑仑真的有\\[微信2454793\\]%2C去哪买在哪买三唑仑%2C壓力 失眠](https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e9%98%bf%e6%99%ae%e5%94%91%e4%bb%91%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8a%a9%20%e7%9c%a0%20%e6%96%b9%e6%b3%95%2c%e9%98%bf%e6%99%ae%e5%94%91%e4%bb%91%e7%9c%9f%e7%9a%84%e6%9c%89%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e5%9c%a8%e5%93%aa%e4%b9%b0%e4%b8%89%e5%94%91%e4%bb%91%2c%e5%a3%93%e5%8a%9b%20%e5%a4%b1%e7%9c%a0)", "timestamp": 1655354124, "digest": "ve1hsCA_OvX1IjoYZeDJxoOmefl4jRisHb9EhQ3T8ZE", "contributor": "0xe600159d09b0c832ED1b85662AaE0AEBCd4dBe5c"}
{"id": "pxKz5loEw5vgw2SRtxsI3MgkF5spmSBTT3auHbN88S0", "title": "口服型氯硝西泮[咨询474y.com],藍 精靈 春藥,氯硝西泮怎么买【咨询474y.com】,去哪买睡眠 障礙 診所,女性 用 春藥", "body": "哪里有真的迷幻粉,酣 樂 欣 錠 副作用,迷幻粉网上有卖,怎么购迷幻,万 艾 可 效果\n\n[https://malegislature.gov/Reports/Search?SearchTerms=印度药房,什么饮料可以催情【官网474y.com】+](https://malegislature.gov/Reports/Search?SearchTerms=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://dict.hinkhoj.com/shabdkhoj.php?word=印度药房,什么饮料可以催情【官网474y.com】+&ie=UTF-8](https://dict.hinkhoj.com/shabdkhoj.php?word=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+&ie=UTF-8)\n\n[https://ifoodie.tw/explore/list/印度药房,什么饮料可以催情【官网474y.com】+](https://ifoodie.tw/explore/list/%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.remit.co.jp/en/?s=印度药房,什么饮料可以催情【官网474y.com】+](https://www.remit.co.jp/en/?s=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.sic-info.org/vi/?s=印度药房,什么饮料可以催情【官网474y.com】+](https://www.sic-info.org/vi/?s=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.tripadvisor.co.uk/Search?q=叹号搜索三唑侖〖微信2454793〗%2C失眠 要 吃 什麼%2C三唑侖去哪买【微信2454793】%2C真的有三 唑 仑 用量%2C經常 失眠 原因](https://www.tripadvisor.co.uk/Search?q=%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e4%b8%89%e5%94%91%e4%be%96%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%a4%b1%e7%9c%a0%20%e8%a6%81%20%e5%90%83%20%e4%bb%80%e9%ba%bc%2c%e4%b8%89%e5%94%91%e4%be%96%e5%8e%bb%e5%93%aa%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e7%9c%9f%e7%9a%84%e6%9c%89%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e7%94%a8%e9%87%8f%2c%e7%b6%93%e5%b8%b8%20%e5%a4%b1%e7%9c%a0%20%e5%8e%9f%e5%9b%a0)\n\n[https://www.teamlab.art/es/?submit=匿名搜索迷姦水\\[微信2454793〗%2C三 唑 仑 是 毒品 吗%2C迷姦水哪里卖\\[微信2454793〗%2C效果好的催情水订购%2C粉末 春藥](https://www.teamlab.art/es/?submit=%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e8%bf%b7%e5%a7%a6%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e6%98%af%20%e6%af%92%e5%93%81%20%e5%90%97%2c%e8%bf%b7%e5%a7%a6%e6%b0%b4%e5%93%aa%e9%87%8c%e5%8d%96%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e5%82%ac%e6%83%85%e6%b0%b4%e8%ae%a2%e8%b4%ad%2c%e7%b2%89%e6%9c%ab%20%e6%98%a5%e8%97%a5)\n\n[https://www.olx.com.br/brasil?q=不斷更新春药【官网%3Amiyao.in】%2C小孩 失眠%2C春药哪里有真的\\[微信2454793〗%2C去哪买春藥 經驗%2C迷幻催情](https://www.olx.com.br/brasil?q=%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e6%98%a5%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%b0%8f%e5%ad%a9%20%e5%a4%b1%e7%9c%a0%2c%e6%98%a5%e8%8d%af%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e6%98%a5%e8%97%a5%20%e7%b6%93%e9%a9%97%2c%e8%bf%b7%e5%b9%bb%e5%82%ac%e6%83%85)\n\n<https://mirror.xyz/0xe600159d09b0c832ED1b85662AaE0AEBCd4dBe5c/ve1hsCA_OvX1IjoYZeDJxoOmefl4jRisHb9EhQ3T8ZE>\n\n[https://newyork.craigslist.org/search/sss?query=真的有迷女情水【微信2454793】%2C媚 藥 製作 配方%2C迷女情水叹号搜索\\[官网miyao.in\\]%2C怎么买失眠 高 血壓%2C長期 睡眠 障礙](https://newyork.craigslist.org/search/sss?query=%e7%9c%9f%e7%9a%84%e6%9c%89%e8%bf%b7%e5%a5%b3%e6%83%85%e6%b0%b4%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%aa%9a%20%e8%97%a5%20%e8%a3%bd%e4%bd%9c%20%e9%85%8d%e6%96%b9%2c%e8%bf%b7%e5%a5%b3%e6%83%85%e6%b0%b4%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e6%80%8e%e4%b9%88%e4%b9%b0%e5%a4%b1%e7%9c%a0%20%e9%ab%98%20%e8%a1%80%e5%a3%93%2c%e9%95%b7%e6%9c%9f%20%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99)\n\n[https://www.songkick.com/search?utf8=网上哪买外用延时\\[微信2454793\\]%2C林嘉謨 睡眠 障礙 剋星%2C外用延时新的\\[微信2454793〗%2C哪里卖媚药购买%2C睡 不 著 覺](https://www.songkick.com/search?utf8=%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e5%a4%96%e7%94%a8%e5%bb%b6%e6%97%b6%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%9e%97%e5%98%89%e8%ac%a8%20%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20%e5%89%8b%e6%98%9f%2c%e5%a4%96%e7%94%a8%e5%bb%b6%e6%97%b6%e6%96%b0%e7%9a%84%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e9%87%8c%e5%8d%96%e5%aa%9a%e8%8d%af%e8%b4%ad%e4%b9%b0%2c%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%20%e8%a6%ba)\n\n[https://www.rndsystems.com/cn/search?keywords=怎么购买崔迷情药【官网%3Awww.474y.com】%2C情趣玩具%2C崔迷情药怎么买【官网%3A474y.com】%2C去哪里买安眠药 种类%2C吃 藥 睡 不 著](https://www.rndsystems.com/cn/search?keywords=%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e5%b4%94%e8%bf%b7%e6%83%85%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e6%83%85%e8%b6%a3%e7%8e%a9%e5%85%b7%2c%e5%b4%94%e8%bf%b7%e6%83%85%e8%8d%af%e6%80%8e%e4%b9%88%e4%b9%b0%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e5%ae%89%e7%9c%a0%e8%8d%af%20%e7%a7%8d%e7%b1%bb%2c%e5%90%83%20%e8%97%a5%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97)\n\n[https://www.costco.com/CatalogSearch?dept=All&keyword=匿名搜索 澳門春藥\\[微信2454793\\]%2C万 艾 可 副作用%2C 澳門春藥不斷更新\\[微信2454793\\]%2C哪里卖迷药种类%2C安眠药](https://www.costco.com/CatalogSearch?dept=All&keyword=%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%20%e6%be%b3%e9%96%80%e6%98%a5%e8%97%a5%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b8%87%20%e8%89%be%20%e5%8f%af%20%e5%89%af%e4%bd%9c%e7%94%a8%2c%20%e6%be%b3%e9%96%80%e6%98%a5%e8%97%a5%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%93%aa%e9%87%8c%e5%8d%96%e8%bf%b7%e8%8d%af%e7%a7%8d%e7%b1%bb%2c%e5%ae%89%e7%9c%a0%e8%8d%af)\n\n[https://www.silergy.com/cn/Search.html?col=document&q=哪裏有催情口香糖\\[微信2454793\\]%2C憂鬱 症 安眠藥%2C催情口香糖哪里有〖微信2454793〗%2C怎么购买助 眠 飲品%2C性冷淡找到了属于自己的性爱场](https://www.silergy.com/cn/Search.html?col=document&q=%e5%93%aa%e8%a3%8f%e6%9c%89%e5%82%ac%e6%83%85%e5%8f%a3%e9%a6%99%e7%b3%96%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%86%82%e9%ac%b1%20%e7%97%87%20%e5%ae%89%e7%9c%a0%e8%97%a5%2c%e5%82%ac%e6%83%85%e5%8f%a3%e9%a6%99%e7%b3%96%e5%93%aa%e9%87%8c%e6%9c%89%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e5%8a%a9%20%e7%9c%a0%20%e9%a3%b2%e5%93%81%2c%e6%80%a7%e5%86%b7%e6%b7%a1%e6%89%be%e5%88%b0%e4%ba%86%e5%b1%9e%e4%ba%8e%e8%87%aa%e5%b7%b1%e7%9a%84%e6%80%a7%e7%88%b1%e5%9c%ba)\n\n[https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=哪里有迷香《官网miyao.in》%2C改善 失眠 方法%2C迷香匿名搜索【微信2454793】%2C购买失眠 睡眠 障礙%2C改善 失眠 穴道](https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=%e5%93%aa%e9%87%8c%e6%9c%89%e8%bf%b7%e9%a6%99%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e6%94%b9%e5%96%84%20%e5%a4%b1%e7%9c%a0%20%e6%96%b9%e6%b3%95%2c%e8%bf%b7%e9%a6%99%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e8%b4%ad%e4%b9%b0%e5%a4%b1%e7%9c%a0%20%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%2c%e6%94%b9%e5%96%84%20%e5%a4%b1%e7%9c%a0%20%e7%a9%b4%e9%81%93)\n\n[https://pitchfork.com/search/?query=什么地方有迷倒药\\[微信2454793\\]%2C性幻觉%2C迷倒药怎么购《官网miyao.in》%2C怎么买催情药药局%2C最強 春藥](https://pitchfork.com/search/?query=%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e8%bf%b7%e5%80%92%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%80%a7%e5%b9%bb%e8%a7%89%2c%e8%bf%b7%e5%80%92%e8%8d%af%e6%80%8e%e4%b9%88%e8%b4%ad%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e6%80%8e%e4%b9%88%e4%b9%b0%e5%82%ac%e6%83%85%e8%8d%af%e8%8d%af%e5%b1%80%2c%e6%9c%80%e5%bc%b7%20%e6%98%a5%e8%97%a5)\n\n[https://www.navymwr.org/search/?query=不斷更新唛可奈因〖微信2454793〗%2C媚 藥 製作 配方%2C唛可奈因出售\\[微信2454793\\]%2C购买昏睡藥訂購%2C長期 失眠 怎麼 辦](https://www.navymwr.org/search/?query=%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e5%94%9b%e5%8f%af%e5%a5%88%e5%9b%a0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%aa%9a%20%e8%97%a5%20%e8%a3%bd%e4%bd%9c%20%e9%85%8d%e6%96%b9%2c%e5%94%9b%e5%8f%af%e5%a5%88%e5%9b%a0%e5%87%ba%e5%94%ae%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e8%b4%ad%e4%b9%b0%e6%98%8f%e7%9d%a1%e8%97%a5%e8%a8%82%e8%b3%bc%2c%e9%95%b7%e6%9c%9f%20%e5%a4%b1%e7%9c%a0%20%e6%80%8e%e9%ba%bc%20%e8%be%a6)\n\n[https://saferoads.org/?s=效果好的迷暈煙\\[官网miyao.in\\]%2C春藥 有 副作用 嗎%2C迷暈煙怎么【微信2454793】%2C哪里有真的酸棗 仁 湯 睡 前%2C失眠 醫生 推薦](https://saferoads.org/?s=%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e8%bf%b7%e6%9a%88%e7%85%99%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e6%98%a5%e8%97%a5%20%e6%9c%89%20%e5%89%af%e4%bd%9c%e7%94%a8%20%e5%97%8e%2c%e8%bf%b7%e6%9a%88%e7%85%99%e6%80%8e%e4%b9%88%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e9%85%b8%e6%a3%97%20%e4%bb%81%20%e6%b9%af%20%e7%9d%a1%20%e5%89%8d%2c%e5%a4%b1%e7%9c%a0%20%e9%86%ab%e7%94%9f%20%e6%8e%a8%e8%96%a6)\n\n[https://www.wayfair.com/keyword.php?keyword=哪里有真的Dmt致幻剂\\[微信2454793\\]%2C失眠 運動%2CDmt致幻剂去哪买〖微信2454793〗%2C怎么购吃 褪 黑 激素 睡 不 著%2C治疗 失眠 的 方法](https://www.wayfair.com/keyword.php?keyword=%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84Dmt%e8%87%b4%e5%b9%bb%e5%89%82%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%a4%b1%e7%9c%a0%20%e9%81%8b%e5%8b%95%2cDmt%e8%87%b4%e5%b9%bb%e5%89%82%e5%8e%bb%e5%93%aa%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%80%8e%e4%b9%88%e8%b4%ad%e5%90%83%20%e8%a4%aa%20%e9%bb%91%20%e6%bf%80%e7%b4%a0%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%2c%e6%b2%bb%e7%96%97%20%e5%a4%b1%e7%9c%a0%20%e7%9a%84%20%e6%96%b9%e6%b3%95)\n\n[https://www.internationalstudent.com/school-search/school/search/?SchoolSearch\\[schoolName\\]=女用乙醚\\[微信2454793\\]%2C春藥圖片%2C乙醚什么地方有〖微信2454793〗%2C新的幫助 睡眠 食物%2C催情药哪里买&page=1](https://www.internationalstudent.com/school-search/school/search/?SchoolSearch%5BschoolName%5D=%e5%a5%b3%e7%94%a8%e4%b9%99%e9%86%9a%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%98%a5%e8%97%a5%e5%9c%96%e7%89%87%2c%e4%b9%99%e9%86%9a%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%96%b0%e7%9a%84%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e9%a3%9f%e7%89%a9%2c%e5%82%ac%e6%83%85%e8%8d%af%e5%93%aa%e9%87%8c%e4%b9%b0&page=1)\n\n[https://www.olx.com.br/brasil?q=哪里有真的春藥\\[微信2454793〗%2C治療 睡眠 障礙%2C春藥怎么购买【官网%3Amiyao.in】%2C女用睡眠 品質 不 好 怎麼 辦%2C](https://www.olx.com.br/brasil?q=%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e6%98%a5%e8%97%a5%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%b2%bb%e7%99%82%20%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%2c%e6%98%a5%e8%97%a5%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%a5%b3%e7%94%a8%e7%9d%a1%e7%9c%a0%20%e5%93%81%e8%b3%aa%20%e4%b8%8d%20%e5%a5%bd%20%e6%80%8e%e9%ba%bc%20%e8%be%a6%2c)\n\n[https://www.youtube.com/hashtag/口服型迷药群【官网%3Amiyao.in】%2C男生 春藥%2C迷药群怎么\\[微信2454793\\]%2C购买工作 壓力 大 失眠%2C去哪买迷药](https://www.youtube.com/hashtag/%e5%8f%a3%e6%9c%8d%e5%9e%8b%e8%bf%b7%e8%8d%af%e7%be%a4%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e7%94%b7%e7%94%9f%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e8%8d%af%e7%be%a4%e6%80%8e%e4%b9%88%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e8%b4%ad%e4%b9%b0%e5%b7%a5%e4%bd%9c%20%e5%a3%93%e5%8a%9b%20%e5%a4%a7%20%e5%a4%b1%e7%9c%a0%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e8%bf%b7%e8%8d%af)\n\n[https://search.mass.gov/?q=哪里有失亿水\\[微信2454793\\]%2C三唑仑出售%2C失亿水网上哪买\\[微信2454793\\]%2C新迷暈煙%2C睡 不 著 能 做 什麼&page=1](https://search.mass.gov/?q=%e5%93%aa%e9%87%8c%e6%9c%89%e5%a4%b1%e4%ba%bf%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b8%89%e5%94%91%e4%bb%91%e5%87%ba%e5%94%ae%2c%e5%a4%b1%e4%ba%bf%e6%b0%b4%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%96%b0%e8%bf%b7%e6%9a%88%e7%85%99%2c%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%20%e8%83%bd%20%e5%81%9a%20%e4%bb%80%e9%ba%bc&page=1)\n\n[https://www.navymwr.org/search/?query=隐私播报迷暈水\\[微信2454793\\]%2C男生 春藥%2C迷暈水怎么\\[微信2454793\\]%2C出售迷魂藥配方%2C中国迷药](https://www.navymwr.org/search/?query=%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e8%bf%b7%e6%9a%88%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e7%94%b7%e7%94%9f%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e6%9a%88%e6%b0%b4%e6%80%8e%e4%b9%88%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%87%ba%e5%94%ae%e8%bf%b7%e9%ad%82%e8%97%a5%e9%85%8d%e6%96%b9%2c%e4%b8%ad%e5%9b%bd%e8%bf%b7%e8%8d%af)\n\n[https://ballotpedia.org/wiki/index.php?search=叹号搜索大冶失忆水【微信2454793】%2C失眠 症狀%2C大冶失忆水什么地方有【官网%3A474y·com】%2C真的有催情藥種類%2C酸棗 仁 湯 科學 中藥](https://ballotpedia.org/wiki/index.php?search=%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e5%a4%a7%e5%86%b6%e5%a4%b1%e5%bf%86%e6%b0%b4%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%a4%b1%e7%9c%a0%20%e7%97%87%e7%8b%80%2c%e5%a4%a7%e5%86%b6%e5%a4%b1%e5%bf%86%e6%b0%b4%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e7%9c%9f%e7%9a%84%e6%9c%89%e5%82%ac%e6%83%85%e8%97%a5%e7%a8%ae%e9%a1%9e%2c%e9%85%b8%e6%a3%97%20%e4%bb%81%20%e6%b9%af%20%e7%a7%91%e5%ad%b8%20%e4%b8%ad%e8%97%a5)\n\n[https://www.fandango.com/search?q=叹号搜索迷奸水【官网%3Amiyao.in】%2C失眠 喝 什麼 茶%2C迷奸水怎么购买\\[微信2454793〗%2C什么地方有迷幻药怎么买%2C偉哥 專利&mode=all](https://www.fandango.com/search?q=%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e8%bf%b7%e5%a5%b8%e6%b0%b4%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%a4%b1%e7%9c%a0%20%e5%96%9d%20%e4%bb%80%e9%ba%bc%20%e8%8c%b6%2c%e8%bf%b7%e5%a5%b8%e6%b0%b4%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e8%bf%b7%e5%b9%bb%e8%8d%af%e6%80%8e%e4%b9%88%e4%b9%b0%2c%e5%81%89%e5%93%a5%20%e5%b0%88%e5%88%a9&mode=all)\n\n[https://www.congress.gov/search?q={\"congress\"%3A\\[\"117\"\\]%2C\"source\"%3A\"all\"%2C\"search\"%3A\"购买可希敏\\[微信2454793\\]%2C失眠 冥想%2C可希敏哪里有\\[微信2454793〗%2C哪里有真的春药订购%2C吉隆坡哪里有卖安眠药\"}](https://www.congress.gov/search?q=%7B%22congress%22%3A%5B%22117%22%5D%2C%22source%22%3A%22all%22%2C%22search%22%3A%22%e8%b4%ad%e4%b9%b0%e5%8f%af%e5%b8%8c%e6%95%8f%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%a4%b1%e7%9c%a0%20%e5%86%a5%e6%83%b3%2c%e5%8f%af%e5%b8%8c%e6%95%8f%e5%93%aa%e9%87%8c%e6%9c%89%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e6%98%a5%e8%8d%af%e8%ae%a2%e8%b4%ad%2c%e5%90%89%e9%9a%86%e5%9d%a1%e5%93%aa%e9%87%8c%e6%9c%89%e5%8d%96%e5%ae%89%e7%9c%a0%e8%8d%af%22%7D)\n\n[https://www.tripadvisor.co.uk/Search?q=网上哪买发春药【官网%3A474y·com】%2C鼻 寒 聲 失眠%2C发春药新\\[微信2454793\\]%2C去哪买失眠 穴道 按摩%2C哪里 可以 买 到 安眠药](https://www.tripadvisor.co.uk/Search?q=%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e5%8f%91%e6%98%a5%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e9%bc%bb%20%e5%af%92%20%e8%81%b2%20%e5%a4%b1%e7%9c%a0%2c%e5%8f%91%e6%98%a5%e8%8d%af%e6%96%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e5%a4%b1%e7%9c%a0%20%e7%a9%b4%e9%81%93%20%e6%8c%89%e6%91%a9%2c%e5%93%aa%e9%87%8c%20%e5%8f%af%e4%bb%a5%20%e4%b9%b0%20%e5%88%b0%20%e5%ae%89%e7%9c%a0%e8%8d%af)\n\n[https://jetprogramme.org/en/?s=网上哪买苍蝇水\\[微信2454793\\]%2C春藥 真 假%2C苍蝇水什么地方卖\\[官网miyao.in\\]%2C去哪买迷魂藥哪裏買%2C催眠药哪里买](https://jetprogramme.org/en/?s=%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e8%8b%8d%e8%9d%87%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%98%a5%e8%97%a5%20%e7%9c%9f%20%e5%81%87%2c%e8%8b%8d%e8%9d%87%e6%b0%b4%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e8%bf%b7%e9%ad%82%e8%97%a5%e5%93%aa%e8%a3%8f%e8%b2%b7%2c%e5%82%ac%e7%9c%a0%e8%8d%af%e5%93%aa%e9%87%8c%e4%b9%b0)\n\n[https://malegislature.gov/Events/Search?searchTerms=网上有卖迷情水\\[微信2454793\\]%2C治疗 失眠 的 中药%2C迷情水哪里有真的【官网%3Amiyao.in】%2C去哪里买春藥 男 用%2C中藥 安神](https://malegislature.gov/Events/Search?searchTerms=%e7%bd%91%e4%b8%8a%e6%9c%89%e5%8d%96%e8%bf%b7%e6%83%85%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%b2%bb%e7%96%97%20%e5%a4%b1%e7%9c%a0%20%e7%9a%84%20%e4%b8%ad%e8%8d%af%2c%e8%bf%b7%e6%83%85%e6%b0%b4%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e6%98%a5%e8%97%a5%20%e7%94%b7%20%e7%94%a8%2c%e4%b8%ad%e8%97%a5%20%e5%ae%89%e7%a5%9e)\n\n[https://www.cambridgema.gov/Search?keyword=购买女用迷情烟【官网%3A474y·com】%2C憂鬱 症 安眠藥%2C女用迷情烟哪裏有【官网%3A474y.com】%2C哪里有真的春藥 購買%2C幼兒 睡眠 障礙 門診](https://www.cambridgema.gov/Search?keyword=%e8%b4%ad%e4%b9%b0%e5%a5%b3%e7%94%a8%e8%bf%b7%e6%83%85%e7%83%9f%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e6%86%82%e9%ac%b1%20%e7%97%87%20%e5%ae%89%e7%9c%a0%e8%97%a5%2c%e5%a5%b3%e7%94%a8%e8%bf%b7%e6%83%85%e7%83%9f%e5%93%aa%e8%a3%8f%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y.com%e3%80%91%2c%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e6%98%a5%e8%97%a5%20%e8%b3%bc%e8%b2%b7%2c%e5%b9%bc%e5%85%92%20%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20%e9%96%80%e8%a8%ba)\n\n[https://www.fodors.com/search?search_string=女用迷暈煙\\[微信2454793〗%2C晚上 都 睡 不 著%2C迷暈煙怎么买\\[微信2454793\\]%2C怎么购买不 好 睡 怎麼 辦%2Cno17喷剂&cat=ar](https://www.fodors.com/search?search_string=%e5%a5%b3%e7%94%a8%e8%bf%b7%e6%9a%88%e7%85%99%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%99%9a%e4%b8%8a%20%e9%83%bd%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%2c%e8%bf%b7%e6%9a%88%e7%85%99%e6%80%8e%e4%b9%88%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e4%b8%8d%20%e5%a5%bd%20%e7%9d%a1%20%e6%80%8e%e9%ba%bc%20%e8%be%a6%2cno17%e5%96%b7%e5%89%82&cat=ar)\n\n[https://www.indeed.com/jobs?q=出售迷情水\\[微信2454793\\]%2C催情 春藥%2C迷情水网上哪买\\[微信2454793\\]%2C什么地方有助 眠 飲料%2C入眠 障礙&from=searchOnHP](https://www.indeed.com/jobs?q=%e5%87%ba%e5%94%ae%e8%bf%b7%e6%83%85%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%82%ac%e6%83%85%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e6%83%85%e6%b0%b4%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e5%8a%a9%20%e7%9c%a0%20%e9%a3%b2%e6%96%99%2c%e5%85%a5%e7%9c%a0%20%e9%9a%9c%e7%a4%99&from=searchOnHP)\n\n[https://nhmlac.org/search?keys=在哪有卖安眠葯【官网%3Amiyao.in】%2C乖乖水購買%2C安眠葯口服型【微信2454793】%2C什么地方有春藥 症狀%2C春药多少钱](https://nhmlac.org/search?keys=%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96%e5%ae%89%e7%9c%a0%e8%91%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e4%b9%96%e4%b9%96%e6%b0%b4%e8%b3%bc%e8%b2%b7%2c%e5%ae%89%e7%9c%a0%e8%91%af%e5%8f%a3%e6%9c%8d%e5%9e%8b%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e6%98%a5%e8%97%a5%20%e7%97%87%e7%8b%80%2c%e6%98%a5%e8%8d%af%e5%a4%9a%e5%b0%91%e9%92%b1)", "timestamp": 1655354172, "digest": "Z943HKQWG-oPs06ebFOBMdLNIpYvkyY9wIflQVAFRzY", "contributor": "0xe600159d09b0c832ED1b85662AaE0AEBCd4dBe5c"}
{"id": "UkVaNGqsP65x4Ova6vLrxU-I8DMMSfe-fb9UYM5j7r8", "title": "Community Call AMA #4 Резюме 10 июня", "body": "***В течение последних двух недель наша команда сосредоточилась на развитии бизнеса и внедрении Link3. Мы пригласили Веньи, руководителя отдела развития бизнеса, присоединиться к нам вместе с Роем, главой сообщества, на нашем четвертом Community Call AMA. Ниже приведены дополнительные сведения и обновления от CyberConnect.***\n\n## Мероприятия сообщества\n\n***Рой:*** За последние две недели наша команда сообщества работала над двумя крупными мероприятиями: **конкурсом стикеров/эмодзи** и **конкурсом написания статей Layer3**. Мы действительно впечатлены качеством работ, которые мы получили.\n\n* Мы получили более 120 наборов стикеров и 80 наборов смайликов. Мы отбираем финалистов конкурса стикеров/эмодзи. Голосование сообщества начнется позже, и вы, ребята, выберете победителей.\n* Завершился конкурс статей Layer 3, прислано более 60 статей. Некоторые статьи показали хорошее понимание CyberConnect и Web3. Победители будут объявлены на следующей неделе.\n\nПрошло некоторое время с тех пор, как мы достигли 50 тысяч подписчиков на нашем аккаунте в Твиттере. Как и обещали, скоро мы проведем наше мероприятие **50K**. Оставайтесь с нами!\n\n## Вопросы, полученные от сообщества\n\n### ***Вопрос: в чем преимущество CyberConnect перед конкурентами?***\n\n***Веньи:*** Как вы все знаете, CyberConnect — это децентрализованный протокол социального графа, дизайн которого строится четырех основных принципах: **Компонуемый**, **Портативный**, **Самостоятельный** и **Блокчейн-независимый**. По сравнению с аналогичными проектами, работающими над децентрализованным социальным графом, одним из основных наших отличий является способ хранения данных, что приводит к использованию различных API и SDK для построения. **CyberConnect более масштабируем, поскольку мы используем Ceramic, IPFS и Arweave в качестве хранилища данных**, по сравнению с использованием NFT в качестве формы хранения данных в других протоколах. Поскольку некоторые подобные проекты позволяют разработчикам строить только на одном блокчейне, CyberConnect не зависит от блокчейна, поэтому наш протокол позволяет разработчикам строить на разных блокчейнах, совместимых с CyberConnect.\n\n**Интеграция с протоколом CyberConnect очень проста**. Весь процесс интеграции, включая все наши SDK и API, можно выполнить за один день. Все, что вам нужно сделать, это написать пару строк кода, а API и SDK уже подключены и готовы к работе. Для некоторых подобных проектов, которые я видел, процесс интеграции занимает гораздо больше затрат на разработку программного обеспечения, поэтому он менее удобен для пользователей и требует больше времени для разработчиков.\n\nЧто касается нашего продукта Link3, Link3 — это нативный универсальный профиль web3, аналогичный [Linktr.ee](http://Linktr.ee) и LinkedIn. **По сравнению с [Linktr.ee](http://Linktr.ee), Link3 по своей сути децентрализован и нативен для web3 в том, как мы храним и используем данные, в то время как  [Linktr.ee](http://Linktr.ee) просто объединяет ссылки вместе.** Link3 более надежен и ориентирован на контент, что открывает новую функциональность и возможности управлять своим сообществом и личностью нативным web3 способом. Например, вы можете связать свою команду на страницах Twitter, выделить определенный контент и подключить людей с адресами кошельков для airdrop, вознаградить участников, создать таблицу лидеров и другими способами взаимодействовать со своим сообществом.\n\nДля получения дополнительной информации посетите наш веб-сайт и аккаунт в Twitter или напишите мне в директ.\n\n### ***Вопрос. Каков план привлечения и расширения сообщества, а также улучшения пользовательского опыта?***\n\n***Рой:*** Поддержка сообщества, безусловно, является ключом к успеху проекта. В последние месяцы мы пробовали различные инициативы, чтобы узнать больше о CyberConnect и взаимодействовать с нами. Мы организовали для вас несколько мероприятий, чтобы повеселиться и наградить участников NFT, стейблкоинами, OAT и т. д. **Оставайтесь активными и участвуйте в общественных мероприятиях.**   Наша цель - создать дружелюбное и веселое сообщество, в котором наши сторонники могли бы пообщаться и узнать о нас больше.\n\n### ***Вопрос: как медвежий рынок влияет на CyberConnect?***\n\n***Веньи:*** Как видите, наше сообщество действительно сильное. Тот факт, что у нас около 4500 слушателей, является хорошим признаком развития нашего продукта и поддержки сообщества, несмотря на состояние рынка. Мы создаем инфраструктуру для поддержки социальных сетей web3 и создания полезных проектов, и мы заметили большую привлекательность протокола CyberConnect и профиля Link3. **Наша команда сосредоточена на основах бизнеса и проектах, которые мы создаем, я не слишком беспокоюсь о медвежьем рынке.**\n\n### ***Вопрос: как CyberConnect улучшает меры безопасности и конфиденциальности?***\n\n***Рой:*** На данный момент мы не слишком беспокоимся о конфиденциальности, так как наш продукт ориентирован на публичные подписки и отношения с подписчиками. Как и в Твиттере, взаимоотношения подписчиков являются общедоступной информацией, к которой каждый может получить доступ. Поскольку мы развиваем другие социальные отношения с запросами и аутентификацией, для таких функций будут введены дополнительные меры конфиденциальности. **В долгосрочной перспективе наша команда определенно сосредоточится на улучшении мер безопасности и конфиденциальности, но в настоящее время мы больше сосредоточены на том, чтобы больше людей узнали о CyberConnect и строили вместе с нами.**\n\n### ***Вопрос: как я могу внести свой вклад в CyberConnect?***\n\n***Рой:*** Не стесняйтесь проверить все наши каналы Discord и региональные каналы. Первый шаг к участию в сообществе — оставаться активным, взаимодействовать с другими членами сообщества и помогать друг другу. Кроме того, следите за мероприятиями и участвуйте в них. **Ознакомьтесь со [структурой ролей](https://cyberconnect.notion.site/cyberconnect/New-Role-Badge-System-Explained-9ee8286dd2524ddca1e285cc261817c0) в сообществе и более ранними [объявлениями о ролях](https://discord.com/channels/901233976138682388/911463669949403157/911464529395859487) в сообществе на нескольких языках.**\n\n### ***Вопрос: Планируется ли создание сообщества Telegram?***\n\n***Рой:*** Discord всегда был для нас самым большим сообществом, но мы также планировали создать сообщество Telegram. Мы создаем группу Telegram, которая должна быть готова на следующей неделе. Сообщество Telegram создано для тех, кто предпочитает использовать Telegram, чтобы оставаться в курсе последних событий вместе с нами. У нас определенно есть план для сообщества Telegram, следите за обновлениями!\n\n### ***Вопрос: Планируется ли публичная продажа?***\n\n***Рой:*** Сейчас у нас нет никакой дополнительной информации о публичной продаже. Следите за будущими обновлениями!\n\n### ***Вопрос: есть ли у CyberConnect какие-либо партнерские программы?***\n\n***Рой:*** Вы можете ознакомиться с нашими партнерами на [cyberconnect.me](http://cyberconnect.me). У нас есть много партнеров, которые опираются на наш протокол. У нас также есть партнеры, интегрирующие Link3, а также стратегические партнеры.\n\n### ***Вопрос: Когда состоится китайская AMA?***\n\n***Рой: Давайте проведем AMA с китайским сообществом в следующую пятницу, 17 июня.*** И если вы хотите провести AMA с любыми международными каналами, пожалуйста, не стесняйтесь обращаться к Рою. Мы хотим связаться с вами, ребята.\n\n### ***Вопрос: Проводятся ли какие-либо специальные мероприятия, позволяющие новичкам узнать больше о проекте?***\n\n***Рой:*** Мы понимаем, что довольно сложно понять концепции социального графа и социальной сети web3. Есть много комнат для новичков, чтобы постепенно узнать о нас больше. Есть задачи по дизайну и задачи по написанию статей, чтобы показать свои таланты. У нас также есть каналы #lifestye и #market-trade, где вы, ребята, можете обсуждать идеи и рассказывать о жизни. Мы открыты для новых идей и новых способов, чтобы вы, ребята, чувствовали себя желанными гостями и узнавали о нас больше. Если у вас есть хорошие идеи, пришлите мне DM!\n\n### ***Вопрос: каков план CyberConnect для китайского рынка?***\n\n***Рой:*** У нас нет отдельного плана для конкретных стран или регионов. Я считаю, что web3 выходит за пределы региональных и физических границ. Например, в нашем сообществе есть разные языковые каналы. **Наша маркетинговая стратегия не специфична для разных стран, и мы приглашаем пользователей и разработчиков со всего мира интегрироваться с нами и пользоваться преимуществами CyberConnect.**\n\n[https://www.notion.so/cyberconnect/Community-Call-AMA-4-Recap-June-10th-f74afdb687524acf8c5173654a69f452](https://www.notion.so/cyberconnect/Community-Call-AMA-4-Recap-June-10th-f74afdb687524acf8c5173654a69f452)\n\n", "timestamp": 1655354177, "digest": "orOYzOg7T--FCPHiZFnpSXV-wPabGZzhoLEGZy1uMd0", "contributor": "0x9706114C6068704911C0439f2341129e64604144"}
{"id": "Uqdis_6HSHbSU_mP2Hkt-QRztBGdE0-RxnamW_iQRgI", "title": "mirror", "body": "mirror", "timestamp": 1655354124, "digest": "Qw_WgHBQ2sfF254yTjQNctpY9GenmBPlkmkuyAo0BNU", "contributor": "0x58427aCA59371b1FC3E9d4E76d362D1429feb966"}
{"id": "gjPa97EF2U7DuahUogBXYPuQmuLqX_Qr-fOwdloG05A", "title": "不斷更新迷催听药〖咨询474y.com〗,安眠药 哪里 买,迷催听药新[咨询474y.com],匿名搜索催情藥種類,迷药购买渠道", "body": "叹号搜索迷睡药,失眠 怎麼 解決,迷睡药什么地方卖,效果好的最強 的 春藥,吃 了 春藥\n\n[https://www.olx.com.br/brasil?q=印度药房,什么饮料可以催情【官网474y.com】+](https://www.olx.com.br/brasil?q=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://vivagrass.eu/lv/?s=印度药房,什么饮料可以催情【官网474y.com】+](https://vivagrass.eu/lv/?s=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.oscars.co.uk/search?q=印度药房,什么饮料可以催情【官网474y.com】+](https://www.oscars.co.uk/search?q=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://search.usa.gov/search?affiliate=ed.gov&query=印度药房,什么饮料可以催情【官网474y.com】+](https://search.usa.gov/search?affiliate=ed.gov&query=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.pinqueue.com/topic/?query=印度药房,什么饮料可以催情【官网474y.com】+](https://www.pinqueue.com/topic/?query=%E5%8D%B0%E5%BA%A6%E8%8D%AF%E6%88%BF,%E4%BB%80%E4%B9%88%E9%A5%AE%E6%96%99%E5%8F%AF%E4%BB%A5%E5%82%AC%E6%83%85%E3%80%90%E5%AE%98%E7%BD%91474y.com%E3%80%91+)\n\n[https://www.indeed.com/jobs?q=怎么购艾司唑仑〖微信2454793〗%2C自製 媚 藥%2C艾司唑仑去哪里买〖微信2454793〗%2C隐私播报迷魂水ptt%2C台湾昏睡药&from=searchOnHP](https://www.indeed.com/jobs?q=%e6%80%8e%e4%b9%88%e8%b4%ad%e8%89%be%e5%8f%b8%e5%94%91%e4%bb%91%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%87%aa%e8%a3%bd%20%e5%aa%9a%20%e8%97%a5%2c%e8%89%be%e5%8f%b8%e5%94%91%e4%bb%91%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e8%bf%b7%e9%ad%82%e6%b0%b4ptt%2c%e5%8f%b0%e6%b9%be%e6%98%8f%e7%9d%a1%e8%8d%af&from=searchOnHP)\n\n[https://hands.net/search/?q=新迷魂药\\[微信2454793\\]%2C失眠 dcard%2C迷魂药出售【官网%3Amiyao.in】%2C叹号搜索失眠 看 中醫%2C吃 什麼 可以 幫助 睡眠](https://hands.net/search/?q=%e6%96%b0%e8%bf%b7%e9%ad%82%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%a4%b1%e7%9c%a0%20dcard%2c%e8%bf%b7%e9%ad%82%e8%8d%af%e5%87%ba%e5%94%ae%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e5%a4%b1%e7%9c%a0%20%e7%9c%8b%20%e4%b8%ad%e9%86%ab%2c%e5%90%83%20%e4%bb%80%e9%ba%bc%20%e5%8f%af%e4%bb%a5%20%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0)\n\n[https://www.youtube.com/hashtag/在哪有卖迷奸水〖微信2454793〗%2C陰道 春藥%2C迷奸水购买《官网miyao.in》%2C匿名搜索失眠 可 看 神經 內科 嗎%2C安神 汤 配方](https://www.youtube.com/hashtag/%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96%e8%bf%b7%e5%a5%b8%e6%b0%b4%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e9%99%b0%e9%81%93%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e5%a5%b8%e6%b0%b4%e8%b4%ad%e4%b9%b0%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e5%a4%b1%e7%9c%a0%20%e5%8f%af%20%e7%9c%8b%20%e7%a5%9e%e7%b6%93%20%e5%85%a7%e7%a7%91%20%e5%97%8e%2c%e5%ae%89%e7%a5%9e%20%e6%b1%a4%20%e9%85%8d%e6%96%b9)\n\n[https://www.youtube.com/hashtag/在哪有卖安眠葯〖微信2454793〗%2C失眠 要 看 什麼 科%2C安眠葯怎么买\\[微信2454793〗%2C出售男 春藥%2C春药出售](https://www.youtube.com/hashtag/%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96%e5%ae%89%e7%9c%a0%e8%91%af%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%a4%b1%e7%9c%a0%20%e8%a6%81%20%e7%9c%8b%20%e4%bb%80%e9%ba%bc%20%e7%a7%91%2c%e5%ae%89%e7%9c%a0%e8%91%af%e6%80%8e%e4%b9%88%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%87%ba%e5%94%ae%e7%94%b7%20%e6%98%a5%e8%97%a5%2c%e6%98%a5%e8%8d%af%e5%87%ba%e5%94%ae)\n\n[https://www.lonelyplanet.com/search?q=怎么购昏迷香【官网%3Awww.474y.com】%2C春藥 藥 效%2C昏迷香怎么买\\[微信2454793〗%2C匿名搜索睡眠 中斷 改善%2C打 完 疫苗 可以 吃 安眠藥 睡覺 嗎](https://www.lonelyplanet.com/search?q=%e6%80%8e%e4%b9%88%e8%b4%ad%e6%98%8f%e8%bf%b7%e9%a6%99%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e6%98%a5%e8%97%a5%20%e8%97%a5%20%e6%95%88%2c%e6%98%8f%e8%bf%b7%e9%a6%99%e6%80%8e%e4%b9%88%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e7%9d%a1%e7%9c%a0%20%e4%b8%ad%e6%96%b7%20%e6%94%b9%e5%96%84%2c%e6%89%93%20%e5%ae%8c%20%e7%96%ab%e8%8b%97%20%e5%8f%af%e4%bb%a5%20%e5%90%83%20%e5%ae%89%e7%9c%a0%e8%97%a5%20%e7%9d%a1%e8%a6%ba%20%e5%97%8e)\n\n[https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=哪里有安眠药\\[微信2454793\\]%2C怎麼 解決 失眠%2C安眠药去哪买\\[微信2454793〗%2C哪里卖迷情藥推薦%2C春藥 有效](https://casetext.com/search?p=1&jxs=&sort=relevance&type=case&ssr=false&tab=keyword&q=%e5%93%aa%e9%87%8c%e6%9c%89%e5%ae%89%e7%9c%a0%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%80%8e%e9%ba%bc%20%e8%a7%a3%e6%b1%ba%20%e5%a4%b1%e7%9c%a0%2c%e5%ae%89%e7%9c%a0%e8%8d%af%e5%8e%bb%e5%93%aa%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e9%87%8c%e5%8d%96%e8%bf%b7%e6%83%85%e8%97%a5%e6%8e%a8%e8%96%a6%2c%e6%98%a5%e8%97%a5%20%e6%9c%89%e6%95%88)\n\n[https://www.rea.govt.nz/search?searchterm=哪裏买蒙汗药\\[微信2454793\\]%2C幫助 睡眠 食物%2C蒙汗药怎么\\[微信2454793〗%2C出售男 春藥%2C春藥 功效](https://www.rea.govt.nz/search?searchterm=%e5%93%aa%e8%a3%8f%e4%b9%b0%e8%92%99%e6%b1%97%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e9%a3%9f%e7%89%a9%2c%e8%92%99%e6%b1%97%e8%8d%af%e6%80%8e%e4%b9%88%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%87%ba%e5%94%ae%e7%94%b7%20%e6%98%a5%e8%97%a5%2c%e6%98%a5%e8%97%a5%20%e5%8a%9f%e6%95%88)\n\n[https://malegislature.gov/Events/Search?searchTerms=什么地方卖慢性毒药【官网%3Amiyao.in】%2C如何 改善 睡眠 品質%2C慢性毒药怎么购【官网%3Awww.474y.com】%2C什么地方有迷药怎么用%2C失眠 看 什么 科](https://malegislature.gov/Events/Search?searchTerms=%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e6%85%a2%e6%80%a7%e6%af%92%e8%8d%af%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e5%a6%82%e4%bd%95%20%e6%94%b9%e5%96%84%20%e7%9d%a1%e7%9c%a0%20%e5%93%81%e8%b3%aa%2c%e6%85%a2%e6%80%a7%e6%af%92%e8%8d%af%e6%80%8e%e4%b9%88%e8%b4%ad%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e8%bf%b7%e8%8d%af%e6%80%8e%e4%b9%88%e7%94%a8%2c%e5%a4%b1%e7%9c%a0%20%e7%9c%8b%20%e4%bb%80%e4%b9%88%20%e7%a7%91)\n\n[https://newyork.craigslist.org/search/sss?query=怎么fmi〖微信2454793〗%2C老人 失眠 之 治療 與 護理%2Cfmi购买【微信2454793】%2C新的安眠藥 哪裡 買 2021%2C迷暈藥](https://newyork.craigslist.org/search/sss?query=%e6%80%8e%e4%b9%88fmi%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%80%81%e4%ba%ba%20%e5%a4%b1%e7%9c%a0%20%e4%b9%8b%20%e6%b2%bb%e7%99%82%20%e8%88%87%20%e8%ad%b7%e7%90%86%2cfmi%e8%b4%ad%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e6%96%b0%e7%9a%84%e5%ae%89%e7%9c%a0%e8%97%a5%20%e5%93%aa%e8%a3%a1%20%e8%b2%b7%202021%2c%e8%bf%b7%e6%9a%88%e8%97%a5)\n\n[https://hartmuseum.org/search?keys=女用迷情药\\[官网miyao.in\\]%2C昏迷水%2C迷情药哪里卖\\[微信2454793\\]%2C去哪买安眠药 推荐%2C怎樣 算 失眠](https://hartmuseum.org/search?keys=%e5%a5%b3%e7%94%a8%e8%bf%b7%e6%83%85%e8%8d%af%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e6%98%8f%e8%bf%b7%e6%b0%b4%2c%e8%bf%b7%e6%83%85%e8%8d%af%e5%93%aa%e9%87%8c%e5%8d%96%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e5%ae%89%e7%9c%a0%e8%8d%af%20%e6%8e%a8%e8%8d%90%2c%e6%80%8e%e6%a8%a3%20%e7%ae%97%20%e5%a4%b1%e7%9c%a0)\n\n[https://tarpits.org/search?keys=什么地方卖失亿水《官网miyao.in》%2C安眠藥 診所%2C失亿水不斷更新\\[微信2454793〗%2C叹号搜索力月西%2C睡眠 障礙 看 什麼 科](https://tarpits.org/search?keys=%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e5%a4%b1%e4%ba%bf%e6%b0%b4%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%ae%89%e7%9c%a0%e8%97%a5%20%e8%a8%ba%e6%89%80%2c%e5%a4%b1%e4%ba%bf%e6%b0%b4%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e5%8a%9b%e6%9c%88%e8%a5%bf%2c%e7%9d%a1%e7%9c%a0%20%e9%9a%9c%e7%a4%99%20%e7%9c%8b%20%e4%bb%80%e9%ba%bc%20%e7%a7%91)\n\n[https://newyork.craigslist.org/search/sss?query=怎么购买 捡尸水〖微信2454793〗%2C購買 春藥%2C 捡尸水什么地方有【官网%3A474y·com】%2C怎么买改善 睡眠 的 食物%2C失眠 該 怎麼 辦](https://newyork.craigslist.org/search/sss?query=%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%20%e6%8d%a1%e5%b0%b8%e6%b0%b4%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%b3%bc%e8%b2%b7%20%e6%98%a5%e8%97%a5%2c%20%e6%8d%a1%e5%b0%b8%e6%b0%b4%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e3%80%90%e5%ae%98%e7%bd%91%3a474y%c2%b7com%e3%80%91%2c%e6%80%8e%e4%b9%88%e4%b9%b0%e6%94%b9%e5%96%84%20%e7%9d%a1%e7%9c%a0%20%e7%9a%84%20%e9%a3%9f%e7%89%a9%2c%e5%a4%b1%e7%9c%a0%20%e8%a9%b2%20%e6%80%8e%e9%ba%bc%20%e8%be%a6)\n\n[https://ballotpedia.org/wiki/index.php?search=怎么购买失身粉〖微信2454793〗%2C吃 了 偉哥 會 怎樣%2C失身粉真的有【微信2454793】%2C哪里卖睡 不 著 方法%2C助 眠 药](https://ballotpedia.org/wiki/index.php?search=%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e5%a4%b1%e8%ba%ab%e7%b2%89%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%90%83%20%e4%ba%86%20%e5%81%89%e5%93%a5%20%e6%9c%83%20%e6%80%8e%e6%a8%a3%2c%e5%a4%b1%e8%ba%ab%e7%b2%89%e7%9c%9f%e7%9a%84%e6%9c%89%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%93%aa%e9%87%8c%e5%8d%96%e7%9d%a1%20%e4%b8%8d%20%e8%91%97%20%e6%96%b9%e6%b3%95%2c%e5%8a%a9%20%e7%9c%a0%20%e8%8d%af)\n\n[https://search.usa.gov/search?affiliate=ed.gov&query=口服型伟哥\\[微信2454793\\]%2C春藥 真 假%2C伟哥去哪里买【微信2454793】%2C叹号搜索中醫 治 失眠%2C更年期 睡 不 著](https://search.usa.gov/search?affiliate=ed.gov&query=%e5%8f%a3%e6%9c%8d%e5%9e%8b%e4%bc%9f%e5%93%a5%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%98%a5%e8%97%a5%20%e7%9c%9f%20%e5%81%87%2c%e4%bc%9f%e5%93%a5%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e4%b8%ad%e9%86%ab%20%e6%b2%bb%20%e5%a4%b1%e7%9c%a0%2c%e6%9b%b4%e5%b9%b4%e6%9c%9f%20%e7%9d%a1%20%e4%b8%8d%20%e8%91%97)\n\n[https://www.indeed.com/jobs?q=去哪里买春藥〖微信2454793〗%2C自律 神經 失眠%2C春藥哪裏买\\[微信2454793〗%2C网上有卖春藥 藥 局%2C失眠 褪 黑 激素&from=searchOnHP](https://www.indeed.com/jobs?q=%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%e6%98%a5%e8%97%a5%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%87%aa%e5%be%8b%20%e7%a5%9e%e7%b6%93%20%e5%a4%b1%e7%9c%a0%2c%e6%98%a5%e8%97%a5%e5%93%aa%e8%a3%8f%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e7%bd%91%e4%b8%8a%e6%9c%89%e5%8d%96%e6%98%a5%e8%97%a5%20%e8%97%a5%20%e5%b1%80%2c%e5%a4%b1%e7%9c%a0%20%e8%a4%aa%20%e9%bb%91%20%e6%bf%80%e7%b4%a0&from=searchOnHP)\n\n[https://www.olx.com.br/brasil?q=隐私播报三唑仑片〖微信2454793〗%2C最 好 的 安眠药%2C三唑仑片怎么购\\[微信2454793\\]%2C什么地方卖弥漫之夜%2C如何 自製 春藥](https://www.olx.com.br/brasil?q=%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e4%b8%89%e5%94%91%e4%bb%91%e7%89%87%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e6%9c%80%20%e5%a5%bd%20%e7%9a%84%20%e5%ae%89%e7%9c%a0%e8%8d%af%2c%e4%b8%89%e5%94%91%e4%bb%91%e7%89%87%e6%80%8e%e4%b9%88%e8%b4%ad%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e5%bc%a5%e6%bc%ab%e4%b9%8b%e5%a4%9c%2c%e5%a6%82%e4%bd%95%20%e8%87%aa%e8%a3%bd%20%e6%98%a5%e8%97%a5)\n\n[https://masslegalhelp.org/search/google/怎么买催情药〖微信2454793〗%2C迷魂藥%2C催情药怎么购\\[微信2454793\\]%2C叹号搜索幫助 睡眠 飲品%2C春藥 合法](https://masslegalhelp.org/search/google/%e6%80%8e%e4%b9%88%e4%b9%b0%e5%82%ac%e6%83%85%e8%8d%af%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%bf%b7%e9%ad%82%e8%97%a5%2c%e5%82%ac%e6%83%85%e8%8d%af%e6%80%8e%e4%b9%88%e8%b4%ad%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e5%b9%ab%e5%8a%a9%20%e7%9d%a1%e7%9c%a0%20%e9%a3%b2%e5%93%81%2c%e6%98%a5%e8%97%a5%20%e5%90%88%e6%b3%95)\n\n[https://www.ikea.cn/cn/en/search/products/?q=什么地方卖迷晕剂《官网miyao.in》%2C口服 春藥%2C迷晕剂网上哪买\\[微信2454793〗%2C叹号搜索春心 蕩漾 春藥%2C春药出售](https://www.ikea.cn/cn/en/search/products/?q=%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e8%bf%b7%e6%99%95%e5%89%82%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%8f%a3%e6%9c%8d%20%e6%98%a5%e8%97%a5%2c%e8%bf%b7%e6%99%95%e5%89%82%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8f%b9%e5%8f%b7%e6%90%9c%e7%b4%a2%e6%98%a5%e5%bf%83%20%e8%95%a9%e6%bc%be%20%e6%98%a5%e8%97%a5%2c%e6%98%a5%e8%8d%af%e5%87%ba%e5%94%ae)\n\n[https://www.youtube.com/hashtag/哪裏有迷情粉\\[微信2454793\\]%2C三 唑 仑 安眠药%2C迷情粉哪裏买〖微信2454793〗%2C哪里有真的催眠藥哪裏買%2C安眠药 吃 多 了 会 怎么 样](https://www.youtube.com/hashtag/%e5%93%aa%e8%a3%8f%e6%9c%89%e8%bf%b7%e6%83%85%e7%b2%89%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e5%ae%89%e7%9c%a0%e8%8d%af%2c%e8%bf%b7%e6%83%85%e7%b2%89%e5%93%aa%e8%a3%8f%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e9%87%8c%e6%9c%89%e7%9c%9f%e7%9a%84%e5%82%ac%e7%9c%a0%e8%97%a5%e5%93%aa%e8%a3%8f%e8%b2%b7%2c%e5%ae%89%e7%9c%a0%e8%8d%af%20%e5%90%83%20%e5%a4%9a%20%e4%ba%86%20%e4%bc%9a%20%e6%80%8e%e4%b9%88%20%e6%a0%b7)\n\n[https://search.usa.gov/search?affiliate=usagov&query=女用 澳門春藥\\[微信2454793\\]%2C澳門激情藥%2C 澳門春藥去哪里买\\[微信2454793\\]%2C怎么购买失眠 穴道%2C催眠 失眠](https://search.usa.gov/search?affiliate=usagov&query=%e5%a5%b3%e7%94%a8%20%e6%be%b3%e9%96%80%e6%98%a5%e8%97%a5%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%be%b3%e9%96%80%e6%bf%80%e6%83%85%e8%97%a5%2c%20%e6%be%b3%e9%96%80%e6%98%a5%e8%97%a5%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%80%8e%e4%b9%88%e8%b4%ad%e4%b9%b0%e5%a4%b1%e7%9c%a0%20%e7%a9%b4%e9%81%93%2c%e5%82%ac%e7%9c%a0%20%e5%a4%b1%e7%9c%a0)\n\n[https://www.internationalstudent.com/school-search/school/search/?SchoolSearch\\[schoolName\\]=怎么购拍肩粉【官网%3Awww.474y.com】%2C迷藥拍賣%2C拍肩粉哪裏买〖微信2454793〗%2C什么地方卖女生 助 性 藥%2C春藥 藥房&page=1](https://www.internationalstudent.com/school-search/school/search/?SchoolSearch%5BschoolName%5D=%e6%80%8e%e4%b9%88%e8%b4%ad%e6%8b%8d%e8%82%a9%e7%b2%89%e3%80%90%e5%ae%98%e7%bd%91%3awww.474y.com%e3%80%91%2c%e8%bf%b7%e8%97%a5%e6%8b%8d%e8%b3%a3%2c%e6%8b%8d%e8%82%a9%e7%b2%89%e5%93%aa%e8%a3%8f%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e5%a5%b3%e7%94%9f%20%e5%8a%a9%20%e6%80%a7%20%e8%97%a5%2c%e6%98%a5%e8%97%a5%20%e8%97%a5%e6%88%bf&page=1)\n\n[https://ilga.org/fr/gsearch/网上哪买迷情水\\[微信2454793\\]%2C迷药怎样订购%2C迷情水网上有卖【微信2454793】%2C购买迷藥%2C睡眠 品質 不 好 怎麼 辦](https://ilga.org/fr/gsearch/%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e8%bf%b7%e6%83%85%e6%b0%b4%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e8%bf%b7%e8%8d%af%e6%80%8e%e6%a0%b7%e8%ae%a2%e8%b4%ad%2c%e8%bf%b7%e6%83%85%e6%b0%b4%e7%bd%91%e4%b8%8a%e6%9c%89%e5%8d%96%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e8%b4%ad%e4%b9%b0%e8%bf%b7%e8%97%a5%2c%e7%9d%a1%e7%9c%a0%20%e5%93%81%e8%b3%aa%20%e4%b8%8d%20%e5%a5%bd%20%e6%80%8e%e9%ba%bc%20%e8%be%a6)\n\n[https://1000wordphilosophy.com/?s=什么地方有迷香\\[微信2454793\\]%2C伟哥%2C迷香去哪里买\\[微信2454793\\]%2C哪里卖迷药怎么样%2C女人 吃 春藥](https://1000wordphilosophy.com/?s=%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e6%9c%89%e8%bf%b7%e9%a6%99%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%bc%9f%e5%93%a5%2c%e8%bf%b7%e9%a6%99%e5%8e%bb%e5%93%aa%e9%87%8c%e4%b9%b0%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e5%93%aa%e9%87%8c%e5%8d%96%e8%bf%b7%e8%8d%af%e6%80%8e%e4%b9%88%e6%a0%b7%2c%e5%a5%b3%e4%ba%ba%20%e5%90%83%20%e6%98%a5%e8%97%a5)\n\n[https://www.tripadvisor.co.uk/Search?q=哪里有迷情药\\[微信2454793\\]%2C改善 睡眠 的 食物%2C迷情药去哪买【微信2454793】%2C效果好的失忆水购买%2C乖乖 水 購買](https://www.tripadvisor.co.uk/Search?q=%e5%93%aa%e9%87%8c%e6%9c%89%e8%bf%b7%e6%83%85%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e6%94%b9%e5%96%84%20%e7%9d%a1%e7%9c%a0%20%e7%9a%84%20%e9%a3%9f%e7%89%a9%2c%e8%bf%b7%e6%83%85%e8%8d%af%e5%8e%bb%e5%93%aa%e4%b9%b0%e3%80%90%e5%be%ae%e4%bf%a12454793%e3%80%91%2c%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e5%a4%b1%e5%bf%86%e6%b0%b4%e8%b4%ad%e4%b9%b0%2c%e4%b9%96%e4%b9%96%20%e6%b0%b4%20%e8%b3%bc%e8%b2%b7)\n\n[https://www.buzzfeed.com/search?q=效果好的苍蝇粉\\[微信2454793〗%2C迷幻水效果%2C苍蝇粉去哪买〖微信2454793〗%2C去哪买三 唑 仑 药 效%2C新加坡春藥](https://www.buzzfeed.com/search?q=%e6%95%88%e6%9e%9c%e5%a5%bd%e7%9a%84%e8%8b%8d%e8%9d%87%e7%b2%89%5b%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e8%bf%b7%e5%b9%bb%e6%b0%b4%e6%95%88%e6%9e%9c%2c%e8%8b%8d%e8%9d%87%e7%b2%89%e5%8e%bb%e5%93%aa%e4%b9%b0%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%8e%bb%e5%93%aa%e4%b9%b0%e4%b8%89%20%e5%94%91%20%e4%bb%91%20%e8%8d%af%20%e6%95%88%2c%e6%96%b0%e5%8a%a0%e5%9d%a1%e6%98%a5%e8%97%a5)\n\n[https://ilga.org/fr/gsearch/在哪有卖ghb《官网miyao.in》%2C失眠 藥物 選擇%2Cghb隐私播报【官网%3Amiyao.in】%2C网上哪买管 花 肉蓯蓉 失眠%2C性冷淡找到了属于自己的性爱场](https://ilga.org/fr/gsearch/%e5%9c%a8%e5%93%aa%e6%9c%89%e5%8d%96ghb%e3%80%8a%e5%ae%98%e7%bd%91miyao.in%e3%80%8b%2c%e5%a4%b1%e7%9c%a0%20%e8%97%a5%e7%89%a9%20%e9%81%b8%e6%93%87%2cghb%e9%9a%90%e7%a7%81%e6%92%ad%e6%8a%a5%e3%80%90%e5%ae%98%e7%bd%91%3amiyao.in%e3%80%91%2c%e7%bd%91%e4%b8%8a%e5%93%aa%e4%b9%b0%e7%ae%a1%20%e8%8a%b1%20%e8%82%89%e8%93%af%e8%93%89%20%e5%a4%b1%e7%9c%a0%2c%e6%80%a7%e5%86%b7%e6%b7%a1%e6%89%be%e5%88%b0%e4%ba%86%e5%b1%9e%e4%ba%8e%e8%87%aa%e5%b7%b1%e7%9a%84%e6%80%a7%e7%88%b1%e5%9c%ba)\n\n[https://ballotpedia.org/wiki/index.php?search=匿名搜索拍肩粉\\[官网miyao.in\\]%2C女生 助興 藥%2C拍肩粉什么地方卖〖微信2454793〗%2C哪裏买巧克力 失眠%2C魚油 失眠](https://ballotpedia.org/wiki/index.php?search=%e5%8c%bf%e5%90%8d%e6%90%9c%e7%b4%a2%e6%8b%8d%e8%82%a9%e7%b2%89%5b%e5%ae%98%e7%bd%91miyao.in%5d%2c%e5%a5%b3%e7%94%9f%20%e5%8a%a9%e8%88%88%20%e8%97%a5%2c%e6%8b%8d%e8%82%a9%e7%b2%89%e4%bb%80%e4%b9%88%e5%9c%b0%e6%96%b9%e5%8d%96%e3%80%96%e5%be%ae%e4%bf%a12454793%e3%80%97%2c%e5%93%aa%e8%a3%8f%e4%b9%b0%e5%b7%a7%e5%85%8b%e5%8a%9b%20%e5%a4%b1%e7%9c%a0%2c%e9%ad%9a%e6%b2%b9%20%e5%a4%b1%e7%9c%a0)\n\n[https://search.justice.gov/search?query=哪裏有喷雾型迷回药\\[微信2454793\\]%2C乖乖水使用心得%2C喷雾型迷回药哪里有\\[微信2454793\\]%2C不斷更新春藥 女 用%2C治療 失眠 的 食物&affiliate=justice](https://search.justice.gov/search?query=%e5%93%aa%e8%a3%8f%e6%9c%89%e5%96%b7%e9%9b%be%e5%9e%8b%e8%bf%b7%e5%9b%9e%e8%8d%af%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b9%96%e4%b9%96%e6%b0%b4%e4%bd%bf%e7%94%a8%e5%bf%83%e5%be%97%2c%e5%96%b7%e9%9b%be%e5%9e%8b%e8%bf%b7%e5%9b%9e%e8%8d%af%e5%93%aa%e9%87%8c%e6%9c%89%5b%e5%be%ae%e4%bf%a12454793%5d%2c%e4%b8%8d%e6%96%b7%e6%9b%b4%e6%96%b0%e6%98%a5%e8%97%a5%20%e5%a5%b3%20%e7%94%a8%2c%e6%b2%bb%e7%99%82%20%e5%a4%b1%e7%9c%a0%20%e7%9a%84%20%e9%a3%9f%e7%89%a9&affiliate=justice)", "timestamp": 1655354315, "digest": "PKi10SxoUzfFSPQoQa33l4Y8ecYYrgnDMcRvsUcAm8o", "contributor": "0xe600159d09b0c832ED1b85662AaE0AEBCd4dBe5c"}
{"id": "IGHSp8gr8WkqI3PUUH3UnM_nsM6lJpCIYj_HDZF_E4A", "title": "永续合约交易 101", "body": "![](https://images.mirror-media.xyz/publication-images/O75Rme2RHqchRGBzKL-zu.png?height=600&width=1061)\n\n本文中的解释和示例由我们的社区成员 JohanWalem4#3838 创建。\n\n**1.什么是期货合约，它是如何运作的？**\n\n期货合约是一种允许期货合​​约持有人在未来某一日期以固定价格买卖标的资产的协议。\n\n例子：\n\n假设您今天种植和收获了 100 公斤 (kg) 的小麦，并且您认为小麦的价格可以在 3 个月内从今天的 10 美元/公斤上涨到 20 美元/公斤（出于任何原因，例如小麦短缺或更多3 个月内对小麦的需求）。\n\n您可以购买一份期货合约，在 3 个月内以 20 美元/公斤的价格出售 100 公斤小麦。在本合同到期日，您可以行使该合同并以约定的价格出售小麦。\n\n**2.永续合约与期货合约有何不同或相似之处，它是如何运作的？**\n\n永续合约是一种没有固定到期日的期货合约。\n\n例子：\n\n在上述小麦示例中，永续小麦合约没有到期日，而不是 3 个月到期的期货合约。在大多数情况下，永续合约的价格往往与资产的现货价格有很强的相关性。因此，您可以使用永久掉期来接触资产，而无需在现货市场持有资产（现货市场交易资产以立即交割）。例如，在交易石油的情况下，可能很难接触现货石油，因为您将不得不花费额外的存储成本。在这种情况下，永久石油合约允许您在不持有现货市场的情况下接触标的资产（石油）的价格。\n\n**3.解释什么是资金支付——永续合约的核心机制。**\n\n资金费率是用于使永续合约价格接近现货资产价格的机制。资金机制平衡了买卖双方，这有助于保持多空之间的平衡，并保持永续价格与现货价格的稳定。\n\n资金支付是买卖双方在交易永续合约时产生的成本。正的资金利率意味着多头永续合约的持有人必须向短期永续合约的持有人支付费用。负资金利率意味着短期永续合约的持有人将不得不向长期永续合约的持有人支付费用。资金费率根据永续价格与现货价格的偏差上下浮动。\n\n例子：\n\n如果小麦现货价格为 10 美元，而小麦永续合约价格为 11 美元，则资金费率为正。 这意味着看涨合约的持有者将不得不向看跌合约的持有者支付费用。 这种机制将阻止那些持有看涨的人，因为他们将不得不付出更多的资金费用。 因此，永续合约的价格将回到现货价格并缩小差距。\n\n**4.您如何从资金支付中获利或亏损**？\n\n您可以根据资金费率进行定向仓位，从而从资金支付中获利或亏损。如果资金利率为正，多头永续合约持有人必须向空头永续合约持有人支付费用。这意味着如果您在资金利率为正的情况下持有多头合约，那么您在持有头寸的同时支付利息。但是，当资金利率为正并且您持有永续合约的空头时，您将获得持有长永续合约的人支付的利息收入。因此，您可以从资金支付中获利或亏损。\n\n**5.什么是杠杆？使用杠杆有哪些好处和风险？**\n\n杠杆允许交易者通过提供适当数量的抵押品以较小的资本持有大头寸。\n\n例子：\n\n假设您想持有 100 公斤小麦期货，您可以提供 10 公斤小麦的抵押品，并持有 100 公斤的保证金头寸，而无需对整个 100 公斤进行现货敞口。使用杠杆的好处是它可以帮助交易者提高资本效率并以更低的成本增加风险敞口。使用杠杆的风险在于，如果价格因波动而迅速波动，可能会导致您损失抵押资本。使用杠杆时，必须采用健全的风险管理原则。\n\n**6.什么是套利？解释如何从永续合约市场的套利机会中获利或亏损。**\n\n套利是在多个市场买卖资产或商品以利用市场价格差异的做法。\n\n例子：\n\n如果永续市场价格与现货市场价格之间存在差异，交易者可以从套利机会中获利。例如，如果小麦在现货市场上的交易价格为 10 美元，而在永续市场上的交易价格为 11 美元，则交易者可以在永续市场上持有空头头寸，同时在现货市场上购买小麦。几天后，如果两个市场的价格都收敛到 12 美元，那么交易者的永续头寸会损失 1 美元，但现货头寸会获利 2 美元。因此，他们的净收益为 1 美元，即他们从套利机会中获利。但是，如果价格不收敛，他们可能会蒙受损失，而且价格不收敛的时间越长，他们也可能会产生额外的资金支付，这将增加他们的开支。\n\n**7.在高层次上，解释您将使用外汇或加密货币永续合约来投机或对冲您的资产的特定事件。**\n\n如果您认为标的资产的价格会根据经济前景发生变化，您可以使用永续合约对冲您的资产。例如，如果您持有加元（加元）并认为未来 6 个月内加元兑美元将因经济因素而贬值，您可以使用加元永续合约来对冲您的价格风险敞口。\n\nIncrement是一个基于 zkSync 2.0 的分布式算法汇率协议，为 DeFi 中的非美元参与者提供开放金融。\n\n要了解更多信息，请访问我们的[文档](https://docs.increment.finance/)\n有关最新更新和新闻，请在[Twitter](https://twitter.com/IncrementHQ) 上关注我们加入[Discord](https://discord.com/invite/2sFSmCmAH7)社区", "timestamp": 1655354330, "digest": "Xg5kWqmhgcRRd2Pjc9o1dL7286mJnNbt89tahhq0P5w", "contributor": "0xF0CEAe38Ac7c4BD57fb200e1d9bdBFa37073E60C"}
{"id": "mvxDZ_TmHw4e7eBBl9UhK_SL9ikRFD9cWGiNSvccXaQ", "title": "mirror", "body": "mirror", "timestamp": 1655354260, "digest": "k7jpklCA6So-vq5kjTgjW1P-MNhiagPwbTSWa4Yc5oo", "contributor": "0x792c9deED09affd7b14Af67281DAEa7C0d9DFc7F"}
{"id": "TWa8IiLawfUv2Wv131aojBB4d4ooSBhBxxT8PCJCuKg", "title": "Git over ipfs", "body": "* 理解 ipfs 的结构\n* 理解                     git           (混帐)                   remote\n* 理解 ipfs gateway\n* 熟悉 web3 工作流\n* ", "timestamp": 1655354375, "digest": "vEYab7fh9DMm94KROH5Sv9UH9fszK1S7PlT7d6A8wIk", "contributor": "0x3c73E3CFB07af745d2768Ca42Be7aa80E391F860"}
{"id": "FuFTRiO4BbmchSij0e1S3wawFrY1v5r2BlsO3t6HRS0", "title": "Git over ipfs", "body": "* 理解 ipfs 的结构\n* 理解扩展 git\n* 理解 ipfs gateway\n* 熟悉 web3 工作流\n* ", "timestamp": 1655354486, "digest": "vEYab7fh9DMm94KROH5Sv9UH9fszK1S7PlT7d6A8wIk", "contributor": "0x3c73E3CFB07af745d2768Ca42Be7aa80E391F860"}
{"id": "un68Zyprm_MlmgRwvG9pt0MEgtY4GTaBG12ksD7uTJs", "title": "mirror", "body": "mirror", "timestamp": 1655354408, "digest": "WY-wROBBNjFrVW1owMiY9JAnGR7bkFQI1G5mqigxkw8", "contributor": "0x7cC4e718AF986d2E5B2181ecB9CB88f5295fD828"}
{"id": "eVREVOxm7bdqX6Nwb7adgUXtuceZlHbIkNVjZf1iV6A", "title": "WTF", "body": "NOTHING", "timestamp": 1655354671, "digest": "iiu_VbTGf5IH13XytdVAnpiHkIXzX7B7Id5-xPvchTo", "contributor": "0xaDcC4b1424BAA396393E55B1b5C5549Eb4a75a6A"}
{"id": "nog9RyvxytOuPFwbSYcJNWQXeTEmQq11dDtIM0iEJIE", "title": "mirror", "body": "mirror", "timestamp": 1655354545, "digest": "9dbxPLp1zWEsGxEzh5WxUj4GfwnwbOfij1nNmJvHsO4", "contributor": "0x0D0cC5396fc54CfFCC6b6cF66101D28535e6813E"}
{"id": "wJD1J5LuSUXlbKbOs_KGwpgyoEQGVoW1DKzbaYSHi6s", "title": "谈谈人性的疯狂，谈谈为什么抄底摸顶总是亏损出局。", "body": " \n 老手死于抄底，新手死于追高。我想根据我理解的“上涨不言顶，下跌不言底”做两层含义的分析，并谈谈人性的疯狂，谈谈为什么抄底摸顶总是亏损出局这也是为什么，我在去年11月份的时候认为未来也许不会太乐观，让我清仓的主要原因，我交易系统中的下跌/反转趋势已经出现。不过这也导致 GMT 在二级市场我没有获得任何收益，因为 BTC 是我操作的一个重要指标。\n\n1\\.抄底/摸顶 第一层含义是，不要去判断行情的顶部与底部。为什么人总是在拉升之后，贸然开空；为什么在连贯的下跌途中，重仓开多。人们总是抱着侥幸与赌博心理，当行情大涨自己没有仓位，心里想着的绝对不是回调买入，而是恼怒，用开空来弥补自己的踏空心理，反之亦然。\n\n回过头看，正是这样的人在行情半山腰充当燃料，才促成了波澜壮阔的趋势。纵然侥幸空到顶部，大多也拿不住，平仓之后还要想着开多，凭运气赚的钱，凭实力亏回去。\n\n但是，只要我们在上升趋势中尽量不去判断行情的顶部，下跌趋势中不去判断行情的底部，而是等着反转结构形成，那也自然没有抄底/摸顶的念头。\n\n第二层含义就是持仓。当行情处于上涨趋势之中，我们持有的仓位如何才不会轻易地在回调的过程中被洗出来，这也需要理解上涨不言顶的意思。\n\n上涨不言顶即不去“预言”顶部的位置，重势不重价，只要处于上升趋势之中，保持仓位即可。只有当行情真正走出反转形态，才是离场观望或者反向操作的时候。\n\n这也是为什么，我在去年11月份的时候认为未来也许不会太乐观，让我清仓的主要原因，我交易系统中的下跌/反转趋势已经出现。不过这也导致 GMT 在二级市场我没有获得任何收益，因为 BTC 是我操作的一个重要指标。\n\n![](https://images.mirror-media.xyz/publication-images/iYEFAhoXoIctf-xv98Oxl.png?height=411&width=680)\n\n2\\.为什么不能轻易去抄底与摸顶？ 就像我之前所说，对于散户而言，右侧交易比左侧交易更加合适。因为散户没有资金量与时间的优势，投资的钱往往也是生活的一部分，投资项目往往小而集中。\n\n而机构的项目相比于散户来说是大而广，并且有着充足的时间来陪着一个项目成长，即使一个项目失败，投资列表里也还有不少不同赛道的项目。\n\n对于交易者来说，不能轻易抄底摸顶还有一个重要的原因——人性的疯狂。你永远不知道市场的疯狂能将价格推向多高，情绪的绝望能使价格跌到哪里。\n\n币圈有太多太多的例子，如某个meme币你因为没有仓位或卖出得过早，而在回调过程中去做空，那最后也只能沦为那众多爆仓资金中的一部分。\n\n人能够贪婪到什么程度，是我们不可能用数据来预测，牛顿留下的经典名言“我能计算出天体运行的轨迹，却难以预料到人们的疯狂。”时刻提醒我们被情绪操控的结果只能是亏损出局。我们能做的只是在人们陷入疯狂时，及时抽身离场。\n\n最后，写这篇文章的目的主要是告诉大家，逆势操作不可取，但也不能盲目的追涨杀跌，回调过程中跟随趋势才是唯一的生存机会。", "timestamp": 1655354553, "digest": "uK_t4_QGorJ2TrdE4BC9h_RZrZSM-C4gzQtM7Z0yZGo", "contributor": "0xf6e546668c397dcb64767efe331904Ba147D5025"}
{"id": "2ZXKJdStVsWx90qLm4aaSR6Op_CC7J4iEJ_6vGV-FSQ", "title": "近期行情的思考", "body": "很久没有写东西了\n\n最近的行情可谓煎熬，如果从5月初算起，短短一个半月时间从4万跌到2万，已经腰斩了。\n\n作为一个老韭菜，这样的暴跌也经历过好几次，312、519，都没有现在这样难熬。\n\n但是回过头想想，我心态都发生了不小的波动，相信整个市场中95%的人都处在极度恐慌和严重亏损中。\n\n币圈就是这样残酷，如果说其他市场是2-8法则的话，币圈可能是2-98法则。\n\n如果不能让98%的人都亏钱，那么剩下2%的人怎么可能暴富呢？\n\n昨天美联储加息75个基点的靴子落地，行情暂时稳住了，所以今天空下来进行了一些思考。\n\n主要想说两个方面，一是反思一下最近的操作失误和为什么会引起心态的波动。 二是预测一下今年下半年的行情。\n\n一、这波下跌的反思：\n\n这波下跌自反弹48000不成开始，当时我也反复在推特上强调是反弹不是反转，反弹很难超过50000，这一点判断还是非常准确的。\n\n不过本来心里的预期是跌到35000附近继续震荡，然后等9月份美联储加息缩表落地。\n\n没想到的是出了LUNA的黑天鹅事件，直接让整个市场血崩到30000。 \n\n虽然在LUNA崩盘的过程中也赚了一些搬砖的钱，但当时心里隐隐感觉到，今年接下去的行情很难了。\n\n之前制定的策略是在ETH 3000左右放了很多仓位做UNI V3，上下区间分别是2000-4500，对应BTC差不多在30000-60000之间做LP\n\n这样的策略本质是高抛低吸，不仅能赚取手续费，如果下跌正好帮我多抄一点便宜的现货，因为当时手头有大约200W U的筹码，心态还是比较好的。\n\n没想到的是LUNA危机直接让行情跌到了30000和2000附近，手中的筹码短时间内打光了不少。\n\n后面又补充了一部分资金把下限区间调到1500，碰到这波下跌又一下子打穿，导致手头的U打光了50%\n\n最终算了一下，这波从3000跌到1100的过程中，大约抄了350个ETH，均价接近2000，目前浮亏40%。\n\n再加上BTC一路抄底下来也消耗了不少资金，导致手头的U数量大幅减少，是现在心态动摇的最重要原因。\n\n这件事充分说明，炒币的核心还是要做好仓位管理，永远要留一定的资金可以保证抄底，手中有粮心中不慌。\n\n在BTC 20000和ETH 1100这个位置，说实话是很香的，但因为之前抄的过猛的缘故，我在这个价位没法再买太多了，非常遗憾。\n\n如果行情还能继续下跌到15000/700左右的位置，我还会继续抄。\n\n如果能反弹回1500以上，我会把抄底的ETH重新放回V3慢慢出货收回资金。\n\n如果一直在目前的价位震荡，就比较难受了，只能熬。\n\n我一直自认大方向上看的还是比较准，但是并不擅长做交易。\n\n擅长的是把自己的策略和投资组合调整到一种很舒服的状态，就是不管涨跌都很开心，晚上都睡的很香的状态。\n\n这次的操作没有处理好，值得反思。\n\n二、今年下半年的行情预测\n\n其实从年初到现在，我对大方向的判断还是基本准确的，但是行情往往走的比我预想的更极端，现实的结果就是会超过大部分人的预期。\n\n回过头来看，所有的核心因素都聚焦到通胀上，而通胀又恰恰是最难预测的。就连强如美联储，对通胀的预期都出现重点偏差，何况我们普通人。\n\n从昨天鲍威尔的讲话来看，暂时降低了一定程度的市场不确定性。比如明确了后面两次加息的幅度在50-75之间，并没有100的选项。\n\n并且给出了年底和明年初的大概利率水平。\n\n当然，这一些都还是建立在通胀逐步能可控的基础上。\n\n现在加息和缩表对通胀的作用说实话是非常有限的，真正能大幅改善通胀，我觉得只有两个办法：\n\n1、俄乌尽快停战，然后欧美给老毛子一个台阶下，继续其他方面制裁的情况下，放松能源方面的制裁，同时乌克兰逐步恢复粮食的出口。\n\n2、美国逐步取消对中国的关税。这个是早晚的事情，只是到底在什么时间点。我希望是20大之后，否则又给包子捡了个皮夹子。\n\n \n \n\n从这半年来看，2022确实比2018更艰难，但是我还是坚信年底或者最晚明年初会有一波小牛，关键还是调整好心态和仓位", "timestamp": 1655354853, "digest": "FiBqzHLPHzs_8ho12ylOGUh_9aBdjbuPN6L_Akqyh6M", "contributor": "0xE1049AE1c92CA090E02894F69F030d81B3Eec034"}
{"id": "6IkhziANUa3dLozLrMOas-oMD-7oJmJwLLCGrhgmGlA", "title": "WTF", "body": "NOTHING", "timestamp": 1655354886, "digest": "YhZNr803s2phDbzGSQi2lhc6h_mmNdQGTR3FE8xcNrA", "contributor": "0xaDcC4b1424BAA396393E55B1b5C5549Eb4a75a6A"}
{"id": "CfwdONDXT2KFsKkUJ_v8tf-HYF6EqpgKBShF0aJOf_g", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655354891, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "Dd16k0Jhwp6fKenYtVuS-kWb5sHg8M_ch2TcYrSJ67M", "title": "Space纪要｜链游如何破局，链游前景展望", "body": "编辑：DianeHoo.eth\n\n校对：Arain\n\nCIG Labs 出品\n\n![Space 海报](https://images.mirror-media.xyz/publication-images/o4I-f1TDA690F5cUyzt7N.png?height=2250&width=3884)\n\n链游被看作是最容易出圈的区块链应用之一，被赋予厚重的期望，但近期市场的风险厌恶情绪愈发高涨，链游的未来扑朔迷离。\n\n本期CIG Labs邀请了几位非常具有代表性的嘉宾，一起来聊聊链游该如何破局。其中有大厂游戏策略师Weijun，专注链游垂直赛道的W Labs瓜田实验室创始人，AC Capital的co-founder Vincent，以及chainlink社区大使修桑。\n\nCIG Labs是CIG DAO推出的实验室，为社区成员提供创、交流的空间，并通过社区成员的贡献，形成成员与DAO之间的相互赋能。\n\n以下为Space嘉宾金句摘录：\n\n### **Zolo：链游未来如何破圈，在于Play和Earn的巧妙设计**\n\n个人觉得现在链游中比较好的做法是，不在原来的游戏本上另起炉灶，而是在游戏里直接植入nft或token；不影响传统游戏玩家的体验，而是慢慢地引导玩家理解nft和token的设计。这是我个人目前比较欣赏的一种做法。\n\n看好未来链游的发展，游戏是绝佳的带领token或nft出圈的应用，游戏的发展也会反哺到更多的DeFi产品上。\n\n### **Weijun：传统游戏巨头对待新兴链游有两种不同的态度**\n\n我们可以把传统游戏巨头分成两类。\n\n一类是索尼、微软、steam等传统的发行商，在内部生产管线不足的情况下，他们倾向于保持谨慎，不会立马入局。\n\n而对于任天堂等一众IP的所有者，他们对链游的态度则更加开放，入局的成本不高，只需对自己的IP进行授权，在合理的范围内保证IP的价值不会受损。\n\n### **W Labs瓜田实验室：链游要脱破加密圈的瓶颈去获取新用户**\n\n链游如何吸引新用户，我认为分为两个阶段。\n\n目前玩链游的百分之95以上都是加密圈玩家，只能用加密圈的方法来获客。而下一个阶段，谁能率先把Web2的玩家以一种他们熟悉的方式和路径引进来，谁就是下一王者。\n\n我们在帮助传统游戏厂商做链游时，无一例外的强烈推荐他们设计这样一种路径。先让用户进来体验游戏，等大家自己发现这里还有另外一批玩家，花钱买了一种像皮肤一样的NFT，换上这个皮肤之后就可以赚钱，他们就会非常积极地去研究怎么入金，怎么安装钱包。\n\n### **W Labs瓜田实验室：目前基于代币模型为主体打造的链游经济模型，迟早会陷入死亡螺旋。**\n\n2020年爆火的Axie创造了P2E，也就是GameFi的新模式，他将链游带进了大众的视野，让人们发现区块链新应用场景的潜力。但这只是链游的一小部分而已，在我看来，目前基于代币模型（token-economics）为主体打造的链游经济模型迟早会陷入死亡螺旋。这不是我个人单方面的武断，是我用行为金融学和数据对链游经济模型进行分析验证，所得出的结论。大家可以参考我们的《链游经济模型大揭秘》的第一篇文章。\n\n但大家不必过分担心，哪怕GameFi没有未来，链游也有未来。瓜田为帮助链游回到一个游戏正常的生命周期，提出了三种思路。\n\n1. 让链游好玩起来，好玩到让加密世界的玩家有动力为了这个游戏开始氪金了；\n2. 把目前的模型机制由代币经济学为主导，转成资产沉淀性更强而流动性更差的NFT经济学为主导；\n3. 把场景扩大开去，比如元宇宙场景，链游只是元宇宙场景中的一个环节，链游生命周期还受到整个元宇宙中其他兄弟场景的支持。\n\n文章链接：<https://mirror.xyz/iamwgg.eth/njmPWdQxdCgOM54srB7T5kcEanlxZUFLBmGHBkYlXdY>\n\n### **W Labs瓜田实验室：成功的链游的核心在于要让玩家找到游戏的爽点**\n\n原来我觉得Thetan Arena让人眼前一亮的是，它对普通Web2用户的门槛极低，大家都可以进来玩。现在它慢慢走下坡路，我认为核心问题是可玩性不高。去年大家都涌进来玩链游，是因为真的很赚钱，而现在到了熊市，游戏既不不好玩又不赚钱，自然就留不住玩家了。\n\n项目方进来赚钱，投资方进来赚钱，老玩家进来赚钱，新玩家进来赚钱。那到底谁亏了呢？大概率就是新玩家。如果大家都抱有这个共识，那就是比谁跑得快，进一步加速死亡螺旋。\n\n链游成功的核心在于要让玩家找到游戏的爽点，普通玩家越多，氪金玩家越来越爽，这样的模型才是合理的。而不是像现在的链游，不能让所有的玩家都抱着赚钱的目的。\n\n### **Vincent：赌徒心态的受众和不稳定的盈利模式，决定了链游质量的泛善可陈**\n\n首先我认为Crypto Gaming，先是crypto，然后才是gaming，否则的话他应该叫gaming crypto。其次gaming在英语里有两层含义，一个是游戏，一个是博弈，而大家要认识到本质上crypto从业者或参与者的第一性都是赌性。既然我们都有着不同程度的gambler的心态，那么对于这样的受众来说，只有产品的金融属性足够强，才能吸引到足够多的人来玩。\n\n说到游戏的可玩性，传统的游戏已经把游戏的可玩性做到极致了。游戏厂商开发游戏的最终目的也是为了钱，发行商的职责是找到流量然后销售产品，属于一锤子买卖。那为什么他们还需要做一个复杂的做市商模型呢？如果利润要从做市商里来，就会受很大的牛熊周期的影响。而游戏是一个消费品，游戏业界中一个高质量的产品在正常情况下能赚到的钱，难道不比在链游里赚的多的多吗？这是一个非常现实的问题。\n\n链游的盈利模式和他的受众决定了他的质量就是二流三流甚至不入流的，可玩性不高也是必然的。\n\n### **Vincent：链游一定是传统游戏的下一个阶段吗？**\n\n链游所在的科技树真的是游戏的下一个阶段吗，或者是我们传统观念里play for fun的游戏的下一个阶段吗？不一定。\n\n我认为链游的技术进步是相对于捕鱼游戏、轮盘赌之类的现金游戏而言的，它为赌狗们创造了更沉浸式的赛博空间，获得一种更微妙的博弈体验。\n\n如果问传统厂商对链游的看法是怎样的，就我们在东南亚接触到的传统厂商的外包商来看，大量涉及到链游或者NFT的游戏博文下，都是硬核用户群在吐槽游戏的可玩性不高，毫不关心能在游戏里获得多少收益。但他们不在乎，东南亚人在乎，后者愿意为了翻身的可能性在里面花上一点时间，这是一种广义的博弈心理。所以链游在我看来是一种赌博的赛博化，广义的gaming的升级版，而不是传统游戏的升级版。这是我个人的想法，给大家提供参考。\n\n### **Weijun：链游的现状在于缺乏优秀生产力和形成差异化的创新**\n\n造成目前链游的困境，我认为主要是优秀生产力没有入局，也没有好的生产工具，目前链本身的发展也不太能支撑游戏的运行。现有的链游几乎都还是运行在中心化的服务器上，只是把玩家的资产上链，并且还不是实时上链。\n\n另一个原因是，头部厂商会更加看重自己的形象和口碑，不会轻易冒险。入局的都是外包团队或大厂出来的员工的创业公司，生产力无法与之相提并论。\n\n另外，链游要和传统非上链的游戏要做出差异，要有差异化的核心玩法。而现在我们所谓的区块链游戏都是广义上的RPG向的，以积累财富为主。核心框架难以做出创新，人才和生产力都紧缺，也就形成了链游的现状。\n\n未来如何变得更好，我期待未来头部厂商的入局，另一个是我希望游戏还是它原本的样子，区块链作为纯粹的技术让我真正拥有我的资产的所有权，这个方向是我认为更接近区块链游戏的形态。\n\n### **修桑：希望未来链游能更多地让玩家掌控自己的资产，提高资产流动性**\n\n我很排斥部分游戏产品，项目方也就是游戏公司有意地控制玩家之间交易，对交易的次数、生产资料的交易进行严格地限制。作为一个玩了半年多链游的玩家，我看到许多大家不喜欢的链游，玩家资产的流动性不好，是真的没有收益，玩家的驱动力也就减弱。所以希望未来能看到更多这样类型的产品出来，让玩家的卡也好，装备也好，有更好的流动性。\n\n**免责声明**： CIG所提供的资讯信息不代表任何投资暗示， 本站所发布⽂章仅代表个⼈观点，与CIG官⽅⽴场⽆关。", "timestamp": 1655354733, "digest": "qmLm4bPz8TiZq-7FJR_wAgmBja8_JwIABJjimHPu3xs", "contributor": "0x78e90792056085600256dF323A0D79F1704978c2"}
{"id": "hjGm1XsElyeIvWzgVlFc6hUIv2yZgBaEdvOGqK-X2Qo", "title": "加密世界的新趋势", "body": "这一轮牛市是否已结束？\n\n其实没有必要去较真牛市熊市周期，大家看看微信群的情绪就可以看出，大潮又退去。币价暴跌，大名鼎鼎的三箭资本、加密公司celsius均面临清算危机。所谓长江后浪推前浪，前浪过后，市场便迎来下跌+震荡的无聊行情。\n\n回顾这次牛市行情，由dot生态崛起开篇，再到fil挖矿起飞，再到chia挖矿把硬盘价格拉上天。\n\n同时，由于疫情的原因，一些东南亚国家兴起一阵链游玩赚风。2018年上线的axie成了风口的猪。大量菲律宾玩家专注玩赚，使axie从“出圈到进圈”。这边的axie还没凉完，NFT浪潮又迎面而来，CryPto Punks、无聊猿、红豆、月鸟等等各种头部NFT给币圈带来新型暴富模式。\n\n此外，玩赚又演变出来新花样，move to earn，龙头便是Stepn，全民跑赚时代开启。\n\n然而，历史总是惊人的相似。dot生态在月河链之后就熄火了。Fil与Chia挖矿最大的得利者，还是卖硬盘和矿机的人，散户终是接盘者。Axie产出的Slp币价起起落落落落落的同时，官方还在一直调低收益。NFT市场交易水分不要太多，大部分交易都是倒手、刷量、虚拉价格营造出繁荣假象。至于Stepn，大量接盘玩家还在回本的路上跑断腿。\n\n不得不说，加密世界永远不会太无聊，哈哈。\n\n回顾完毕，那么机会在哪里？\n\n**个人认为，下一轮加密趋势，在于应用。**\n\ndot生态、链游、fil\\\\chia挖矿、NFT，它们的共有特点是，落地应用非常弱。\n\n公链生态大部分还是金融产品，受经济周期与世界大国经济政策的影响很大，简单来说就是牛市很赚钱，熊市都凉透。\n\nfil\\\\chia挖矿虽然有数据储存功能，但目前还是挖矿居多，供过于求，大部分容量都是垃圾数据，赚钱的还是上游硬盘商家，散户或者生态内用户送人头。\n\n至于链游，大部分模型还是抄袭阿蟹双币机制，玩家不停从生态内吸血，都是玩了赚，赚了跑，要么玩了不赚，上了套。无法形成持续玩赚的良性循环。\n\n到了NFT，目前的JPG类NFT占主流的市场，其实NFT一无所用。即使演变成NFT PASS也就是相当于会员权证而已，没有实用性，更别提对生态有什么助益。\n\n所以，与其在伪需求上争夺，咱们应该把眼光放在应用之上，实打实的应用才是长远之道。\n\n**什么是应用？**\n\n就是用户使用的功能性产品，例如用来听歌的app、用来通讯的app\n\n人的需求很简单，生存、娱乐。解决了生存温饱问题，我们就会有各种各样的娱乐需求，每个人的兴趣爱好不一样，满足这些需求的产品都是优秀的应用。\n\n在Web3，很少项目在认真做落地应用，大部分都是做金融，质押挖矿、玩赚、NFT，都在做赚钱的事情，生命周期不长，走不远，熊市来了要么币价崩，要么被清算。\n\n而不管牛市熊市，我们都有听歌需求，都有与人交流的需求，都有展示自我的需求。简单的一款听歌app、通讯app甚至是社交平台，不一定涉及赚钱，但一定用得上。而且，这样的平台，牛熊保收，肯定走得越来越远。\n\n**既然应用类这么香，为啥少人做？因为流量！**\n\n赚钱项目之所以多人做，主要还是拉人头容易，流量来得快，时间短见效快赚钱迅速。\n\n应用类项目，非常吃流量，本身不太具有赚钱效应，更不可能拉人头，只凭产品优秀体验慢慢累积用户确实开局比较难。\n\n所以，它们要花式引流！\n\nWeb3本来就是一个新领域，涉足的人比较少，真正的用户非常稀缺，项目间的合作能一定程度上获取流量。\n\n如果想获取大量相应领域的流量，必须得出圈引进。\n\n例如，一款Web3音乐类应用，应该从圈外引进更多的听歌用户，而不能只盯着Web3的存量用户。毕竟在Web2的世界，已经有非常多的音乐巨头坐拥数千万用户，比整个币圈的用户量都要大。将Web2的流量引进Web3应用，既能使原生应用突破Web2内卷的瓶颈，又可以把优质流量输入Web3，两全其美。\n\n目前走这种路线的项目不多，音乐行业里有一个，我也在密切关注。\n\n**Web3应用之夏即将到来，你将押注哪个？**\n\n笔者：肥仔杰\n\n推特：feizijie01\n\nVX：lanjiejiang", "timestamp": 1655354969, "digest": "_rV7o6aYV9IeKhf8mJUUaT_-1rijyU0nRta8oCj9JaA", "contributor": "0xdfDC5082621389e80DE9954809Af70d67b9Ce105"}
{"id": "HkMCOLYrGFql5LdoR67qNWaeiVZolfvw8kH6oqmznOo", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655354823, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "HsidA2dnrQn0dnUZPSmiefuJHw-tjEr4J_h9tuYpR6o", "title": "凌晨加息后BTC&ETH双双上涨 资金增加 谨防上月先涨后跌 — 2022.6.16", "body": "### \n\n \n \n\n当前总结：今天凌晨两点美联储宣布加息75，市场上并没有太大的反应，美股和币市都在小幅度的震荡，在鲍威尔讲话的时候美股甚至出现了抹平上涨空间的局势，但是随着鲍威尔的越来越鸽派的发言，美股开始上涨，而币市也跟随上涨，甚至是DXY都在跟着下跌。但还是需要稍微注意一下，上个月的加息也是这样。\n\n宣布加息50后，市场觉得美联储是在抵抗通胀，所以当天上涨的不错，币股双涨，DXY和美债双跌。但是第二天美股开盘的时候开始出现了较大幅度的下跌，是因为市场消化了50个基点信息，并且大量的资金去购买美债，导致了资金不足，凌晨在公布了加息后美债也是出现了较大的下跌（说明购买的人多）。\n\n而目前的情况是，DXY和美债都开始转涨，3年5年和7年的国债都和10年国债倒挂，说明情绪在开始酝酿。尤其是DXY已经回到了150的上方，还是需要小心一些。毕竟75个基点的加息是美股自1994年以后的首次，对于资金的压力还是较大的。\n\nTwitter @Phyrex_Ni\n\n截止到今天上午8点50分的BTC持仓价格分布，经过美联储的加息政策变动后BTC的链上波动稍微的收敛了一些，两边的极端价格中可以看到远古持仓的筹码在减去昨天的增加部分后，整体的波动在3,000枚BTC左右，而高位套牢的筹码之所以放大是因为出现了单一区间的大笔移动，但并不像是用户的行为。\n\n而且40,000美金到50,000美金区间的亏损BTC出现了较大幅度的衰减，这也和预料中的一样，随着对于当前价格的接受，该跑的都已经跑了，剩下的不是在赌反弹就是在赌下个周期，而留在散户手上的筹码必然是越来越少，35,000美金上方的亏损筹码也出现了稍微示弱的表现，而作为抛压主力的29,000附近的筹码。\n\n也同样出现了减少的趋势。整体的流动性已经从周日开始的恐慌趋向于平静，从数据来看，最大规模的链上转移和抛压已经结束，随着时间的推移，链上的波动开始平复，对于资金的压力也在开始减少。从交易所的转入和转出的数据来看，转入交易所的抛压确实在下降，而转出交易所的提现虽然也在下降。\n\n但超过了抛压数量，说明购买力相对于前一天有所提升。从资金层面来看，确实如此，截止到今天早晨八点的资金信息显示不论是USDT还是USDC都有了较大幅度的提升，但是这次的提升和昨天BTC几乎击穿20,000美金以及ETH差点击穿1,000美金不无关系。即便是现在都可以看到成交量相比昨天同期提升了20%以上。\n\n而从最近24小时的资金细节数据分析，发现USDT确实在美股开盘的阶段，以及美联储宣布加息后有了较大的波动，而USDC的主力资金却仅仅只有在美股开盘的附近出现了较大幅度的转移，而对于美联储宣布加息以及鲍威尔讲话后都没有太大的反应，这也是需要值得注意的，说明欧洲人还是挺看好这次加息的结果。\n\n从日线的交易所存量来看，在今天早晨八点前，交易所的存量BTC是在减少的，但是切换到目前的细节数据可以发现，随着BTC价格的上升，今天上午开始交易所出现了较大的新转入抛压，致使存量的BTC开始上升，说明更的筹码准备在上升的阶段离场，这种情况下如果保持上涨则不会出现太大的问题，而如果下跌则有可能将挂单直接变为抛压，在市场中砸盘。\n\n从目前的BTC永续合约的数据来看，资金费率继续处于大面积看空的趋势，单纯的从数据层面来看，已经是较好的建仓情况了，和昨天一样，但是为了防止今天晚上美股开盘后有可能出现的变局，应该小心为上。尤其是未平合约的走势，出现大幅的被动减持。\n\n截止到目前BTC的四个主力持仓近一周的情况 \n 鲸苗（持仓10–100枚BTC）今日小幅减持 \n 幼鲸（持仓100–1K枚BTC）今日小幅增持 \n 巨鲸（持仓1K-10K枚BTC）今日小幅减持 \n 超级巨鲸（持仓10K-100K枚BTC）今日大幅减持，超级巨鲸中包括头部交易所的地址 \n 目前持仓量小于10枚BTC的散户都在增持\n\n更多的BTC还是流入到了终极巨鲸的手上，昨天就有小伙伴问我，这是什么程度或者什么样的持仓者，目前还不好说，但是MS应该是其中的一个，毕竟需要持仓超过100K枚BTC，而这个位置是不太可能出现交易所的，毕竟对于交易所来说都放在一个钱包里，并不安全。", "timestamp": 1655354883, "digest": "WJyzfLOtRW773X8ifjqxROTwax4y7mn_SRkMFgSbKZg", "contributor": "0xdDa424d9bB3140bE68b0AAadCaf7CADf7c36A046"}
{"id": "nE7oB-K_eADDdZ3Xwo2WGuUR_W9YQ1h85z4rnzUmZ2M", "title": "mirror", "body": "mirror", "timestamp": 1655354824, "digest": "NEBRdxfKtqCIL_tAIYCVCilC5rDYUv8yu8jlOHn8vqE", "contributor": "0x6B0D6d4BC75cf4f7c251B292786B34AB95AdA16f"}
{"id": "p7xaYckhp6UV_IzoE4h2gZIMc8c77-uIbNSO5i1mw3o", "title": "mirror", "body": "mirror", "timestamp": 1655354689, "digest": "tey4TenlzmXnlrZ9hfNxHB0HsPiFAZ_bDRJU2RkRTYs", "contributor": "0xe7f96f45EA2232C7D55F57657E11EE97fcB6a814"}
{"id": "QFcIbtPZUiYmCA6sR1ILWCZMzTdCjRLIP28SUMOS1bw", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655355044, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "qkEPd1WdVrxr02EHGf1FBRH3J23t3Gw-9--rFmbDMHI", "title": "Git over ipfs", "body": "* 理解 ipfs 的结构\n* 理解扩展 git\n\n  [https://juejin.cn/post/6854573210068287501](https://juejin.cn/post/6854573210068287501)\n\n* 理解 ipfs gateway\n* 熟悉 web3 工作流\n* ", "timestamp": 1655354942, "digest": "vEYab7fh9DMm94KROH5Sv9UH9fszK1S7PlT7d6A8wIk", "contributor": "0x3c73E3CFB07af745d2768Ca42Be7aa80E391F860"}
{"id": "VYXgvorWC3C-aOqQgT58tEMBTkDctTb3kNd8CRUCgxo", "title": "VICOIN-加密KOL ：熊市有 3 个阶段，我们刚刚进入第二阶段", "body": "加密OG 是如何看待熊市？\n\n随着价格暴跌，所有人都相信我们正身处熊市之中。这篇文章，来看看加密OG 是如何看待熊市，以及告诫人们不要放弃希望离场。\n\n熊市有 3 个阶段。我们刚刚进入第二阶段\n\n### 第一阶段：轻松\n\n**牛市带来的兴奋（和贪婪）仍然存在**。每几周都会出现一次小型叙事，资产并没有大量撤出。 虽然估值被下调，但公司不会做出艰难的决定（淘汰产品、裁员），事情似乎还好。\n\n**第一阶段并不感觉是一个熊市，让人感觉是价格已经跌回到真实的估值**。投资者继续分配资金，建设者继续建建设。行业一切都感觉欣欣向荣，只有胆小鬼才会选择卖出。\n\n### 第二阶段：被迫清仓\n\n这时形势开始变得严峻起来。叙事消失，价格下跌90%，各种项目开始全面裁员......主流媒体和第一阶段卖出的人会在这时开始冒出来，嘲笑着说道：“我告诉过你熊市已经到了！”\n\n**Luna 将我们送入第二阶段**。在第 2 阶段，钻石手也被强迫出售，他们卖出不是因为他们想要，而是因为他们必须这样做。\n\nCelsius不想卖——他们可能不得不卖，将来会有更多像Celsius这样的基金、公司和个人。\n\n在第 2 阶段，任何反弹都会立即被砸下去，想要离场的人太多了。那些在高价格接盘的公司将被压垮，那些购买自己的代币来维持他们的项目的创始人……他们也会被压垮。\n\n**价格越低，空头的声音就越大。空头越大，价格越低**。这就形成了一个恶性循环。 在第二阶段，价格剧烈暴跌，兴奋被愤怒取代。\n\n### 第三阶段：无尽的绝望\n\n**在最大的痛苦之后是最大的绝望。没有反弹，没有叙事。价格横盘整理或缓慢下跌，这很无聊**。\n\n在底部，愤怒被沉默所取代。\n\n在第 3 阶段，你会想着离开这个行业。当我们情绪低落时，监管者也会嫌弃我们，你最喜欢的 Twitter degens 会安静下来，Web2 投资者将悄悄停止资产分配，有才华的建设者会离开，公司将关闭，你会质疑你的每一个假设。\n\n第三阶段是最难生存的阶段。如果您是一家公司，请尽一切努力度过难关，如果您是建设者，请保持兴趣，寻找其他建设者，与他们一起努力。如果您是投资者，请制定自己的计划与观点，去赌你相信的人。\n\n**不要忘记大环境**。我们正在建立一个开放的、无需许可的世界。这将需要几十年，而不是几年。\n\n关上电脑，出去散散步，当你开始建仓的时候要更加谨慎，反复问自己为什么要去建仓。但最重要的是，不要放弃。\n\n【welcome to join us】 \n WeChat1：victeam005 \n WeChat2：shijie20170405 \n Telegream：[https://t.me/VICOINDAOCHAT](https://weibo.cn/sinaurl?u=https%3A%2F%2Ft.me%2FVICOINDAOCHAT) \n Twitter：[@VICOINDAO](https://weibo.com/n/VICOINDAO)...\n\n \n ", "timestamp": 1655354857, "digest": "4qgE5YnCUAJzkJnktzgx9DtCwRQacSpEfZtIqCWsfDY", "contributor": "0xf6e546668c397dcb64767efe331904Ba147D5025"}
{"id": "-0qbKtb2ZBviws1V0iuPZiAYYX30JY4hY7Q8HhaM5jA", "title": "Guide for Gitcoin Grants Round 14", "body": "## Introduction\n\n[Gitcoin](https://gitcoin.co) is a community where public goods developers can earn funding in Web3 while creating open-source, decentralized applications. Many early projects use the platform for crowdfunding their project development and operation cost.\n\n> Note that SyncSwap is not on GR14 currently.\n\n## Rules\n\nCurrently, [Gitcoin Grants Round 14 (GR14)](https://gitcoin.co/blog/gr14-announce/) is ongoing and will accept donations until **June 23**. You can choose to donate to different projects on the Gitcoin website.\n\n## Getting Started\n\n### 0 - Create Github Account\n\nIf you have never donated and don't have a Github account, please visit <https://github.com/> to create one.\n\n### 1 - Sign in to Gitcoin\n\nGo to <https://gitcoin.co/> and sign in with your Github account.\n\n### 2 - Maximize Your Impact\n\nTo maximize your donation impact, you have to complete several verification procedures to bring your trust bonus up to 150%.\n\nYou can do this at <https://gitcoin.co/profile/trust>.\n\n> Why maximize your impact is important?\n>\n> In Grants Rounds (GRs), your donation will be able to match extra funds from the **Matching Pool**, the amount you matches will depend on your impact.\n>\n> Thus the project you donated can receive additional funds from your contribution!\n\nHere are some recommended verification methods for you:\n\n* **SMS / Google / Twitter / Facebook** (+15% each)\n\n  These social media verification methods are relatively easy.\n\n  Note that you need 100 followers for the Twitter verification, and you can skip it if you don't.\n* **POAP / ENS** (+25% each)\n\n  You can verify by simply inputting your wallet address if you have a POAP or ENS.\n\n### 3 - Start Contribute\n\n*Well done!* Now you can start to donate your favorite projects. Explore them on\n\n[https://gitcoin.co/grants/explorer/](https://gitcoin.co/grants/explorer/)\n\nLet's have an example.\n\nOnce you found a grant that you are interested in. You can click the **Add to Cart** button on the right side of the page, to add the grant to your cart.\n\n![Add to Cart](https://images.mirror-media.xyz/publication-images/WnueLIyy15f51zP_oRqLk.png?height=300&width=800)\n\nAnd you can enter the checkout by the cart button at the right top corner of the website.\n\nYou can choose your desired amount and currency to contribute in the **Amount/Currency** section.\n\n![Choose amount and currency](https://images.mirror-media.xyz/publication-images/XIUhgGl9kynD3x3fopQuR.png?height=300&width=800)\n\n> **Your Total Contribution** is an estimation of how much the project will receive from your contribution.\n>\n> You only need to pay the **Matching Pool Contribution + Grant Contributions**.\n\n![Checkout](https://images.mirror-media.xyz/publication-images/ZEm7_-FJ94diIVILuiZen.png?height=500&width=800)\n\nTherefore, you can choose the network to check out. We recommend **zkSync (1.0) or Polygon** to lower the gas cost.\n\nAnd you should be successful in contributing!\n\n*Congrats!*\n\n![Thank you](https://images.mirror-media.xyz/publication-images/zcbCH-9bfHykh_Yc0Kf0j.png?height=409&width=942)\n\n## Join the Journey\n\nSyncSwap is building a powerhouse among ZK communities. It’s the time to join us and be a builder!\n\n* Join the SyncSwap [Discord Community](https://discord.com/invite/6zy2c9YdEm).\n* Keep up-to-date with [SyncSwap Twitter](https://twitter.com/syncswap).\n\n## Thanks\n\nThis guide is based on [Mainnet Guide Gitcoin Grants Round 14](https://medium.com/@CalendarDefi/mainnet-guide-gitcoin-grants-round-14-2673e7236cd9) from [DefiCalendar](https://medium.com/@CalendarDefi).", "timestamp": 1655355260, "digest": "lmO6Lf62KrSxQdGc34XszUx9qVUAy8DmJVxzboCCHNE", "contributor": "0x000002c34bAE6DD7BeC72AcbA6aAAC1e01A359De"}
{"id": "2zcRycWfxyp1oBSNM3L23lg_jQ9yvDenjGULbxvgbes", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655355214, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "cI2wKP63CtJ0NJzm5b-oZuKExXEj3YzFUZDQ2IfJZPY", "title": "mirror", "body": "mirror", "timestamp": 1655355176, "digest": "yPibw_R89tQ8svNrgGbravYzq5oa21Aq3ONASL-2o90", "contributor": "0x0a962efC3C461ac50E0985466AbfdA05dfb7A55f"}
{"id": "GOkoD7ONZwJuGrgfM0YaoiF0i0sMt9MPoOTEqmGrnk0", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655355141, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "pwdCiEmlJzl5sUPbMTDgNweuyaAYWWr1AylNb2TLk04", "title": "\nSBT、DID、声誉/信用系统的概念与37个相关项目简介", "body": " \n \n\n[0xEastHash](https://mirror.xyz/easthash.eth)\n\neasthash.eth\n\nSBT、DID、声誉/信用系统的概念与37个相关项目简介\n\n[0x0000](https://etherscan.io/address/0x000000005Ebfb5A950f8fdF3248e99614A7ff220)\n\nJune 14th, 2022\n\n本文信息来源，各类（A16Z/律动等）文章 以及（3，3）社区的大佬们的提到的项目。\n\n信息整理人：[@east_hash](https://twitter.com/east_hash)\n\n文章构成：\n\n1. 《去中心化社会：寻找Web3的灵魂》的文章 及概念\n2. DID、DeSoc、SBT、声誉/信用系统 概念 10个代表项目\n3. DID、DeSoc、SBT、声誉/信用系统 概念 20个可以关注的项目\n4. 7个上海黑客松上的涉及SBT和DID的项目\n\n> 2022年5月，一篇名为《Decentralized Society: Finding Web3's Soul - 去中心化社会：寻找Web3的灵魂》的论文发表，作者是微软首席技术官办公室的研究员Glen Weyl 与 Flashbots 的策略师 Puja Ahluwalia Ohlhaver 以及以太坊的联合创始人 Vitalik Buterin（维塔利克·布特林，国人称他为“V神”）。\n\n### 该论文大致讲了三点：\n\n### 一、Web3当下的问题\n\n1\\.很多NFT艺术家依赖于中心化的平台，比如Opnesea，来解决藏品稀缺性和初始来源的问题；\n\n2\\.很多DAO想超越社交媒体平台(注：比如Discord)依赖于Web2基础设施的简单投票机制，但是这样就没法抵御女巫攻击（Sybil Attack）；\n\n3\\.许多 Web3 参与者依赖于由中心化实体管理的托管钱包，去中心化的密钥管理系统对任何用户都不友好。\n\n### 二、SoulBound Token 的概念\n\nSBT全称是“SoulBound Token”，直接翻译就是“灵魂绑定通证”。\n\nSBT是一种可编程的、不可转让但可撤销与找回的，同时附带可验证信息的通证，类似一份不断扩展的个人简历，通过与其社会关系相关联的钱包进行验证。\n\n这些拥有SBT的账户汇聚起来，就构成了DeSoc这样一个去中心化的社会。\n\n### 三、SoulBound Token 的应用场景\n\nSBT 适合用于建立声誉系统，建立在声誉上的最大金融价值是信贷和无抵押贷款，贷款和信贷额度可以表示为不可转让的但可撤销的SBT。\n\n大多数有价值的数据不一定是个人的，而是人际间的 (例如，社交图谱)，或者只有在聚集在更大的群体时才有价值 (例如，健康数据)。SBT可用于提升数据的价值，用户应该将数据视为私有财产：关于这种互动的数据是私人的，所以用户可以自主选择何时向谁披露这些数据。由此可以解决Opensea这样的中心化平台来解决初始来源验证的问题，也可以实现数据所有权与使用权的分离的功能。\n\nSBT 对于密钥管理手段：社区恢复 (Community Recovery)，其中的“灵魂”是其社交网络的交叉投票。\n\n“社交恢复”方式再生密钥，跟微信、QQ找回密码是同样原理，都是通过其他方式联系到通讯录中的熟人，来帮助自己重新设置密码，找回账号。\n\nSBT还可通过以下方式防范女巫攻击，更好的帮助项目进行治理、或发放空投：\n\n* 计算独特灵魂和可能的机器人之间的灵魂群组关系，并拒绝一个似乎是机器人的灵魂的任何投票权，也可以帮助其他DAOs抵御女巫攻击；\n* 赋予那些拥有更著名的SBT的灵魂更多的投票权或是空投；\n* 检查支持某一特定投票的灵魂（Soul）所持有的SBT之间的相关性，并对高度相关的选民，采用较低的投票权重。\n\n该文章背后的一些概念的衍生：\n\n**Zero—Knowledge Proof - ZKPs** （零知识证明）可以实现让你公开向社会提供某些答案，但同时保持任何关于你自己私人信息。比如年龄、收入等，这些都不能直接给别人看，但很多情况下又必须要验证这些信息。\n\n**Decentralized Identity - DID**（去中心化的身份）由传统的中心化身份衍化和派生出来，指去中介化，个人或组织完全拥有的自身数字身份的所有权，控制权以及管理权，将这部分权利完全归于用户自身。\n\n如果DID（去中心化身份）被广泛采用，人们将能在穿梭不同的网络空间时，随身携带、展示完整的自我：无论在哪一个平台，人们在网络上创造、贡献、赚取和拥有的东西，都反映了他们的喜好和经验。这将使我们更接近物质世界中的运作方式——财产和声誉与我们自身有关，而不是平台，我们可以随身携带、随意使用。\n\n**Reputation System （声誉系统）**，在 a16z 的 Jad Esber & Scott Kominers 文章 《一种基于声誉系统的双代币经济模型 - A Novel Framework for Reputation-Based Systems 》 中提到“如果一个 Token 可以很容易地转移，那么那些没有声誉的人就可以简单地购买它，这降低了 Token 作为声誉信号的能力。” 使声誉 Token 可转让不仅会降低其作为声誉信号的能力，还会削弱其作为有价值补偿的能力。因此，建立声誉资本需要完全（或至少大部分）不可转让的 Token 。那么，问题是如何将声誉转化为流动性。\n\n因此，作者提出了一个双 Token 声誉系统，其中一个 Token ，我们称之为 积分，作为不可转让的声誉信号。第二个 Token 是一种可转让的资产，定期分配给积分持有者。实际上，积分以可用作可交易货币的形式分拆股息。此外，由于 Token 是由积分持有者累积的，因此 Token 也与潜在的声誉有关。\n\n> ### 介绍完概念，再讲一讲目前在这个赛道建设的项目，这里选出了十个对于DID、DeSoc、SBT、声誉/信用系统 具有一定代表性的项目。\n\n* 1.ProjectGalaxy （已有Token）- 凭证数据、DID、任务系统\n* 2.Spruce - DID、去中心化存储、基础设施\n* 3.CyberConnect - 社交图谱、数据、基础设施\n* 4.RabbitHole - 声誉系统、SBT、任务系统\n* 5.NFT3 - DID、声誉系统\n* 6.Noox - 声誉系统、SBT、任务系统\n* 7.Spectral - 信用系统、无抵押借贷\n* 8.UniPass - DID、去中心化账户恢复、钱包\n* 9.Union Finance：信用协议、SBT\n* 10.Sismo - 声誉系统、零知识证明\n\n### 1.ProjectGalaxy （已有Token）- 凭证数据、DID、任务系统\n\n概念解析：\n\nProject Galaxy旨在构建基础设施，以支持开放和协作的凭证数据网络，帮助 Web3 开发人员利用凭证数据来构建更好的产品和社区。作为一个开放的凭证数据网络，它以发放「凭证」的方式为每个地址打上标签，从而实现明确、细分的用户画像标识，如“Uniswap 交易员”、“OpenSea 交易员”等等。\n\nProject Galaxy允许每个开发者使用定制的链上数据创建、分发和游戏化NFT。开发者可以建立自己的忠诚度计划，个人可以发行和申领由他们在链上的成就支持的NFT。\n\nProject Galaxy 通过链上、链下两个维度多个数据源搜集凭证数据，进行网络管理。对于链上凭证，策展人可以提供子图查询或静态快照。在链下，则已与 Snapshot.org、Twitter 和 Github 等数据源集成。\n\n通过这些凭证数据，Project Galaxy 构建了一个基于 Web3 DID（Decentralized ID 去中心化身份）系统 ， Galaxy ID 它标识了用户在Project Galaxy中的身份， 且可以展示与地址相关的用户足迹和行为。\n\n融资消息：\n\n2022-01-25，宣布获得 1000 万 美元融资，Multicoin Capital 和 Dragonfly Capital 领投，Spartan Group、Coinbase Ventures、Binance Smart Chain Growth Fund、Solana Ventures、Alameda Research等参投。\n\nToken：\n\n1\\.价值捕获\n\n开发人员需要使用应用程序模块以及 Galaxy 凭证数据时，以 GAL 作为费用进行支付。大部分费用将归策展人所有，其余部分费用则会收取到社区金库中。开发人员需要通过 Galaxy Oracle Engine 和 Galaxy Credential API 查询我们的凭证数据时，也需要用 GAL 付费。\n\n2\\.用户激励\n\n在其 Token 分配中：前期参与者占比：2%，主要分发给有 Project Galaxy 指定NFT的用户。\n\n用户数据：\n\n截至2022年5月，已有 100 多个合作伙伴在 Project Galaxy 上发起了 500 多个活动，覆盖了300万的地址数。 目前Project Galaxy支持 Ethereum、Polygon、Fantom、Solana、BNB Chain、Arbitrum 和 Avalanche等七条公链。\n\n### 2.Spruce - DID、去中心化存储、基础设施\n\n<https://twitter.com/SpruceID> - 1万关注\n\n概念解析：\n\nSpruce 包含了两个产品，一个是去中心化身份工具包 SpruceID，另一个是用户自主存储空间 Kepler。\n\nSpruceID 能在多条公链上使用，是一个跨平台的身份认证系统，它提供了签名、共享和验证可信信息。Spruce 已经与 Ethereum 基金会和 ENS 合作的登录 Ethereum (EIP-4361)，这是一个开放的标准和新的认证形式，允许用户连接 web2 或 Web3 应用程序，并直接使用他们的钱包钥匙 (不需要电子邮件地址) 控制他们的数字身份。举个例子，用户可以基于 SpruceID 的认证插件使用以太坊账户，直接登录 discord，不用二次信息验证。\n\n在 Kepler 这个去中心化存储网络，它会围绕着用户自身数据「轨道」叠加。在在 Web3 中 s3 储存服务，也能做到 Web2 API 和 Web3 之间的互操作性。Kepler 让用户可以控制存储的关键方面: 从托管、访问到授权。\n\n团队：\n\nWayne 是 Spruce 的首席执行官兼联合创始人。加入 Spruce 之前，他在 Concierge/stat 公司担任首席技术官，之后来到 Consensys（行业顶尖的基础设施公司）历任 Token 工程主管、产品主管、产品管理总监等职位。\n\nGregory Rocco 是 Spruce 的联合创始人。加入 Spruce 之前，Gregory 在 ConsenSys 公司任职业务操作经理，产品策略，Token 工程师（Token Engineer），值得一提的是，在 ConsenSys 的这个平台上，与现在的伙伴 Wayne 共事多次，两人带着 Spruce 项目在顶级孵化器 Y Combinator 进行孵化。\n\n融资消息：\n\n2021-11 ，筹集到 Ethereal Ventures 和 Electric Capital 牵头的 750 万美元的种子资金。\n\n2022-04 ，宣布完成了 3400 万美元的融资，a16z 领投，Ethereal Ventures、 Electric Capital、 Robot Ventures 和 OrangeDAO等参投。\n\n### 3.CyberConnect - 社交图谱、数据、基础设施\n\n<https://twitter.com/CyberConnectHQ> - 6.4万关注\n\n概念解析：\n\nCyberConnect 是一个去中心化的社交图谱协议，为Web3.0社会网络和元宇宙服务。它的使命是将社交图谱数据的所有权和实用性还给用户，同时为所有的Web3.0开发者提供一个基础设施用以整合。Cyber​​Connect 首席执行官 Wilson Wei 表示，目前已有 23 个项目集成了 Cyber​​Connect，还有 12 个项目正在进行集成。\n\n目前，CyberConnect 面向用户直接推出了网页APP，尝试解决用户的社交图谱问题，个人可以使用小狐狸钱包连接。它提供了三个主要功能：关注按钮，检索关注者和追随者名单，以及获得推荐关注者名单。\n\n融资消息：\n\n2021-11-17，宣布 1000 万美元的 种子轮融资，Multicoin Capital和Sky9 Capital共同领投。\n\n2022-05-17，宣布 1500 万美元的 A 轮融资，Animoca Brands和Sky9 Capital共同领投。\n\n用户数据：\n\n截至2022年1月，CyberConnect 的用户数量达到了40万人，总点击量多达2100万次。\n\n### 4.RabbitHole - 声誉系统、SBT、任务系统\n\n<https://twitter.com/rabbithole_gg> - 7万关注\n\n概念解析：\n\nRabbitHole旨在通过游戏化思维，将每个去中心化应用分解为游戏任务，引导用户与区块链协议、去中心化应用进行交互，培育DeFi用户的使用习惯，同时用户的 Web3 操作和行为还将获得「认证」。\n\n通过管理用户以前的成就的链式图表，Rabbithole正在为未来的工作创建链式简历，并成为在Web3中寻找贡献者和发现工作的最佳场所，以及加密项目找到适合他们协议的最佳参与者，并轻松地引导他们的社区——从发现、入职、培训到规模。\n\n今年3月，RabbitHole宣布发行冒险勋章NFT，作为一种链上凭证，该NFT允许用户在应用程序中展示自己的技能和知识，并被设计为不可转让的SBT，这保证了任何带有探险徽章的钱包实际上完成了徽章所代表的技能。\n\n融资消息：\n\n2021-06，宣布完成360万美元种子轮融资，Electric Capital、ParaFi Capital、Framework Ventures等参投。\n\n2022-02，宣布完成1800万美元A轮融资，由Greylock与TCG Crypto共同领投。\n\n用户数据：\n\n截至2022年6月，新版关于DAO/DeFi/NFT 约1万地址。冒险勋章NFT 约4.94万地址。\n\n### 5.NFT3 - DID、声誉系统\n\n<https://twitter.com/NFT3com> - 4千关注\n\n概念解析：\n\nNFT3是一个用于Web3和元宇宙门户的去中心化身份和信用网络，设计了一个质押激励模型以应用于身份问题。它创造了Web 3.0中个人直接货币化路径，并为 Web 3.0 应用程序的复合级创作和创新提供了基础设施组件，它可以将用户条款价值与他们在不同项目、社交网络、公司和机构的生活中的数据联系起来。NFT3利用DID创建了Web3护照平台，并将创建用户个人信用评分系统。\n\nNFT3将允许用户创建一个统一的身份，然后他们可以将其与任何 Web 3.0 应用程序相关联，以此解决虚拟身份的基本问题。这是通过创建用户拥有的 NFT 并将其包装在 DID 或分散标识符中来实现的，这些标识符可以在网络上传播，但始终返回到所有者的 NFT3。\n\n除了基于 NFT 的 DID 身份，NFT3 也将构建一个基于用户绑定的社交账号信息和多链地址信息的精密信用评分系统，称为 NCredit。用户的 NCredit 分数则反映了他的个人可信度——分数越高，用户越可靠。同时，NFT3 用户将在很多地方享受更高信用评分的好处，例如：\n\n1. 链上治理中更高的投票权重\n2. 借贷时降低利率\n3. 贷款时抵押贷款利率更高\n4. 参与 IDO 时的优先级和更多配额等。\n\n融资消息：\n\n2022-02，NFT3完成750万美元种子轮融资，Animoca Brands领投，DFG Group, CMS Holdings, LD Capital和Prometheus Labs Ventures参投。\n\n### 6.Noox - 声誉系统、SBT、任务系统\n\n<https://twitter.com/noox_world> - 1.1万关注\n\n概念解析：\n\nNoox 是一个供 Web3 用户基于链上操作铸造徽章的平台，允许任何人将任意规则编程到徽章标准中(例如交互数量、交互金额、交互类型)，并允许其他人在符合条件的情况下领取它们。这些徽章将是无法转让的SoulBound NFT ，支持任何人将链上交互标记为属性或成就。通过简单的徽章格式，用户将能够轻松地证明他们在链上的互动、参与和贡献。\n\nNoox认为，钱包地址中的数据是为用户在 Web3 上的生活创建真正的数字身份的关键，用户拥有的 NFT 就是唯一的标识符，用于指示他在加密和 Web3 中的属性、兴趣和成就，并作为他们的链上身份来解锁新的机会，其他应用程序和协议可以本地集成徽章并推动开放式创新。\n\n融资消息：\n\n2022-04，宣布完成200万美元种子轮融资，Collab+Currency 领投，Electric Capital、Sfermion、SamsungNext、POAP和 Alphanonce 参投。\n\n### 7.Spectral - 信用系统、无抵押借贷\n\n<https://twitter.com/SpectralFi> - 9千关注\n\n概念解析：\n\nSpectral是一个可编程信誉协议，通过信用风险分析促进链上的资本效率。作为一个完全可编程和可组合的金融基础，Spectral的信用评分允许无许可执行现有金融应用程序，如信用委托和证券化债务，并为利用链上交易历史建立用户信用的创新实施奠定基础。\n\nSpectrum的第一款产品代表链上信用的MACRO（多资产信用风险预言机）评分，基于链上借贷历史、清算历史、欠款和偿还金额、信用组合和信用历史长度，为贷款人提供了一种改进的机制来评估借款人风险。\n\n同时，Spectrum 引入了代表用户链上交易历史的不可替代信用 (NFC) 概念，NFC 允许用户捆绑钱包并将其链上交易历史同步到单个可组合资产 (erc-721)。MACRO 分数与 NFC 配对可产生一种新的可编程信用资产类别框架，作为可组合资产的链上交易历史在整个 web3 生态系统中引入了一种超越金融应用程序的新原语。\n\n融资消息：\n\n2021-11，宣布完成675万美元融资，Polychain Capital领投，Galaxy Digital、ParaFi Capital等参投。\n\n### 8.UniPass - DID、去中心化账户恢复、钱包\n\n<https://twitter.com/UniPassID> - 1.2万关注\n\n概念解析：\n\n基于 Nervos CKB 打造，为 Web3 用户搭建去中心化数字身份 (DID，Decentralized Identity) 的协议。\n\n商业模式：\n\n1\\.MetaMask 的手续费模式：当你的应用有了足够多的用户数量、支付以及应用场景时，收取一小部分手续费就能为应用带来可观的收入。\n\n2\\. 高级服务付费：当用户数量达到一定规模后，就会有高级用户需求，比如权限管理、定制身份等。UniPass 可以针对这些高级功能类型向用户收取年费。\n\n3\\.XaaS 的 2B 模式：这是针对其它应用可能存在的定制服务需求，UniPass 面对的不仅是个体用户，更多的是应用级别的使用场景。\n\n### 9.Union Finance：信用协议、SBT\n\n<https://twitter.com/unionprotocol> - 5千关注\n\n概念解析：\n\nUnion Finance是部署在以太坊和Arbitrum上的一个信用协议，它使任何地址都能够以一种无需许可、加密原生的方式在链上积累信用额度，从而将信用协调为可用信贷的成本，为信誉良好但没有大量资产可用于抵押的DAO或个人等提供了借贷敞口，提升了资金的流动性。其代币UNION是使用Union协议获得的不可转让的SBT，不能被购买或出售，只具有治理权。\n\n融资信息：\n\n2020-12，宣布完成300万美元融资，投资机构包括Placeholder、1kx、CoinFund、Distributed Global、Spartan Group、Variant、Scalar、Defiance、Infinite Capital等。\n\n### 10.Sismo - 声誉系统、零知识证明\n\n<https://twitter.com/Sismo_eth> - 1.2万关注者\n\n概念解析：\n\nSismo 通过使用零知识证明向用户的其他帐户（如 ENS 以及 twitter 或 github）颁发徽章（NFT）来建立其以太坊个人资料，并且用户可以在保密的情况下将其声誉汇总到公开资料中。这种方法很新颖，因为它展示了零知识证明如何在下一个加密领域发挥作用。\n\n应用场景：\n\n用例 1：匿名证明持有NFT，访问持有者社区\n\n使用 Sismo，您可以在您在 Twitter 上分享的 .eth ENS 名称上创建一个 ZK 徽章：“Cryptopunk 的所有者”，而无需透露使用哪个 Cryptopunk 以及哪个以太坊帐户（及其完整历史记录）来证明所有权。\n\n然后，您可以使用这个标准化的 (ERC1155) ZK 徽章来访问令牌门控社区（例如私人不和谐频道，使用我们的朋友在guild.xyz或collab.land构建的服务）。\n\n用例 2：DeFi 分数\n\nSismo 还将提供定制的、更复杂的徽章。DEX 交易者可以从多个私人交易账户中将“DeFi 分数”ZK 徽章铸造到他们的主要链上交易账户。\n\n这个 DeFi 分数将是他们所有交易数据的聚合和计算的结果，例如“未清算的贷款总价值”。\n\n您以后可以使用此证明以更好的借款利率获得抵押不足的贷款，因为您证明了自己的可信度——仅此而已。\n\n用例 3：更好的治理\n\n对于 DAO，它也是一个很棒的工具。以 Aave 社区为例，您可以通过 Sismo 铸造一个 ZK 徽章：Aave 社区成员对应于“持有 > 100 AAVE”、“投票超过 10 个提案”或“创建提案”»。\n\n您可以通过在 Twitter 上显示您的 .eth 名称、提议时在 Aave 治理论坛上或在自定义快照投票策略中使用它。\n\n更多信息：\n\n[Please Wait... | Cloudflare](https://blog.sismo.io/what-is-sismo-part-1-zk-badges-73e7031bacda)\n\n[Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.](https://blog.sismo.io/what-is-sismo-part-1-zk-badges-73e7031bacda)\n\n[blog.sismo.io](https://blog.sismo.io/what-is-sismo-part-1-zk-badges-73e7031bacda)\n\n## 附录1：SBT、DID、声誉/信用系统概念可关注的更多项目（20个）\n\n1\\.Context - 社交、NFT信息流\n\n概念解析：\n\nContext 的愿景是为Web3创建一个社区驱动的Context层，允许用户通过类似Web2时代社交媒体的信息流监控其他人的钱包和交易。它还发布了产品的新版本，可以帮助用户自动找到与他们在Twitter上关注的人相关联的钱包。\n\n目前 Context 前端的核心功能较少，也就包括了查看信息流、搜索以太坊账号、关注、收藏、筛选等功能。\n\n融资消息：\n\n4月14日，宣布完成1950万美元种子轮融资，本轮融资由Variant Fund和OpenAI首席执行官Sam Altman领投，Dragonfly Capital等参投。\n\n2\\.Layer3 - 声誉系统、任务系统\n\n概念解析：\n\nLayer3 是一种协调、追踪和奖励贡献者的机制，提供了赏金市场，补充 DAO 工具包中缺失的部分。用户可以通过发布推特内容或重新设计前端等贡献，赚取治理 Token。\n\n通过这种方式，任何人都可以为 DAO 做出贡献，这些贡献在链下和链上都能被跟踪。最终，随着时间的推移，最好的用户拥有更多可以追踪的数据点。\n\n融资消息：\n\n2022-09-30，宣布完成250 万美元的种子轮融资。本轮投资由ParaFi Capital 领投，Electric Capital、Lattice Capital、6th Man Ventures、Red Beard Ventures 和 Mirana Ventures 也参与其中。 天使投资人，包括 Balaji Srinivasan、Synthetix 的 Kain Warick 和 Rari Capital 的 Jai Bhavnani，也支持了这一轮。\n\n3\\.ShowTime - 社交图谱\n\n概念解析：\n\nShowTime 用NFT建立一个开放的社交图谱。他们帮助收藏家展示NFT，并发现正在崛起的创作者。最终，每一个内容都将是一个NFT，Showtime的目标是成为它的主要社交媒体界面。\n\n融资消息：\n\n2022-05，宣布完成760万美元种子轮融资，Paradigm领投。\n\n4\\.Lens Protocol - 社交图谱\n\n<https://twitter.com/LensProtocol> - 7.3w关注者\n\n概念解析：\n\nLens 是一个搭建在 Polygon 上，具有开源、可组合性的去中心化社交媒体底层协议（他们自称 Social Graph），具有一般的社交媒体功能，例如个人资料编辑、评论、转发帖子等。不同的是，Lens Protocol 由 NFT 提供支持，支持用户拥有和控制其所创作的所有内容。\n\nLens Protocol 的特点：\n\n1\\.内容、所有权通证化：用户的主页会被 Mint 为 Profile NFT 一直跟随用户，创作的内容也可以额外发行 NFT 出售给粉丝。\n\n2\\.组件模块化，允许开发者使用模块化组件在 Lens 上任意搭建自己的社交应用，鼓励开发者开发提升产品体验的新组件。外部其他应用也可以接入 Lens，并且共享 Lens 生态优势。\n\n3\\.还提供了 Market 行情查看、Exchange 交易功能、Save 存款管理、Pools 添加流动池、Borrow 借贷管理等功能。更像是一个 Back-end，而非前端产品。Lens protocol 更像是一个提供给各种社交媒体开发者的后台产品而非一个已经开发好的可以直接使用的前端产品。\n\n团队信息：\n\n该项目由 WE3（一个专门集合 Web3 设计产品的社区: [https://we3.co/）](https://we3.co/%EF%BC%89) 团队部分人员设计打造，由 Aave 创始人 Stani 于2022年2月8日在推特上公开发布，已经在5月18日上线主网。\n\n5\\.GitcoinDAO（已发币） - 声誉系统\n\n概念解析:\n\nGitcoin 是一个开源软件开发激励平台，旨在通过区块链支持各类开源项目，促进开源运动的发展。在 Gitcoin 上，一个项目可以通过创建赏金或任务供其他人完成，而用户则可以赚取 Token 来完成上述任务。每个用户对任务的贡献将在链上可被追踪，并帮助其建立因完成具有明确目标任务的声誉。\n\n虽然这可能与 Github 有相似之处，但不同之处在于这个特定的声誉向量是高度定义的并且范围很窄，即：0xabc 为项目 X 完成了 Y 数量 Token 的写作赏金。\n\n6\\.Coordinape - 声誉系统、薪资管理\n\n概念解析：\n\nCoordinape 是 Yearn 为 DAO 推出的去中心化薪资管理系统，允许去中心化团队和 DAO 自动为贡献者发放奖励或赠款，而无需自上而下的管理或雇用 HR。\n\nCoordinape 是一个强大的工具，可以在 DAO 的本地环境中追踪贡献声誉。DAO 中的许多贡献者可以评估彼此的工作，以判断谁贡献最多和创造了最大的价值，而在评估其他成员的工作时，往往评价的是工作质量和工作量而不是社会影响力。\n\n7\\.Karma - 声誉系统\n\n<https://twitter.com/karma_dao> - 2千关注者\n\n概念解析：\n\nKarma是一个为DAO贡献者而建立的声誉系统，简而言之就是结合社区成员在参与DAO中的表现，为每位成员赋予一个Karma分数，分数较高的即为积极贡献者。通过Karma，DAO在一定程度上可以方便地筛选出活跃成员，同时积极贡献者也将得到相应回报以及更好地被其他DAO发现。\n\n截至6月7日，与Karma合作的有ENS、Gitcoin、Aave、Compound、Balancer、Lido、Uniswap等25个DAO。\n\n融资消息：\n\n2022-04-28，Karma宣布完成120万美元融资，投资方包括Seed Club Ventures、IOSG Ventures、Boost VC、Coingecko、Starbloom Ventures投资人Evan Van Ness、4RC Capital合伙人DeFi Dad等。\n\n更多信息：\n\n[Please Wait... | Cloudflare](https://andrwlee.medium.com/announcing-karma-dao-first-ever-token-permissioned-networking-chat-group-on-telegram-5feab7a54def)\n\n[Completing the CAPTCHA proves you are a human and gives you temporary access to the web property.](https://andrwlee.medium.com/announcing-karma-dao-first-ever-token-permissioned-networking-chat-group-on-telegram-5feab7a54def)\n\n[andrwlee.medium.com](https://andrwlee.medium.com/announcing-karma-dao-first-ever-token-permissioned-networking-chat-group-on-telegram-5feab7a54def)\n\n8\\.Atlendis Protocol - 信用系统、无抵押借贷\n\n<https://twitter.com/AtlendisLabs> - 6千关注\n\n概念解析：\n\nAtlendis Protocol是由Atlendis Labs开发的无抵押借贷协议，以解决目前超额抵押资金效率较低的问题。对于借款方（如Dapp、DAO等），Atlendis Protocol首先会进行审查，只有获得白名单的才有借款的资格，其次，贷款方可以自定义借贷利率以及借款人，将可能获得比传统超额抵押借贷协议更高的APR。\n\nAtlendis Protocol的灵感来自于2021年以太坊全球MarketMake黑客松，在2021年4月由ConsenSys的4位同事创立。\n\n融资信息：\n\n2021-12-08，Atlendis Protocol宣布完成440万美元的种子轮融资，由Lemniscap领投，参投方包括ParaFi Capital、Tioga Capital、White Star Capital、DeFiance Capital、True Ventures、Digital Currency Group、Divergence Ventures等。\n\n9\\.ARCx - 声誉系统\n\n概念解析：\n\nARCx是一个去中心化声誉协议，允许用户在去中心化金融世界中通过他们的链上行为释放利益。ARCx通过处理和评分大量数据，然后将其上传到用户的Passport（不可转让的NFT）来实现这一点。\n\nARCx根据每个 DeFi Passport 持有者的信用分来量化其链上地址的信誉度。信用分将通过分析持有者的以太坊地址历史活动来确定，其范围设置为 0 到 999 分，该信用分确定了协议为用户提供的抵押率。在申领 Passport 后，用户会受到激励，通过在多个“游戏”中最大化自己的分数来提高自己的链上声誉，这样他们就可以获得各种好处，例如以更低的抵押率进行借贷。\n\nARCx通过为参与者提供一种无信任的方式来建立声誉体系，并为其他协议和平台提供一种机制来识别、奖励和进一步激励良好声誉，从而为web3服务。\n\n融资消息：\n\n2021-06，宣布完成 130 万美元融资，Dragonfly Capital、Scalar Capital 和 Ledger Prime 领投\n\n10\\.Reputation DAO - 信用系统\n\n概念解析：\n\nReputation DAO 是一种可验证、去中心化和可编程的 DeFi 信用评分系统，它可以映射链下数据，如 AML/KYC、传统信用评分和社交媒体数据，为 Chainlink 预言机、DAO、智能合约协议及其用户提供可信的中立信用服务，使个人能够在与智能合约交互时利用其真实世界的金融数据和身份，以增强对特定账户风险指标的评估，并减少抵押贷款流程。Reputation DAO通过以下方式来收集和分析信用数据：\n\n第一，扫描并连接。Reputation DAO 专注于扫描个人 DeFi 账户、预言机和 DAO 的数据。之后，再使用由Chainlink提供支持的去中心化预言机网络，来连接所需的相关链下信用服务，例如身份服务、相关 AML/KYC 检查、FICO/Vantage 分数和相关社交媒体数据。\n\n第二，分析和计算获得数据之后，Reputation DAO 将对与个人账户、预言机和 DAO 相关的扫描数据进行分析和排序。\n\n第三，可视化。分析后的数据会被可视化，以便用户可以使用并了解自己或他人的链上交互信息。账户、预言机和 DAO 将能够查看和检查他们在链上的交易历史，同时评估相关的信用指标。\n\n融资消息：\n\n2022-04-14，宣布获475 万美元融资，DACM、AirTree Ventures、 Koji Capital 和 Framework Ventures等参投。其中Chainlink联合创始人Sergey Nazarov作为顾问加入Reputation DAO。\n\n11\\.SkillWallet - 声誉系统、SBT\n\n概念解析：\n\nSkillWallet 正在构建具有自主权、可移植的Web3 身份层，该协议构建基于Web3社区成员技能和贡献的个人所属的、不可转让的NFT ID，从而允许 Web3 空间的用户和参与者获得代表他们的经验、社区、技能和贡献的数据的持久性和持久性。\n\n该协议部署了一个基于角色的治理模块的 DAO，以及跟踪成员的贡献、承诺、名声，社区成员将根据他们对社区的参与和贡献程度拥有投票权，并共享一个集体的、去中心化的身份验证系统。\n\n融资消息：\n\n2022-02-15，SkillWallet宣布完成165万美元融资，本轮融资由Third Kind Venture Capital(3kvc)领投，Fenbushi Capital、HashKey和Pareto Holdings等参投。\n\n12\\.Proof of Competence - 任务系统\n\n概念解析:\n\n协议参与证明（Proof of Competence）框架，该框架可以帮助协议建立一个任务系统来验证用户对协议的了解度，用户每完成一个任务都会获得一定的积分，这意味着该用户对该协议更加熟悉和了解。此外，协议还可以利用该框架改变以代币权重进行治理的方式，通过用户积分的高低来设置治理权重。目前利用该框架的协议有Aave、Rarible Protocol、The Graph、useWeb3。\n\n13\\.Kleoverse - 任务系统（偏DAO）\n\n<https://twitter.com/kleoverse> - 1.2万关注\n\n概念解析：\n\nKleoverse的目标是帮助自由职业者和其他人才使用NFT创建一个职业身份--一个存储在区块链等数字账本上的数据串。然后，专业人士使用这些NFT来创建一个所谓的 \"人才证明\"，突出他们已经完成的相关工作。\n\n融资消息：\n\n2022-01，宣布120万美元融资，本轮投资由包括byFounders、Sfermion和几个天使投资人（如加密货币企业家Ville Vesterinen和区块链机构Equilibrium）在内的混合投资者主导。\n\n14\\.Dework - 任务系统（偏DAO）\n\n<https://twitter.com/deworkxyz> - 7千关注\n\n概念解析：\n\nDework 是一种 Web 3 原生协作工具，去中心化自治组织 （DAO） 可以在其中组织内部和外部团队，以透明的方式管理任务和奖励，并帮助新成员加入，他们希望成为 Web3 领域里的 Trello 和 LinkedIn。\n\n潜在的 DAO 贡献者可以使用 12 月推出的 Dework 从 DAO 列表和开放赏金中进行选择。他们还可以通过将个人 Discord 连接到 Dework 平台并回答几个问题来查看推荐的 DAO，然后这些人可以建立一个 Dework 档案，实际上是一份简历，并包含钱包信息以接收付款。\n\n融资消息：\n\n宣布完成 500 万美元的种子轮融资，本轮融资由 Paradigm 和早期风险投资公司 Pace Capital 联合领投，Coinbase 前首席技术官 Balaji Srinivasan 和 Polygon 创始人 Sandeep Nailwal 等参投。\n\n15\\.DegenScore - 声誉系统\n\n<https://twitter.com/DegenScore> - 9千关注\n\n概念解析：\n\nDegen 将会根据链上行为生成一个 Degenscore。分数越高则代表你在流动性领域的参与度越高、越资深。\n\n16\\.Atem Network - 社交协议\n\n<https://twitter.com/atem_network> - 1.4万关注者\n\n项目概念：\n\nAtem 是一个基于 NFT 的群组社交平台，旨在通过 NFT 把用户连接起来，探索基于 NFT 的社交网络，并丰富 NFT 资产与持有者，以及持有者彼此之间的关系表达。Atem 平台上的群组基于个人拥有的 Token 或 NFT 形成，并与交易实现无缝结合。用户根据自己持有的 NFT，可以很方便的进入各种各样的社群里，并可以很方便的和群里的人讨论，或进行点对点交易。\n\n所有群组和频道都采取 DAO 治理制式，由用户共同决定社区的规则，比如决定群组名称、徽标、用户禁言，以及创建可跨 dApps 使用的去中心化社区 NFT。此外，Atem 平台的数据则以去中心化的方式存储，并保证完全匿名和点对点加密。\n\n2022-05-23，多链Web3社交协议Atem Network正式上线AtemChat公测。\n\n融资消息：\n\n2022-02-23，宣布完成 300 万美元种子轮融资，INCE Capital 领投。GSR Ventures、Mask Network、Mirana Ventures、A&T Capital、Atlas Capital、Foresight Ventures、Zonff Partners 以及知乎联合创始人 Michael Zhang 参投。\n\n17\\.Sublime - 信用系统\n\n<https://twitter.com/sublimefinance> - 2千关注者\n\n项目概念：\n\nSublime与典型的信用检查不同，Sublime将让用户利用他们的数字身份来获得抵押不足的贷款。除了社交媒体资料外，Sublime还将支持加密和NFT作为抵押品。\n\n融资消息：\n\n2021-10-19，宣布完成250万美元种子轮融资，Galaxy Digital和Electric Capital领投，FinTech Collective、Collab+Currency和天使投资人Jill Carlson Gunter和Ryan Selkis参投。该笔资金通过未来代币的简单协议 (SAFT) 销售获得。\n\n18\\.Violet Protocol - DID\n\n<https://twitter.com/violetprotocol> - 2千关注者\n\n概念解析：\n\nViolet 是一个建立在以太坊上的去中心化身份协议。我们正在建立一个工具链，在链上构成、表达和验证身份。个人和机构可以在其中维护合法的身份（KYC、AML、PEP 等）并使用其他链上和链下数据丰富它\n\nViolet 正在建立一个链上基础设施产品，以解决机构的合规要求--同时最大限度地保护个人参与者的隐私。我们打算让DeFi建设者利用这一基础设施，因为他们开始参与机构流动性，并希望增加监管部门对其平台的信任。\n\n项目融资：\n\n2021-08-31，宣布完成350 万美元的种子融资，由BlueYard Capital 领投\n\n19\\.Litentry（已发Token）- DID、信誉系统\n\n<https://twitter.com/litentry> - 6.9万关注\n\n概念解析：\n\nLitentry是Polkadot生态中一个跨链身份聚合器，用户可以通过其提供的安全工具管理自己的身份，Dapp可以获得跨不同区块链的身份所有者的实时DID数据。\n\nLitentry的主要功能是身份连接(Identity Linking)和信用计算(Credit Computation)，意思是用户可以从不同区块链中提取历史数据或者交易数据，然后通过Litentry区块链计算出一个综合信誉。\n\n融资消息：\n\n2020-10，宣布完成百万美元种子轮融资，参与投资机构包括FBG Capital、Candaq Group、Signum Capital、NGC Ventures、BlockVC、D1 Ventures、Altonomy、Hypersphere Ventures、PAKA基金、数字文艺复兴基金会、RockX以及LD Capital等\n\nToken价值捕获：\n\n支付：用户每次通过网络请求进行实时信用计算时，需要用LIT支付费用。\n\n奖励：帮助建立索引身份数据库的第三方将获得LIT奖励。\n\n抵押：成为去中心化身份注册商需要抵押一定数量的LIT代币。\n\n抵押品：LIT被用作DeFi借贷服务的抵押品。\n\n20\\.HighLight - 社交平台\n\n概念解析：\n\nHighlight 是专注于社区建设工具的 NFT 平台，为不具备编码或加密背景的创作者提供铸币工具。在 Highlight 上，创作者可以通过出售 NFT 来获得奖励和收藏品社区的访问权限。\n\n融资消息：\n\n2022-05-11，宣布完成 1100 万美元的种子轮融资，本轮融资由 Haun Ventures 领投，1kx、Coinbase Ventures 等参投。\n\n## 附录2：上海黑客松上的涉及SBT和DID的项目一览\n\n> ETH Shanghai 黑客松是以太坊上海 Web 3.0 开发者峰会的平行活动，由 Mask Network 牵头主办，Gitcoin 协办，旨在鼓励新锐开发者建造具有创造性和创新性的，可以创造 Web 3.0 世界新格局的应用。在此次黑客松上，涌现了不少关于SBT和DID的项目。\n\n1\\.DAOU（铜奖）\n\nDAOU 使用 Soulbound Token 和 Social Oracle 将您在 DAO 中的活动数据：Discord 活动和参与、论坛问答、Github 代码贡献、DAO 角色和连接转换为链上可验证数据。Social Oracle是指激励同一个DAO中的成员对DAO成员产生的数据进行签名和验证，从而使这些数据更加可信，并根据这些数据给每个成员打分，这个分数就是DAO中的成员Credit。Social Oracle 验证的数据将通过 DAO 发布到 Soulbound Token，然后可以对外使用。例如：信用贷款、Soulbound 代币持有者的空投、防止 DDoS等。\n\n2\\.Arche Network（最佳社交游戏项目）\n\nArche正在构建社区驱动的 Web3 游戏生态系统，以增强和团结游戏玩家、公会和创作者。一旦用户连接了其所有的钱包地址，Arche 将读取并分析附加的钱包地址的链上关于 web3 游戏的数据，然后为用户生成一张 gamefi DID 信息卡。Arche 将根据 Arche 从用户钱包地址获取的数据提供各种 NFT 奖牌，用户可以收集符合条件的 NFT 奖牌并显示在可定制的 DID 卡中。\n\n根据用户钱包地址的交易数据，Arche 可以计算出用户玩的每个 web3 游戏的 ROI 率。此外，为用户和游戏提供标签系统以建立用户档案。在玩家卡中，可以看到用户（除了他们将卡设为私有）PFP NFT、徽章、游戏卡、个人标签、愿望清单、历史评论等。\n\nArche还将与游戏和公会合作，举办季节性的web3游戏比赛，为游戏和公会寻找高水平的玩家。\n\n3\\.Def Network（最佳去中心化身份项目）\n\nDef Network 收集链上钱包行为，例如合约交互和代币交易，将它们整合到易于理解的统一配置文件中，然后使该配置文件可用于可能需要它的其他系统——例如生成白名单、构建 SocialFi 应用程序或营销工具等。Def Network还为 Mask 创建了一个插件，以使用 def/POAP/Galaxy 显示社交资料。\n\n4\\.Proof of Soul\n\nProof of Soul 是一个无需许可的灵魂代币发行和证明协议，为去中心化的社会建立丰富的人类连结。\n\n5\\.TaiShang Soul Card\n\n面向分布式社会(DeSoc)中各族群的社交需求，NonceGeek 团队打造SoulCard 产品 —— 能标志灵魂的族群身份的链上名片。SoulCard 被设计为具备如下几种形态：预览形态、Arweave PermaWeb 形态、PNG形态、NFT形态。\n\n6\\.Popula\n\nPopula 是致力于 Web3 社区经济的基础设施，它使创作者经济的参与者能够通过创作和社会参与建立他们的互联网声誉和货币化。\n\n具有如下特点：\n\n一个用户友好的 Web3 社区平台，用于放大创作并增强社会参与度，其中内容、数据的所有权和治理权真正属于用户。\n\nPopula Points System 发行不可转让代币以记录社区内的增值行为，并表明成员的声誉、贡献和承诺。\n\n通过利用积分系统，Popula 的社区经济协议集将社区的目标和利益结合起来，以促进增长和创造，帮助创造者获利并激励成员共同创造。\n\n7\\.Marry3\n\nMarry3，在Web3见证人们的亲密关系，并获得灵魂绑定的代币凭证（SBTs）。\n\n[ARWEAVE TX→](https://viewblock.io/arweave/tx/qFk72DGA9mksxO4F3mRh-PjYpnhPL7bpOIlBY93WGEk)\n\n[qFk72DGA9mksxO4F3mRh-PjYpnhPL7bpOIlBY93WGEk](https://viewblock.io/arweave/tx/qFk72DGA9mksxO4F3mRh-PjYpnhPL7bpOIlBY93WGEk)\n\n[ETHEREUM ADDRESS→](https://etherscan.io/address/0x000000005Ebfb5A950f8fdF3248e99614A7ff220)\n\n[0x000000005Ebfb5A950f8fdF3248e99614A7ff220](https://etherscan.io/address/0x000000005Ebfb5A950f8fdF3248e99614A7ff220)\n\nCONTENT DIGEST\n\ndkuSc8Ryw056eSlee1fzowBPjcfbAxk3XqfBt4Z-mxs\n\n \n ", "timestamp": 1655355113, "digest": "8jAdMqZ9qIvoHRUo5FjliQC-7uZKiuUWy2bqjxpjDok", "contributor": "0xc18C3CC1cf44e72DEdfcbae981ef1AB32256EE60"}
{"id": "uXC-f_OPWRrnYSG3tsRytR7IqdyvHNzFa-9c_dVVnos", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are proud to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live on web this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly heads down rebuilding our entire platform from scratch. This hard work paid off, and from now on, it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* ***tryShowtime* showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators rushed to curate, customize and showcase their art collection from all NFT platforms – all in one place on Showtime. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social products.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists don’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregate NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive NFT purchase, we need to build a platform with lightweight, repeatable user interactions in mind, one that feels familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits in a persona we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, but rather to earn and claim NFTs for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a unique item from your favorite creators.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. We made this feature to be the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop and free to claim. Zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\nHow to build a universal design system, Axel Delafosse at App.js.\n\n## No more NFT marketplaces aggregation: we will focus on Showtime NFTs.\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and chose to only display Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make for us: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on innovative web3 features in-house is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook and give the enormously valuable data from their content aggregation straight to users, with NFTs, social tokens, non-transferable assets and more.\n\nFollow us on: [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.\n\nSee y’all in the metaverse,\n\nThe Showtime team.", "timestamp": 1655355167, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "WupAeMYquVrOaZzFuBNY_8I6B1GyFwWqBtV2No9BaYQ", "title": "创业狂人的雷曼时刻，加密独角兽Celsius危机始末", "body": "\n\n![](https://images.mirror-media.xyz/publication-images/QQrldl5RoYITPJLk_shCI.png?height=605&width=1080)\n\n“Celsius Network 的用户数量是所有 DeFi 总和的两倍……那是因为我们将 80% 回馈给我们的社区，而 Maker 和其他项目则将 50% 留给自己。”\n\n2019年，加密借贷平台 Celsius 创始人 Alex Mashinsky 在推特上如此炫耀，引发DeFi爱好者的回击，有人反驳道，“DeFi协议让我们完全控制自己的钱，然而在你们倒闭的那一刻，我们没有办法拿回我们的资金……”\n\n知名数据网站DeFiPrime选择直接下架Celsius Network 。\n\n“我们将 Celsius Network 下架。不透明的公司，疯狂的 CEO ，这是强烈的危险信号，所以我们不再推荐这个产品了。”AAVE创始人Stani趁势表态，“应该将所有CeFi从DeFi Prime下架”。\n\n![](https://images.mirror-media.xyz/publication-images/Dk7X9XD03GVrt04F3q5Vd.png?height=545&width=1080)\n\n近3年后，已成长为加密独角兽的Celsius Network 却突然发布公告：暂停平台一切提现、交易和转账。\n\n对于大多数华人而言，Celsius Network 或许稍显陌生，但是创始人以及公司的故事具有传奇故事所要求的几乎所有要素：\n\n一名乌克兰人揣着100美元来到美国变身创业狂人，创立8家公司，打造出3家独角兽企业；做VC，募资10亿美元，退出超30亿美元，IRR 54% ；Celsius 两次因被盗损失资产；前 CFO Moshe Hegog 被逮捕；色情明星从事高管……\n\n如今，伴随大规模资金挤兑，暂停提现，资产规模一度高达300亿美元的 Celsius Network来到了“雷曼时刻”。危机从何而来？这次，创业狂人Mashinsky 能否再次力挽狂澜？\n\n狂人Mashinsky\n\n1965 年10月5 日，Mashinsky 出生在苏联的乌克兰，1972年，他随家人搬到了以色列，在那里度过了大部分童年时光。\n\n十几岁时，Mashinsky 常在特拉维夫机场的海关拍卖会上买卖被扣押的物品，再高价卖出，展示了出色的商人潜质。\n\n大学期间，Mashinsky分别在以色列开放大学和特拉维夫大学读电气工程和经济学，不过都没有完成学业。\n\n在以色列军队服役三年后，Mashinsky 萌生了去欧洲搞点大事的想法，他选择了巴黎作为他的第一站，很快，他因“欧洲人缺乏想象力”而感到沮丧，“为什么不坐飞机去纽约看看美国到底是怎么一回事？”\n\n带着口袋里仅有的 100 美元，Mashinsky 来到了纽约，然后乘坐公共汽车前往第 42 街，在车上，他和所有到大城市打拼的城镇青年一样发誓：除非有所成就，否则永远不会回去。\n\n在美国，Mashinsky 开启了疯狂创业之旅。\n\n1995年，Mashinsky 创立了电信公司 Arbinet，为运营商和服务提供商提供三种国际语音流量服务，如今的Skype、Facetime 、Whatsapp都是其客户。\n\n经过六轮融资，Arbinet从12家VC筹集了超过 3 亿美元，最终于 2004 年IPO，估值超过 10 亿美元，2005年，Mashinsky出售股份，完全退出。\n\n这十年期间，Mashinsky 并不满足只做一家公司。\n\n1997年，Mashinsky 创办电信软件公司Comgates，融资 2000 万美元，并被 Telco Systems 收购。\n\n2001年，Mashinsky 创办网络虚拟化公司 Elematics，融资2300 万美元，2004年退出。\n\n2003年，Mashinsky 创办 Transit Wireless，一家使用分布式天线系统网络的电信公司，后被收购。\n\n2005年，Mashinsky 创立了拼车应用程序 GroundLink，后被收购。\n\n一句话可以证明 Mashinsky 的创业成绩，2000年后，纽约市得到风险投资，最成功退出公司前十名中有两个是他创建的。\n\n![](https://images.mirror-media.xyz/publication-images/x7JSzACHqxzUyUt58esgJ.png?height=577&width=572)\n\n除了在创业上是好手，Mashinsky 也做起了VC，于2004年创建了风险投资基金 Governing Dynamics。\n\n不要以为他只是玩玩，Governing Dynamics 募资超过10亿美元，累计投资超过60家企业，退出超过30亿美元，IRR 54%……\n\n除了投资传统业务，Governing Dynamics 也投资了区块链，或许是相信其潜力，Mashinsky再次下场创业，于 2017 年创建了Celsius Network，一家加密货币存款和借贷平台，其吸引力来自于为客户提供高达 18% 的年化利率。\n\n2021年10月，Celsius Network完成4亿美元融资，随后又扩大到7.5亿美元，WestCap和加拿大第二大养老基金CDPQ领投，投后估值超过30亿美元。\n\n这也是Mashinsky 创立的第八家公司，第三家独角兽。\n\nCelsius，反银行的加密银行\n\n在华人世界，Celsius 或许是大多数人的陌生人，但在英美，Celsius 是称得上家喻户晓的明星CeFi，坐拥超170万用户，最高管理着超过300亿美元资产。\n\n就商业模式而言，Celsius 和“银行”无异，负债端，吸收储户的“加密存款”；资产端，利用大量沉淀资金通过贷款等形式赚取收益，Celsius 从两端利差赚得利润。\n\nCelsius如何吸引客户“存钱”？\n\n叙事上，Celsius 用银行的商业模式讲了一套“反银行”的故事。\n\n“传统银行正在破产，区块链将颠覆华尔街！”\n\n* Banking is Broken\n* Unbank Yourself\n* Replacing Wall Street with Blockchain\n* 99% vs. 1%\n\n宣传上，Celsius的话术一成不变，但卓有成效：存入加密货币获得最高18%的年化收益率，每周派息。\n\nCelsius计息分为两种方法，in-kind Reward，存入一种Crypto资产选择用此资产计算利息，比如存入SNX，用SNX收取利息。\n\nin-Cel Reward，存入一种Crypto资产选择用Celsius平台币 CEL 计算利息，整体APY更高。\n\n![](https://images.mirror-media.xyz/publication-images/3zShEBdafHP9OF7BHXl95.png?height=434&width=1080)\n\n整体收益率而言，在Celsius上，比特币约为 3% 至 8%，以太坊为 4% 至 8%，USDT 为 9% 至 11%，那么问题来了，无风险的高收益率从何而来？\n\n借贷业务当然是相对稳妥的商业模式，但是面临资金效率的问题，并不是所有资金都被匹配产生收益，资金效率低，会导致APY低，从而影响负债端（吸储）扩张。\n\n因此，一个行业潜规则是，除了借贷，Celsius、BlockFi等借贷平台往往还会在别处寻找收益。\n\n在音乐狂欢的牛市，通过多种套利策略获得“无风险收益”并不是难事，比如GBTC 套利和期货市场期货溢价套利，甚至层层嵌套，在DeFi中加杠杆获得收益…… 在牛市，这属于司空见惯的行为，毕竟同行都在这样做，急剧扩张资产规模，你不这样做就落后于人。\n\n然而，牛市音乐总有停止的一天。\n\n当稳定套利的机会消失，为了为储户创造高收益，Celsius不得不使用越来越奇特和风险更高的金融工具。\n\n比如，Terra生态的Anchor Protocol ，Celsius是Anchor 上的超级巨鲸，在暴雷前发送数亿美元加密资产至Anchor，也成为了最后压垮UST的最后稻草之一。\n\n![](https://images.mirror-media.xyz/publication-images/N4-zqGzC3zdmf9fmvCJ-Z.png?height=1158&width=962)\n\n其次，Celsius 承诺给储户最高8%的以太坊存款收益，为了实现这一收益，Celsius 选择将大量ETH置换为stETH等ETH2.0衍生品，从而获得质押收益，这为如今的流动性危机埋下了伏笔。\n\nCelsius 究竟怎么了？\n\n无论是Celsius还是BlockFi，亦或多年前国内火热的互金，所有类银行商业模式公司的破产，都来源于流动性危机，分为几种情况：\n\n一、坏账亏损。\n\n实际上，所有的银行都会产生坏账，但只要不伤筋动骨，并非特别严重的问题，关键看坏账规模，最坏的情况就是巨额亏空，资不抵债。\n\n二、流动负债与非流动资产错配。\n\n一般而言，负债端的期限较短，比如活期存款；而资产端的期限相对较长，比如长期贷款，这样才能获得更高的现金流收益，可一旦产生黑天鹅事件，就容易出现流动性短缺，并导致资产抛售和挤兑。\n\n利差其实就是对“银行”承担流动性风险的补偿。\n\n![](https://images.mirror-media.xyz/publication-images/R05Y2Xpb7fVo0yf5cl0oL.png?height=437&width=635)\n\n三、提款需求增加，流动性减少。\n\n无论链上还是链下，金融市场最需要信心，哪怕是传统大型银行都恐惧挤兑，因为任何银行都会有流动性错配问题。\n\n对于Celsius而言，很不幸，这几大问题，它都有。\n\n如果非要说导火索，首先是 UST depeg。\n\nCelsius 曾在 Anchor Protocol 中拥有5.35 亿美元资产，此后Nansen的链上数据分析证实，Celsius 是促成UST depeg 的七个鲸鱼钱包之一。\n\n也就是说，Celsius 在UST彻底暴雷前逃了，或许并未有太大的资产损失，但这严重打击了市场信心，以及引发了对Celsius的不信任。\n\n自UST脱锚始，资金开始加速撤离Celsius， 5月6日至 5月14日，流失超过7.5 亿美元。\n\n然后，Celsius 此前两次被盗事件被爆出并发酵。\n\n一、在Stakehound 上损失了 35,000 ETH\n\n2021 年 6 月 22 日，Eth2.0 质押解决方案公司 Stakehound 宣布丢失了代表客户存入的超过 38000 个 ETH 的私钥，后来经链上地址分析，其中3.5万枚属于Celsius ，Celsius却一直隐瞒该事件，至今未承认。\n\n二、BadgerDAO 黑客攻击损失 5000 万美元\n\n2021年12月，BadgerDAO 遭黑客攻击，损失达1.203亿美元，其中有超过5000万美元来自Celsius，包括约2100枚BTC和151枚ETH。\n\n一共1.2亿美元的损失，并不会击溃Celsius的资产负债表，作为一家于2021年完成7.5亿美元融资，享受了牛市红利的独角兽，现金流状况应该比较健康，但实际上并没有那么乐观。\n\n牛市期间，Celsius选择向矿业扩张，冲刺上市。\n\n2021年6月，Celsius Network 宣布向比特币挖矿投资 2 亿美元，包括购买设备和收购 Core Scientific 的股份。\n\n2021年11月，Celsius 对比特币挖矿业务再次投资3亿美元，投资总额达到5亿美元。\n\n2022年5月，Celsius 旗下全资公司Celsius MiningLLC 向美国证券交易委员会（SEC）秘密提交一份FormS-1（股票上市申请登记表）注册声明草案，开启上市之旅。\n\n矿业是重资产、支出高、回报慢的投资项目，资金陷进去，很难快速回笼，当然恶劣的市场环境，也不支持高估值的IPO。\n\n在当前动荡的市场环境中，Celsius又遭遇了流动性错配的问题。\n\nCelsius 允许随时赎回资产，但是很多资产并不具备流动性，如果大量储户挤兑，Celsius无法满足赎回需求，比如Celsius有73%的ETH锁定在stETH或ETH2中，只有27%的ETH具备流动性。\n\n挤兑冲击之下，Celsius “骚操作”不断，开发出了“HODL Mode”，禁止用户提现，需要提交更多文件和申请才能解除该模式，这似乎就是告诉投资者：我们快顶不住了，加剧恐慌。\n\n![](https://images.mirror-media.xyz/publication-images/A5qRSL_ir2a38fE6zxCgM.png?height=767&width=392)\n\n为了应对提现，获得流动性，一方面，Celsius 大规模抛售BTC\\\\ETH等资产，另一方面通过AAVE、Compound等DeFi协议抵押资产，借出USDC等稳定币。\n\n截止6月14日，Celsius 在AAVE有5.94亿美元的抵押品，其中超过4亿美元是stETH，共借出了3.06亿美元资产。\n\n![](https://images.mirror-media.xyz/publication-images/2F-0ntdfHjRm6raR1UZJR.png?height=776&width=1080)\n\nCelsius 在Compound上有超过4.41亿美元抵押品，负债为2.25亿美元。\n\n![](https://images.mirror-media.xyz/publication-images/wbwswhjZQWEuTp7SmTTTt.png?height=708&width=1080)\n\n在Maker上，Celsius 有5.46亿美元资产，2.79亿美元负债。\n\n![](https://images.mirror-media.xyz/publication-images/1kxf8RrCFd2HEkF1aT5Ef.png?height=571&width=1080)\n\n看起来抵押率尚可，实则危险重重。\n\nstETH 脱锚以及ETH、BTC价格持续下跌，让其不得不增加资产抵押，同时不断的提现需求又会减少其流动资产，于是Celsius采取终极手段——禁止提现、交易和转账。\n\n在DeFi的黑暗森林中，Celsius 成为了众矢之的，透明靶子，猎人潜伏在暗处，随时可以扣动扳机，狙击其资产和清算线，捡拾尸体。\n\n这是一个可怕的恶性循环。\n\n无法获得高收益-资金亏空-流动性错配-挤兑-抵押资产-价格下跌-补仓-继续下跌-继续挤兑……\n\n目前，Celsius 的资产负债表仍然是黑匣子，或许亟待白衣骑士拯救，加密借贷平台Nexo发推表示，可以随时收购Celsius的任何剩余合格资产，Celsius反应冷淡。\n\n也有人寄希望于Celsius的早期投资者——USDT发行方Tether，然而 Tether 似乎只想撇清关系，并表示：Celsius 的持续危机与Tether 无关，也不会影响其 USDT 储备。\n\n每一轮牛熊周期转换，总会经历去杠杆的阵痛，总有人或机构成为被献祭的“代价”，LUNA 的算稳DeFi叙事破灭后，CeFi也迎来叙事幻灭时刻。\n\n创业狂人 Mashinsky 一生并未有太多坎坷，桀骜不驯，如今在周期面前，或许他不得不低下头颅，向市场认输。\n\n所有命运赠送的礼物，早已在暗中标好了价格。\n\n后记\n\n天下没有新鲜事，如今的Celsius，望过去，满是曾经中国互金企业的影子。\n\n在流动性泛滥的时代野蛮生长，以高收益率为诱饵，疯狂营销吸储，扩张负债端，当借贷业务无法满足庞大的沉淀资金的使用，开始疯狂对外投资，房地产、上市公司债权、VC LP……\n\n为了追求更高的收益，资产往次级下沉，坏账和资金错配成为了皇帝的新衣，大家熟视无睹，一门心思奔着上市敲钟，书写人生传奇。\n\n流动性的音乐总有停止的那一天，巴菲特名言永不过时，只有等到潮水退潮了，才知道谁在裸泳。\n\n做人贵在有自知之明，无论是美股还是Crypto，赢家享受的终究是Beta红利，大多数人的财富来自于周期，而不是实力。\n\n但行好事，敬畏周期！\n\n【welcome to join us】 \n WeChat1：victeam005 \n WeChat2：shijie20170405 \n Telegream：[https://t.me/VICOINDAOCHAT](https://weibo.cn/sinaurl?u=https%3A%2F%2Ft.me%2FVICOINDAOCHAT) \n Twitter：[@VICOINDAO](https://weibo.com/n/VICOINDAO)", "timestamp": 1655355208, "digest": "r0OKLCl-M_gSPHMSqSu_gNPUKnY21KKhAO-ZfF9mDBY", "contributor": "0xf6e546668c397dcb64767efe331904Ba147D5025"}
{"id": "7Fqd9QW6bmOvaQEMYKBUKb4JVZhiuTdowQMUV1lDmWk", "title": "只要参加“唐华斑竹”战队，无需交易就有奖，零撸别错过！ ", "body": "## 只要参加“唐华斑竹”战队，无需交易就有奖，零撸别错过！\n\n兄弟们，老唐又来喂饭了！号称全球第四大交易所的“芝麻开门”正在举行WCTC 合约世界杯交易大赛！别担心不是拉你去玩合约，现在你只要加入“唐华斑竹”战队，攒鸡毛凑掸子凑个人数，不用交易就能最终分到大赛奖品啊！这是GATE交易所专门给老唐粉丝社区的福利哦！零撸不要错过！\n\n![](https://miro.medium.com/max/1400/1\\*ZtEm45o8pGXR_XiY6gNHTw.png)\n\n首先访问芝麻开门官网：<http://www.idcnpc.com/z/gate/>\n\n以上地址是我制作的永久免梯跳转地址，我会及时更新到最新的免梯地址，大家记住这个地址，就不必总是更换新地址了。\n\n如果你还没有账号就直接注册一个，如果已有账号，注意先给合约账户内转入200U资金（放心这是报名资格，不是非要进行交易）。登录后看下图，在首页左边，点击“合约团战”：\n\n![](https://miro.medium.com/max/1400/1\\*fTTTlfhfGUtirmf_T4jGAg.png)\n\n然后向下拉页面，点击下图中的“团队赛”：\n\n![](https://miro.medium.com/max/1294/1\\*vS9fhUqKAKW4TR_m1iFrKg.png)\n\n向下拉页面，在下图搜索框里输入“唐华斑竹”，下面就会出现我的名字唐华斑竹，点击它：\n\n![](https://miro.medium.com/max/1286/1\\*cMdAk9U6CNiFM7qQ47rbKw.png)\n\n在下图中点击加入：\n\n![](https://miro.medium.com/max/1378/1\\*031-pjctlUEiQbuvoN3z5A.png)\n\n在弹出的留言框里，随便输入几个字，例如我要参赛！然后点击确定，就可以成功加入我的战队了。大功告成，等着分奖品吧！\n\n![](https://miro.medium.com/max/1376/1\\*7eI4AlSBpMId2sg2IZG9nw.png)\n\n加入团队后，愿意交易就交易几手，不愿意交易就放一边，等着分奖品即可，当然交易如果盈利了更好，如果盈利大，团队成绩好，还能瓜分400万U的团队奖金！\n\n快去报名加入吧：<http://www.idcnpc.com/z/gate/>\n\n**更多实用干货与空投活动关注我的推特：@uniswap12**\n\n**我把正在撸的一些羊毛和项目放在这个网址了，建议大家收藏或设成浏览器首页，以后有新的羊毛我会及时在这里更新汇总： **[**http://idcnpc.com/z/ym/**](https://t.co/ukM2HxOFrt)\n\n**也欢迎大家加我微信 76842750 进入微信读者群交流探讨。**\n\n**（郑重提醒，我不建议任何人投资，不推荐任何项目！本文仅供学习参考，大家不要按照我的文章进行任何投资，我不建议大家投资任何币圈项目！不要投资，不要投资，不要投资！如果不听非要投资，一切风险您要自负，数字币风险大，随时有归零风险，投资务必谨慎，一定要清楚这一点。）**\n", "timestamp": 1655355366, "digest": "eKtW9G9PC-C7D31Zk5lvMv6tGdpAbM5N7Kdj8YOio7g", "contributor": "0x731644a15A2C445825F7Bd6002870c49B83bc859"}
{"id": "Ygcm1hhndUbYS_jo3VA5nPDu0CrTr9dZd9uEBKLtrZw", "title": "mirror", "body": "mirror", "timestamp": 1655355315, "digest": "KsV0lmGtshooAkj_dk3MZMtTGikDN1KIeOzSueF5Grk", "contributor": "0xd5Ed511e56E92229C0e5CeDB107711f5e79e4F82"}
{"id": "05wNNk2mjQAXUfN57xWRALInn2A2BxsPsIOxgUNp-k8", "title": "✨ Dune Analytics零基础极简入门指南", "body": "Dune Analytics¹ 号称“平民版 Nansen”、“链上数据分析师神器”，为各路大神所追捧。\n\n然神器在手，奈何找不到适合新手小白的说明书，我等只得望洋兴叹否？\n\n非也！\n\n本文作为一篇入门级的极简教程，适合 Dune 的零基础小白用户，与大家一起掀开 Dune 女神的面纱。\n\n## 何谓 Dune？\n\nDune 作为一款链上数据研究分析的强大工具，经过4轮融资，目前估值已达10亿美元²。\n\n用户通过类SQL的数据库查询语言，从 Dune 缓存的区块链数据仓库中检索、筛选、提取、聚合，形成一个个 Query，再对查询到的数据进行可视化，最终汇总而成一个个 Dashboard 面板。\n\n## 何谓数据仓库？\n\n区块链本质上是一个去中心化的账本，所有过往的交易转账、合约调用形成了一条条的交易记录明细，包含交易时间、转入、转出地址、交易金额、调用信息、合约事件、tx_hash 等数据。\n\nDune 将以上所有数据分门别类进行存储形成数据仓库，供有需要的人通过类SQL语言来调用、查询、分析（可谓功德无量）。\n\n## 何谓 SQL？\n\nSQL 即“结构化查询语言”，专用于数据库相关的查询、管理。\n\n在 Dune 中，我们用 SQL³ 查询语句来获取所有想要的数据，构建成对应的 “Query”。\n\n![SQL 语言](https://images.mirror-media.xyz/publication-images/EwoXh1_ANd7qN-9dT1QXJ.png?height=300&width=800)\n\n## 何谓数据表？\n\n每一个数据表（table）⁴ 可以视作一个超大的 Excel 表格，按顺序记录了所有与之相关的数据。\n\nDune 提供了很多内置的知名协议专属的 \"数据表dataset\"。 注册登陆你的 Dune 账户，点击顶部的 \"New Query\" 即可打开如下页面： 左侧即为内置数据表，右侧是“查询语句”和“查询结果”\n\n![Dune New Query 页面](https://images.mirror-media.xyz/publication-images/hiIEgGoFJNyzWdjrnHimS.jpg?height=1466&width=2974)\n\n## 常用数据表\n\n除了内置的数据表外，还有些常用的数据表，比如： 最常用的 ethereum.transactions，可以查询所有的以太坊链上交易信息，包括了普通转账和合约调用等信息。\n\n![Dune 常用数据表](https://pbs.twimg.com/media/FSn-Bw2aUAAx86X?format=jpg&name=medium)\n\n## 数据表里有什么？\n\n不同数据表，提供的内容各有迥异。\n\n以 `\"ethereum.transactions\"` 为例，表内提供了:\n\n* `block_time` 区块时间\n* `from` 发起地址\n* `to` 转入地址（或调用的合约地址）\n* `value` 转账金额，\n* `data` 附加数据（合约调用的input data）\n\n等诸多数据\n\n![transactions 数据表](https://pbs.twimg.com/media/FSn_vFGUsAI4KBb?format=jpg&name=medium)\n\n## SQL 查询语句怎么写？\n\n基本的 SQL 查询语句：  `SELECT * FROM X`\n\n* `select`: 取什么数据\n* `from`: 从哪里取数据\n* `where`: 限制条件是什么\n* `order by`: 根据什么排序\n* `limit`: 限制取回的数据条数\n\n![SQL 查询语句](https://pbs.twimg.com/media/FSoCKwQacAAHWgl?format=jpg&name=medium)\n\n## 你的第一条 Dune 查询语句\n\n打开 Dune 的 \"New Query\"，粘贴以下语句\n\n👉 `select * from ethereum.transactions limit 5`\n\n点击 \"Run\" 稍等即可在\"Query Results\"看到查询结果\n\n语句中的 `*` 代表查询所有字段，`limit 5` 是为了限制数据取回的数量，如果不加这条限制，你就是在告诉 Dune 要取回以太坊链上的所有交易数据（耗时超长且无必要）\n\n![首条 Dune 查询语句](https://pbs.twimg.com/media/FSoDbDBacAA_COL?format=jpg&name=medium)\n\n## 更复杂的查询语句\n\n现在让我们来试试更复杂（也更有趣）的 Dune 查询语句：查询 V神钱包 的链上交易信息\n\n这次我们新增了 `where \"from\"` 限制条件，只筛选“V神”的钱包地址，`order by` 语句限定排序条件，`desc` 表降序\n\n```\nselect *\nfrom ethereum.transactions\nwhere \"from\" = '\\x1Db3439a222C519ab44bb1144fC28167b4Fa6EE6'\norder by \"block_time\" desc\nlimit 10\n```\n\n点击链接即可复制语句，或 fork 后自己该参数运行 [dune.com/queries/724390](https://t.co/I59NaGsig2)\n\n![更复杂的查询语句](https://pbs.twimg.com/media/FSoGpXRaMAE73Y0?format=jpg&name=medium)\n\n## 更有用的查询语句\n\n现在，让我们筛选一些“更有用”的信息，比如：转账金额\n\n```\nselect block_time as \"date\",\nvalue/1e18 as \"value\" -- value 字段的值换算为 ETH 单位\nfrom ethereum.transactions\nwhere \"from\" = '\\x1Db3439a222C519ab44bb1144fC28167b4Fa6EE6' -- 交易的发出地址为 V神钱包\nand value/1e18 > 0.1 -- 转账金额 > 0.1 ETH\norder by \"block_time\" desc  -- 按照区块时间倒序排序\n```\n\n这次我们 `select` 选取两个字段: `block_time` 和 `value`\n\n`value` 的值，我们通过 `value/1e18` 这个计算公式，换算为 ETH 单位⁵。\n\n`as` 关键词为其取一个好听的别名\n\n第5行 `and` 关键词指 `where` 下多个限定条件取交集\n\nQuery链接：[https://dune.com/queries/728779](https://t.co/684ryLWPCo)\n\n![更有用的查询语句](https://pbs.twimg.com/media/FSodlidVEAAcVjH?format=jpg&name=large)\n\n## 你的第一个可视化图表 📈\n\n数据已有，可视化图表呼之欲出\n\n对于随时间变动的数值，最普遍使用的图表就是bar chart （条形图📊、柱状图）了\n\n在前一步生成的查询结果顶部点击\"New visualization\"，选择“Bar Chart”，看到系统已经自动帮我们把 `X`,`Y` 轴都选好了。\n\n如果在数据较多的情况下，则需要手动选择`Y`轴数据\n\n![首个可视化图表📈](https://pbs.twimg.com/media/FSoh9SXaUAI138p?format=jpg&name=large)\n\n## Sum函数求和\n\n一个最普遍的数据统计需求就是：加总求和\n\n我们对筛选到的数据，直接使用 `sum` 函数即可\n\n👉 `sum(value/1e18) as \"total\"`\n\n```\nselect sum(value/1e18) as \"total\" -- 使用 sum 函数对 value 求和\nfrom ethereum.transactions\nwhere \"from\" = '\\x1Db3439a222C519ab44bb1144fC28167b4Fa6EE6'\n```\n\n然后在可视化图表区域选择 `Counter`，修改 `Title` ，就有了如图的汇总数据：83.25万 ETH\n\n![sum 求和函数](https://pbs.twimg.com/media/FSokgtkagAA1EvZ?format=jpg&name=medium)\n\n## 计数 count\n\n`SUM`、`AVG`、`MAX`、`MIN`、`COUNT` 统称为聚合函数，用于将组中的行汇总为单个值。\n\n前面提到的 `sum` 用于对数值求和，`count` 则用于统计查询记录的总数目。\n\n比如我们统计下 V神 钱包总计对外发出交易的次数\n\n👉 `select count(*)`\n\n```\nselect count(*)   -- count 函数用于计数\nfrom ethereum.transactions\nwhere \"from\" = '\\x1Db3439a222C519ab44bb1144fC28167b4Fa6EE6' -- V神 对外发出交易的次数\n```\n\n![count 计数](https://pbs.twimg.com/media/FSo-KN-acAAMEUf?format=jpg&name=large)\n\n## 你的第一个 Dune 数据看板\n\n保存前面每一个 Query 并取名，现在我们就来搭建你的首个 Dune Dashboard\n\n在首页点击\"New Dashboard\"，或直接在 Query 结果页面点击\"Add to dashboard\"，输入 Dashboard 名字即可\n\n👉 [dune.com/gm365/:-V-YYDS](http://dune.com/gm365/:-V-YYDS)\n\n建议：首次取名选简短的英文，这部分内容会被用在url上（只支持英文、数字且后期无法修改）。你可以首次取名并保存之后，再对其改名以显示完成内容（现在可以中英文、emoji表情混用了）\n\n## 分类汇总 group by\n\n另一个常见的数据统计需求：分类汇总\n\n比如我们想知道 V神 每月的转入、转出ETH总额\n\nQuery 代码的第1行中 `date_trunc('month', block_time)` 称为截断日期函数，用于将时间间隔截断为指定的精度级别（这里我们选取 `month` 统计每月数值，你还可以选 `hour`、`minute` 、`second` 、 `day`、`week`、`year` 等时间间隔单位 ）\n\n```\nselect date_trunc('month', block_time) as \"Date\",\nsum(value/1e18) as \"Value\" -- 当月接收 ETH 求和\n```\n\n第2行中，我们要使用 `sum` 表示对当月的 ETH 转账金额进行求和\n\n最后一行的 `group by 1 `即按第一个字段 `\"date\"` 进行分类汇总，如果是第二个字段，则为 `group by 2`，以此类推\n\n![分类汇总](https://pbs.twimg.com/media/FSozSLMVIAANdyR?format=jpg&name=large)\n\n## 累计求和 Cumulative Sum\n\n累计求和，在前一项数据基础上，累加当前数据，不断重复。\n\n一般我们会先按日求和，再不断累加汇总。比如统计某个协议有史以来所有充值到合约地址的ETH总额。\n\n要实现“累计求和”，其 Query 代码稍微有些复杂。\n\n```\nwith net as (\nselect day,\nsum(\"total\") as daily_sum \nfrom (\n    select value/1e18 as \"total\", \n    date_trunc('day', \"block_time\") as day\n    from ethereum.\"traces\" \n    where \"from\" = '\\x1Db3439a222C519ab44bb1144fC28167b4Fa6EE6' -- 从 V神钱包地址 发出的交易\n) as \"total_amount\"\ngroup by day\n)\n\nselect day, sum(sum(\"daily_sum\")) over (order by day)\nfrom net\ngroup by day\norder by day desc\n```\n\n面对这种情况，千万不要气馁。因为我们新人小白也有必杀技: `Fork并修改关键参数`\n\n比如，我们直接 fork 下面这个 Query ，在其基础之上，只需要修改第8行参数即可\n\n👉 dune.com/queries/732520\n\n![累计求和](https://pbs.twimg.com/media/FSpFVdLaAAAhGrP?format=jpg&name=large)\n\n## Fork 神技能\n\n作为新人小白，我们一定要掌握的最重要的一门技能：fork 神技\n\n站在前辈大神的肩膀之上，能让我们光速入门。越过陡峭的学习曲线，Fork 大神的代码与劳动成果，然后只需要简单修改核心参数，即可实现同类功能，获取心仪的数据（感恩大神与前辈的付出）\n\n具体到 Dune上，我们在任一 Dune看板的图表区域点击左上角 `Query` 名字即可查看完整 `SQL`查询语句。Fork之，修改关键参数，然后点 `Run` 即可见证奇迹\n\n比如 oxBi 大神做好的一个叫 ”Total Holder by Day - ENS ” 的 Query，统计了 ENS 代币每日的总持币人数。代码有67行之长，语法复杂，艰深无比，我等小白唯有汪洋兴叹的份儿。\n\n但，如果你只是想借用下大神这个 Query 的功能，统计其他代币的每日持币人数，我们 Fork 后修改第14行代码中 Token 地址即可搞定。\n\n站在巨人肩膀之上，轻松无比。\n\n👉 [dune.com/queries/326596/621471](http://dune.com/queries/326596/621471)\n\n![ENS 每日持币人数 Query](https://pbs.twimg.com/media/FSpLoxnagAA8sVd?format=jpg&name=large)\n\n## Dune 零基础实战\n\n零基础入门的小白能否直接实战？\n\n当然！\n\n👉  [https://dune.com/gm365/Syndicate](https://t.co/U4OdkykAIL)\n\n这个 [@SyndicateDAO](https://twitter.com/SyndicateDAO) 看板，所用到的基础知识在前面全部有所涉及。事实上，这也是我近期学习并用 Dune 做的第一个数据 Dashboard。\n\n在前面基础知识铺垫之上，另一个关键就在于找准协议所对应的合约地址，大家可以点开每一个 `Query` 查看具体的 `SQL` 代码，你会发现实现这些链上数据统计功能并没有太难。\n\n![Syndicate Dune Dashboard](https://pbs.twimg.com/media/FSpN6SRakAALpXR?format=jpg&name=large)\n\n## 总结\n\nDune 帮我们保存了珍贵的链上数据，我们要做的便是“各取所需，为我所用”。\n\n大神们构建的Query语句精妙绝伦，却也繁复无比。我们作为小白，只要掌握了最基本的 `SQL`查询语句，其实已经可以开启神奇的链上数据分析师🧙‍♂️之旅了。\n\n本文只能算作一个相当初级的 Dune 入门指南，无论是对 `SQL` 还是 Dune 的介绍，都有诸多遗漏。对于有心深入链上数据分析的同学而言，建议可以先从基础的 `SQL` 入门教程开始，掌握基础语法后，就可以选一个你喜欢的协议来尝试制作你个人版本的 Dune 数据看板了。\n\n比如前面提到的 Syndicate Dashboard，也是我个人尝试的第一个看板。没成想，竟然还被收录到了第29期的官方 Dune Digest 中，属实意外。\n\n### 致谢\n\n本文写作过程中，参考了其他前辈与大神的诸多教程和文章。这里尤其感谢大神 [@Pro_0xBi](https://twitter.com/Pro_0xBi) 的三篇 Mirror 教学文章，敬请移步大神置顶推文获取更多 Dune 秘籍。\n\n## 备注\n\n\\[1\\] Dune 已经将域名从 dune.xyz 跳转到 dune.com\n\n\\[2\\] Dune 于 2022.2.2 完成最新一轮 6942万美元融资 [www.qianba.com/news/p-429265.html](http://www.qianba.com/news/p-429265.html)\n\n\\[3\\] Dune 实际上使用的是一种叫 PostgreSQL 的查询语言，其兼容大部分 SQL 语句，普通用户无须做更进一步的区分\n\n\\[4\\] 实际上， Dune 已经将其改名为 dataset，称为数据集更为准确，但其本质含义并未发生变化\n\n\\[5\\] 以太坊的单位默认为 wei， 1个 ETH 相当于10的18次方wei，所以需要把原始单位除以 10的18次方，计算后的结果即为常用的 ETH 单位\n\n## 参考文献\n\n* [0xBi Mirror](https://0xbi.mirror.xyz/)\n* [从0到1构建你的Dune Analytics看板（实战篇）](https://0xbi.mirror.xyz/603BIaKXn7s2_7A84oayY_Fn5XUPh6zDsv2OlQTdzCg)\n* [Dune Analytics introduction tutorial](https://medium.com/zengo/dune-analytics-introduction-tutorial-with-examples-d2c764600d6)\n* [SQL语言基础](https://www.runoob.com/sql/sql-intro.html)", "timestamp": 1655355472, "digest": "OE_CGx6BjCd-eQ441139sjsa3kTyUsmKVTclgMv09hY", "contributor": "0x365A9a61191F249Ba4f0d21263852Da78D6FAd7c"}
{"id": "4JyXtNx0M-WKeumdbPHisQ9Sr9TRO62UEdzqsrIGkfI", "title": "mirror", "body": "mirror", "timestamp": 1655355464, "digest": "kx56KCdbcpPYAw21xeMkDc5HH9Wj1N6_cXgOdcqeNWE", "contributor": "0xb556578B35aC1Bc734bd8Acb09197d4B8b645903"}
{"id": "k1nevMpjYmehwh3_DCsbacplrFLcA-_c8k-ZvY8mnPs", "title": "mirror", "body": "mirror", "timestamp": 1655355606, "digest": "zeZHWFAC10hfmDzh17ayJZSuHg7LD0sAWW6v8wsiN-8", "contributor": "0x2944dDB805C1f1E627aE5d2A580b2D50b4E043b1"}
{"id": "fbFlKdR2T__XN6CwqweXDQi1GTc-XKR2HtbQ7n7bWvg", "title": "mirror", "body": "mirror", "timestamp": 1655355749, "digest": "biIBhkVDKU--T_pTLxfnrLANssNeQe8jvGu1wJr2ouc", "contributor": "0xDc16B1Ee2AdF3213972DEE21d925960C03fdc684"}
{"id": "8pN-y_w7n2EUW0-KMMH1PNf6FC0QX7HX_0aHupl_hFE", "title": "mirror", "body": "mirror", "timestamp": 1655355879, "digest": "EEbxIKhNIHTTQMgCeY9w-nLCykJ5iBWPFmGVU5tij4Q", "contributor": "0xC498c597856F6cd440ed8aE1233988569f582FA6"}
{"id": "Lx_C_OCcqNLQm_vZU-uwTYtA7e-rnn5yT_qXYuC2IjA", "title": "mirror", "body": "mirror", "timestamp": 1655356036, "digest": "-6srSIH7afBtkOojiWPuG-gqpWM0bJStmlsiZKxNUiA", "contributor": "0x1f80BD5c6B7848e4203C822958219568c8bDe287"}
{"id": "A7Qeqqg1i2JNmvJXpm59b0PrcG2BBZ4EQ4UmXxKQipI", "title": "0616 STEPN 日記", "body": "昨日幣圈最大的瓜應該就是3AC三箭資本的health rate，兵臨城下的緊張刺激，但其實危機尚未解除，身為小散戶只能決定自己的幣要不要先換U起來保本，還是資金水位還可以逢低加碼，每個人對於風險承受程度都不同，得自己獨立判斷。\n\n對於更新的細節，跟大家體驗到的捲軸與寶箱改動差不多，Yawn也沒有因之前的放送事故被禁言，之後專業的公關也會交給CMO Shiti做口徑的一致。整體感覺STEPN從一個成功的web3小Project，格局慢慢轉變成一個影響力越來越大的公司，雖然幣價沒有回到之前的黃金年代，但如果能夠維持穩定，都是玩家們所樂見的。\n\n大餅BTC與二哥ETH的劇烈波動之下，最近大家都不好過，珍惜生命，遠離合約。\n\n## 鏈上數據分析\n\n![新增玩家維持穩定，近日都在15k上下](https://images.mirror-media.xyz/publication-images/bivnBnaFh5JWavfzNnZaf.png?height=778&width=1396)\n\n![增長量都差不多。](https://images.mirror-media.xyz/publication-images/jz5_gOajd8ls0EV5nAKX2.png?height=778&width=1394)\n\nAMA有提到預計再一個月日活DAU可以到1M，但這應該是累積玩家數，不確定日活的定義是什麼，或是還有其他沒抓到的資料。\n\n![出金量高於出金量，終止兩日的入金順差。](https://images.mirror-media.xyz/publication-images/jhggbppMf7smAVjE5-nSK.png?height=776&width=1394)\n\n昨天出金量又高於出金量，看起來把之前的差額都補上了，不確定是不是項目方忘記提手續費利潤，還是幣架回升的挖提賣出金潮，持續關注。\n\n![昨日新鞋數：5318，過去七日新鞋數：34491](https://images.mirror-media.xyz/publication-images/YV-cmAl-s677aPtd6QFEn.png?height=782&width=1396)\n\n鑄鞋卷軸在今日下午即將實裝上線，大家在還不需要捲軸前也是拼了一波mint鞋，雖然現在mint鞋還是虧，但之後需要捲軸的話，成本會更高，所以單日新鞋數增高是正常現象。\n\nDashboard link:\n\n[https://dune.com/maaax/stepn-statistic](https://dune.com/maaax/stepn-statistic)\n\n歡迎STEPN小夥伴追蹤我的Twitter，每日更新鏈上數據：\n\n[https://twitter.com/haomaaax](https://twitter.com/haomaaax)\n\n", "timestamp": 1655356421, "digest": "tjE2ALx-72bVbNKmg2jdN-dZALgivSdb71yR9I93qHU", "contributor": "0xFd047273e820c177A840DdB09A111cFE3fD806d3"}
{"id": "eeBR7-3kcyxeQgVb5y6BLUDIU_ePYu0lXSH61CYYTn0", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are thrilled to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655356629, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "mu7sc72JAxqhnMIuJVdNlFJrXsMhxdC38kJWNfKWsK0", "title": "Web3日报 0616", "body": "Web3日报 0616\n\n* 美联储加息75基点\n* 一地址被清算一万多枚ETH，一度被传为三箭资本地址\n* Celsius已聘请花旗集团就财务危机解决方案提供建议\n* 特斯拉、MicroStrategy在本轮熊市中已损失15亿美元\n* Q2，稳定币总供应量出现历史上最大幅度的下降\n\n更多见图\n\n![](https://images.mirror-media.xyz/publication-images/0yDketZhapYnyypIuU4fW.png?height=4518&width=780)\n\n", "timestamp": 1655356927, "digest": "pfen9oHGGaq09fUbsS1LQRXw3Gl2AkxToUufaIQL_oU", "contributor": "0xa4059EF885538373e236975f1Abc9e2F23b82715"}
{"id": "5bAUGgbU5eEGOmitN610YpCxRFPCiB9421IPym9RmWU", "title": "Introducing Showtime 2: Free NFTs, App Store launches & more", "body": "*Summary: we are thrilled to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”: the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655357010, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "9AmNJHztzzJMnq3rY_eivQLq-zY0Xtwa82F6criAWvc", "title": "Introducing Showtime 2: Free NFTs, App Stores launches & more", "body": "*Summary: we are thrilled to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”, the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655357344, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "eg-RY9TrgKiH7V5gx2XL03pzOorSGlVb3Eu7lZwMhoQ", "title": "6.15项目融资及项目进展汇总", "body": "![](https://images.mirror-media.xyz/publication-images/tbi3SXgRIpCNvnDyryzdT.png?height=736&width=1043)\n\n融资： 金融科技公司Flip完成5500万美元融资，腾讯领投 6月14日消息，印尼金融科技公司Flip完成5500万美元B轮拓展轮融资，本轮融资由腾讯领投，Block（前身为Square）和Insight Partners等参投，天使投资人包括Coinbase董事会成员Gokul Rajaram等。本轮融资资金将用于扩充Flip的工程和产品团队。 Flip首席运营官Gita Prihanto表示，目前已有数百家公司使用Flip的支付和汇款服务来处理员工工资、客户退款、发票/供应商付款和国际转账，Flip每年处理超过120亿美元的交易。（[techcrunch.com](http://techcrunch.com)） <https://www.jinse.com/lives/305418.html> \n\nWorld Innovation Lab完成10亿美元融资，新基金将投资Web3领域 6月14日消息，World Innovation Lab（WiL）宣布完成10亿美元融资，具体融资细节暂未透露。本轮融资资金将流入World Innovation Lab旗下多个基金，包括：WiL的第三个成长型基金WiL Ventures III、WiL风投基金WiL Strategic Partners、以及企业风投基金。据悉，WiL VenturesIII将在气候、健康、Web3及其他新兴技术领域进行投资。<https://www.jinse.com/lives/305419.html> \n\nPlayful Studios成立Web3子公司，并获由Paradigm领投的4600万美元融资 6月14日消息，游戏Wordswith Friends联合创始人PaulBettner的独立游戏工作室Playful Studios宣布成立Web3子公司The Wildcard Alliance，同时，The Wildcard Alliance还完成4600万美元A轮融资，Paradigm领投，其他投资方包括Griffin Gaming Partners和SabrinaHahn等。 The Wildcard Alliance联合创始人兼首席执行官PaulBettner表示，Wildcard首先关注的是乐趣，将打造下一代观众运动来欢迎整个社区的竞争者、收藏家、赞助商和粉丝一起娱乐。（prnewswire） <https://www.jinse.com/lives/305437.html> \n\nWeb3游戏平台Nefta完成100万美元融资，Picus Capital参投 6月14日消息，Web3游戏平台Nefta宣布完成100万美元融资，本轮融资由Picus Capital参投，该公司计划利用本轮融资资金与更多游戏工作室合作。Nefta主要为Web3游戏开发人员提供开发、发布和拓展工具，同时结合AI算法和区块链技术提供游戏经济解决方案。 <https://www.jinse.com/lives/305441.html> \n\nWeb3创作者工具开发商Tellie完成1000万美元A轮融资 6月15日消息，Web3 创作者工具开发商 Tellie 宣布完成 1000 万美元 A 轮融资，本轮融资 Malibu Point Capital、Galaxy Digital、Osage Venture Partners、Dapper Labs、SXSW Innovation Fund、Gaingels、Corazon Capital、TQ Ventures 和 Upfront Ventures 等参投。融资将用于在 Polygon 上推出 Tellie Collections NFT 市场。 <https://www.jinse.com/lives/305481.html> <https://www.prnewswire.com/news-releases/tellie-web3-starter-kit-for-creators-raises-10m-series-a-to-onboard-web2-creators-to-web3-301568110.html> \n\nNFT基础设施初创公司NFTPort完成2600万美元A轮融资 6 月 15 日消息，NFT 基础设施初创公司 NFTPort 完成 2600 万美元 A 轮融资，此轮融资由 Wise 联合创始人 Taavet 与 Teleport 联合创始人 Sten 以及欧洲风险投资公司 Atomico 共同领投。作为交易的一部分，Tamkivi 还将作为联合创始人加入 NFTPort。 NFTPort 总部位于爱沙尼亚，其通过基础设施建设帮助开发人员快速构建基于 NFT 的应用程序，此轮融资资金将用于扩展其平台并支持更多区块链。（[theblock.co](http://theblock.co)） <https://www.jinse.com/lives/305540.html> <https://www.theblock.co/post/152126/nftport-raises-funding-taavetsten-others> \n\nWeb3初创公司DAOLens完成500万美元融资，Nexus Venture Partners等领投 6月15日消息，Web3初创公司DAOLens宣布完成500万美元融资，Nexus Venture Partners、Better Ventures和iSeed II领投，Coinbase董事会成员Gokul Rajaram、Polygon联合创始人Sandeep Nailwal、Solana联合创始人Raj Gokal、Animoca Brands副总裁Simon Doherty和Tribe Capital联合创始人Arjun Sethi等参投。筹集资金将用于产品开发、人才引进，并推动其工具堆栈的后续推出。 据悉，DAOLens由Vikram Aditya和Apoorv Nandan于2022年1月创立，旨在帮助企业进行入职、贡献管理等工作来简化DAO的运营流程。 <https://www.jinse.com/lives/305541.html> <https://www.moneycontrol.com/news/business/web3-startup-daolens-raises-5-million-led-by-nexus-venture-partners-better-ventures-and-iseed-ii-8688611.html> \n\n项目进展： Dello与支付处理公司PandaPay合作推进智能加密支付 6月14日消息，总部位于加拿大的金融科技公司Dello与支付处理公司PandaPay合作，旨在让用户更容易地使用加密货币支付服务。 目前，Dello的加密支付应用程序已集成至PandaPay的智能终端上。现在，商家有了符合EMV的支付设备，能够在同一交易流中接受所有主要的信用卡和借记卡，以及不同的加密货币支付。（The Paypers） <https://www.jinse.com/lives/305415.html> \n\n跨链流动性聚合协议Via Protocol新增支持Arbitrum 6月14日消息，跨链流动性聚合协议Via Protocol宣布新增支持Arbitrum，此前已支持以太坊、Polygon、Optimism等网络。 <https://www.jinse.com/lives/305416.html> \n\nAxie Infinity将于7月推出Origin第二阶段 6月14日消息，Axie Infinity宣布将于7月份推出Origin第二阶段。在第二阶段中，冒险模式将完全重置，所有进度将被删除，玩家可以再次击败并获得奖励。 另外，MMR和排行榜也将被重置，部分AXS奖励将在此阶段结束时分配给排名前位的玩家。第二阶段结束后，Axie Infinity将从V2中移除SLP奖励，并将SLP奖励移至Origin。 <https://www.jinse.com/lives/305420.html> \n\n跨链桥O3V2版本现已接入Go+Security的Token安全检测数据 6月14日消息，据官方推特宣布，跨链桥O3V2版本现已接入Go+Security的Token安全检测数据，上线Token安全检测功能。用户在O3V2版本的Bridge、Swap、Hub里，点击Token后面的Go+盾牌，即可轻松进行安全检测。以规避可能遇到的风险。 Go+ Security作为Web3的“安全数据层”，提供开放、无需许可、用户驱动的安全服务。用户可以通过Go+Security查看基于合约的安全、交易安全、信息安全、Token检测、NFT检测、实时风险预警、交互安全等近30种安全检测结果。 <https://www.jinse.com/lives/305421.html> \n\n元宇宙基础设施公司Element.Black宣布其香港分公司获得数码港投资 6月14日消息，元宇宙基础设施公司 Element.Black 宣布其香港分公司获得数码港投资，Element.Black 香港分公司也将于 8 月落户数码港。 数码港是一个创新数码社群，汇聚超过 1,650 间初创企业和科技公司，其愿景是成为数码科技枢纽，为香港缔造新的经济动力。 <https://www.jinse.com/lives/305422.html> \n\nzkSync计划下周对V2测试网进行重大更新 6月14日消息，以太坊二层解决方案zkSync发推称，计划下周对V2测试网进行重大更新，目前暂不清楚具体更新细节。 <https://www.jinse.com/lives/305427>.\n\n映客集团拟更名“INKEVERSE映宇宙” 金色财经报道，6月12日，映客互娱集团宣布，已定于本月15日上午11时举行“破壁而来”品牌升级发布会，“INKEVERSE映宇宙”品牌将在此次的品牌升级发布会上亮相。，映宇宙的英文名称“INKEVERSE”由映客英文名称“INKE”和“VERSE”构成，VERSE既是单词（意为韵文、诗、诗节），也是Metaverse（元宇宙）中的verse。 <https://www.jinse.com/lives/305430.html> \n\nAnimoca Brands宣布成为GameFi生态项目Liberty Gaming主要投资者 6月14日消息，Animoca Brands宣布成为GameFi生态项目Liberty Gaming的主要投资者。Liberty Gaming包括一个游戏社区、一个P2E游戏公会，以及NFT和代币基金。（Globe News Wire） <https://www.jinse.com/lives/305432.html> \n\nLayer2协议Loopring宣布集成GameStop Wallet 6月14日消息，据Layer2协议Loopring发布的最新博客显示，Loopring现已与由美国电子游戏零售商GameStop（游戏驿站）推出的钱包GameStop Wallet集成。（medium） <https://www.jinse.com/lives/305439.html> \n\nFireblocks为NEAR上的机构投资者提供托管设施 6月14日消息，NEAR基金会与数字资产托管和结算解决方案提供商Fireblocks建立合作伙伴关系，Fireblocks将为NEAR上的机构投资者提供托管设施。（[near.org](http://near.org)） <https://www.jinse.com/lives/305440.html> \n\nStargate社区通过为STG质押者提供额外激励的提案 6月14日消息，基于LayerZero的跨链桥Stargate社区通过一项关于为STG质押者提供额外激励的提案，即，6bps（0.06%）的转账费用包括LP费用（1.0bp，若有释放，1.0bp转回至POL，若无释放，转至LP）、合作伙伴费用池（0.3bp）、veSTG持有者（1.0bp）、POL（协议拥有流动性，3.7bp）。 <https://www.jinse.com/lives/305446.html> \n\nBitfinex移动应用支持通过OpenPayd进行电汇存款 6月14日消息，Bitfinex移动应用发布V5.7.0版本，更新通过OpenPayd支付处理器支持银行电汇存款。 <https://www.jinse.com/lives/305448.html> \n\nHarmony正在开发Harmony-ETH跨链桥 6月15日消息，公链Harmony表示，正在开发无需信任的ETH跨链桥， 团队正构建代码。Harmony-ETH跨链桥将完全无需信任，改进我们当前的Horizon桥。 <https://www.jinse.com/lives/305450.html> \n\nMerit Circle社区通过投票结束与YGG的关系，并以175万美元回购所有代币 4月15日消息，链游公会Merit Circle社区通过投票终止了与Yield Guild Games的关系，以175万美元的价格买断了该机构投入的17.5万美元种子轮投资份额。此前，Merit Circle社区称Yield Guild Games自成为种子投资者以来未能为DAO提供价值，拟取消YGG的SAFT（简单未来代币协议），退还其初始投资资金，并移除其MC种子代币。 <https://www.jinse.com/lives/305453.html> \n\nWalletConnect宣布正在为Web3构建消息传递协议 金色财经消息，加密钱包WalletConnect宣布正在为Web3构建消息传递协议，第一步是连接web3生态系统中所有不同的钱包和应用程序，下一步是使这些钱包的用户在不同的链上使用不同的钱包相互聊天。 <https://www.jinse.com/lives/305458.html> \n\nOpenSea已迁移至新协议Seaport，预计Gas成本可降低约35% 金色财经消息，NFT市场OpenSea表示，正在改造其后端，已从Wyvern协议转向其自行开发的Seaport协议，预计Gas成本可降低约35%，新协议估计每年累计将为用户节省4.6亿美元以上的费用。 此前报道，OpenSea推出Web3市场协议Seaport。 <https://www.jinse.com/lives/305460.html> \n\n卡塔尔航空公司的元宇宙平台 QVerse 将整合 NFT 和购票功能 6月15日消息，卡塔尔航空公司的元宇宙平台 QVerse 将整合 NFT 和购票功能，为客户提供其产品和服务的独特沉浸式体验。 据悉，QVerse 平台于 4 月首次推出，使用 Epic Game 的虚幻引擎创建。客户可以虚拟参观哈马德国际机场 (HIA) 的航空公司高级值机区，以及航空公司飞机的机舱内部。未来 QVerse 可能会从 Decentraland 或 Sandbox 等其他元宇宙平台访问，并且可以使用 Oculus Quest VR 平台进行探索。 （coingeek） <https://www.jinse.com/lives/305466.html>\n\n Dogecoin 将启动 Libdogecoin 0.1 版本 6月15日消息，Dogecoin 团队将启动 Libdogecoin 0.1 版本，旨在通过 Libdogecoin 的第一阶段为RadioDoge、Gigawallet 以及许多未来生态项目提供基础服务。 据悉，RadioDoge专注于使用低成本无线电技术 (HF/LoRaWAN) 与全球 Starlink 卫星网络相结合，这将使狗狗币能够在不使用互联网的情况下进行交易。此前 4 月份该团队通过 RadioDOGE 在没有互联网的情况下发送的第一笔狗狗币交易。GigaWallet 通过将非托管钱包与 Dogecoin 网络集成，为用户提供即插即用的支付解决方案。（u.today） <https://www.jinse.com/lives/305470.html> \n\nMakerDAO披露stETH持仓详情及stETH清算价格 6月15日消息，MakerDAO披露协议持有stETH的数据详情：stETH抵押品约占所有DAI抵押品的3%，价值约2.6亿美元；WSTETH-A资金库锁定204,661.12WSTETH，价值2.432亿美元，8290万DAI总债务，293.42%的总体抵押；WSTETH-B资金库锁定9,014.31WSTETH，价值1070万美元，250万DAI总债务，424.42%的整体抵押。 Maker表示，对于WSTETH-A资金库，若stETH跌至892美元，价值3330万美元的stETH将被清算；若stETH跌至582美元，价值7460万美元的stETH将被清算。对于WSTETH-B资金库，若stETH跌至903美元，价值64.5万美元的stETH将被清算；若stETH跌至594美元，价值200万美元的stETH将被清算。 <https://www.jinse.com/lives/305472.html> \n\n去中心化DeFi应用Chainge Finance与1inch达成合作 据官方消息，去中心化DeFi应用Chainge Finance已完成与 DEX 聚合器 1inch 的整合。通过此次与 1inch 的合作，Chainge 用户将可以在数个网络上获得深度的跨链流动资金，这些网络包括：以太坊、BNB Chain、Polygon、Arbitrum、Optimism、Gnosis、Avalanche 和 Fantom。目前Chainge平台可交易币种提升至近 200 种。 <https://www.jinse.com/lives/305484.html> \n\nNFT聚合市场Genie集成OpenSea新协议Seaport据官方消息，NFT聚合市场Genie宣布与OpenSea的Seaport完全集成。 据此前报道，OpenSea将迁移至新协议Seaport，预计Gas成本可降低约35% <https://www.odaily.news/newsflash/288962> \n\nDogecoin团队将推出Libdogecoin 0.1版本Dogecoin团队将启动Libdogecoin 0.1版本，旨在通过Libdogecoin的第一阶段为RadioDoge、GigaWallet以及许多未来生态项目提供基础服务。 据悉，RadioDoge专注于使用低成本无线电技术（HF/LoRaWAN）与全球Starlink卫星网络相结合，这将使狗狗币能够在不使用互联网的情况下进行交易。 此前4月份该团队通过RadioDOGE在没有互联网的情况下发送的第一笔狗狗币交易。GigaWallet通过将非托管钱包与Dogecoin网络集成，为用户提供即插即用的支付解决方案。（U.Today） <https://www.odaily.news/newsflash/288960>  \n\nMark Cuba构建的NFT数字艺术馆Lazy.com集成WAX区块链 6月15日消息，亿万富翁Mark Cuban构建的NFT数字艺术馆Lazy.com宣布集成 WAX 区块链，增加用户购买、出售、交易和创造 NFT 的可访问性。 <https://www.jinse.com/lives/305486>.\n\nBlock公布建立比特币闪电网络基础设施的计划 金色财经报道，前Twitter首席执行官Jack Dorsey的Block团队宣布，该公司的TBD业务部门正计划建立一个比特币闪电基础设施。Block 产品设计师Nick Slaney表示，他将离开钱包团队，加入一个专注于构建闪电网络基础设施的专业团队。我们的目标不仅是为我们的产品构建所需的工具和基础设施，而且还要成为整个闪电网络生态系统的补充。 该团队宣布，与 Block 的其他以比特币为重点的产品一样，开发闪电网络基础设施的计划将包含来自社区的计划和意见，以及来自加密领域不同聪明人的想法。 <https://www.jinse.com/lives/305492.html> \n\n电子音乐制作人deadmau5与金融科技公司Zytara达成合作 6月15日消息，电子音乐制作人deadmau5与金融科技公司Zytara达成品牌合作。Zytara将使deadmau5粉丝能够获得deadmau5定制设计的实物借记卡和虚拟借记卡，可以在全球4500多万商家使用。此外，通过deadmau5品牌的金融科技应用程序，粉丝可以访问deadmau5的在线商店，购买其商品、音乐会门票以及游戏内商品。（Beincrypto） <https://www.jinse.com/lives/305505.html> \n\nEOS网络基金会发布由社区主导的EOS Mandel v3.1-rc1 版本 金色财经报道，EOS网络基金会发布EOS Mandel v3.1-rc1 版本。EOS网络基金会创始人和首席执行官Yves La Rose表示，4 年前EOS网络启动时创造了历史。另一个历史里程碑刚刚实现，因为EOS随着 Mandel 3.1 RC1 的发布，实现了重大飞跃，这是第一个由社区主导版本。 <https://www.jinse.com/lives/305509.html> \n\nNFT基金StarryNight将多个NFT转至新钱包，或与三箭资本相关联 6月15日消息，CoinMetrics分析师Kyle Waters发推称，过去24小时，三箭资本支持的NFT基金StarryNight已经将其在SuperRare平台上总计70件收藏品全部清空。自去年8月以来，该基金已花费2100多万美元购买这些NFT。 据悉，2021年8月，NFT收藏家Vincent Van Dough与三箭资本联合创始人Kyle Davis及首席执行官Zhu Su合作推出NFT基金StarryNight。其目标是筹集1亿美元，用于收集最好的NFT收藏品。该基金已收藏大量加密艺术品，其中包括一些知名作品，比如去年以超过100万美元价格成交的Lost Robbie。 其在SuperRare上的所有收藏品与Art Blocks、KnownOrigin、Foundation和其他加密艺术项目收藏品一起发送到一个地址。似乎正在进行某种形式的整合。新钱包疑似与其他三箭资本钱包有一些关联。 <https://www.jinse.com/lives/305511.html> \n\nTerra 社区关于”0.5% LUNA 紧急资金分配的分配方法”的提案已获得通过 6月15日消息，Terra 社区”0.5% LUNA 紧急资金分配的分配方法”的 446 号提案已获得通过，赞成票 3.04 亿（88.36%），该提案将支持 Agora 上列出的分配计划，并计划建立一个由长期 Terra 社区成员（Karma、Panterra0x、Cephii、Seb 和 GJ）组成的社区委员会。 此前报道，Terra 社区成员发起”0.5% LUNA 紧急资金分配的分配方法”的新提案，提议将有三个群体有资格获得紧急资金分配。 <https://www.jinse.com/lives/305538.html> \n\n资金流协议SuperFluid与Connext和Nomad合作，已开发出“跨链资金流”产品的工作原型 6月15日消息，资金流协议SuperFluid与互操作性协议Connext和Nomad合作，开发了一个“跨链资产流”（Cross-Chain Money Streaming）的工作原型，它使用Connext的SDK和Nomad构建，用于身份验证调用，允许用户将资金以流支付形式传输到网络上的桥接合约，然后从不同网络上的桥接合约接收资金。通过跨链资金流，DAO和加密原生组织可以使用Superfluid协议将价值按秒转移到他们想要的任何网络，而无需在任何特定网络上具有流动性。（Medium）<https://www.jinse.com/lives/305542.html> \n\n韩国游戏巨头WeMade将于8月1日启动Wemix 3.0主网 6月15日消息，韩国游戏巨头WeMade将于7月1日发布Wemix 3.0测试网，并搭载Wemix钱包和治理DApp，同时还将推出新的游戏平台Wemix Play。Wemade计划在经过彻底的稳定性验证后，于8月1日正式启动主网。 据介绍，Wemix 3.0旨在以40个去中心化节点为基础，设计成不受外部威胁的安全保护网络。从规划阶段开始，它的开发目标是成为一个可以将游戏和去中心化金融等区块链服务灵活集成到网络中的公链。 此外，Wemade计划于第三季度引入稳定币Wemix Dollar协议，启动Wemix DeFi服务，并推出DAO项目平台Nile。（每日经济新闻）<https://www.jinse.com/lives/305543.html> \n\n资管公司AllianceBernstein与Allfunds合作，为其欧盟全球平台提供区块链解决方案 6月15日消息，资产管理公司AllianceBernstein Holdings（AB）正在与金融科技公司Allfunds的Allfunds Blockchain部门合作，AB将把其全球运营活动连接到Allfunds Blockchain，以使其服务适应区块链生态系统，为AB的欧盟全球平台提供Allfunds区块链解决方案。（PR newswire） <https://www.jinse.com/lives/305552.html>\n\n想了解更多欢迎加入追风社区交流： \n TG：<https://t.me/CryptoDigger88> \n 币用：<https://0.plus/CryptoDigger88> \n Dis： <https://discord.gg/djHttK592U> \n Twitter：<https://twitter.com/ZF_lab>", "timestamp": 1655357382, "digest": "BbV6lyYm20hSXEeaedUaOm_26HdhRqTPQRG3yxtWRqA", "contributor": "0x3E8F9Ba0f81dfdbB154A2F51c3a44aaF1d86e844"}
{"id": "ePH_mxFZJywmsA2EnnuG1j3MLmEA6FI3F_Q5l_1RTAw", "title": "What is BuZhiDAO? \"不知DAO\"", "body": "This writing aims to introduce what **Bu Zhi DAO** is, how it came about, what we have planned for in the future and how you can get involved!\n\n### What is Bu Zhi DAO?\n\nOur official mission statement is **“Bu Zhi DAO is a collective of builders, creators and investors passionate about advancing Taiwan’s web3 ecosystem and culture“**\n\nIn more detail, BZD is a Taiwan focused DAO aimed to connect people in the web3 space who have a connection to or are passionate about Taiwan’s web3 ecosystem and culture. We want to build a fun and welcoming community that encourages genuine IRL connection, collaboration, helping each other, and having a blast along the way.\n\nThe name “BuZhiDAO” is a pun in mandarin, meaning “I don’t know”. We also want to help educate and promote web3 by creating public resources and content to help people learn more about web3, bridge different communities in web2 and web3, and share Taiwanese culture in the metaverse.\n\nConnect. Build. Educate.\n\n### How it came about..\n\nLike many DAOs, we started off as a group chat with frens from ETH Denver in February. After ETH Denver, we realized the powerful connection of builders and genuine people in web3 that we wanted to take this idea to its full fruition. The mission statement went through tens of iterations to get to where we are, not because we didn’t know what we wanted to do, but there was too much we wanted to do that it was so hard to encapsulate it well in a few sentences.\n\nThe group chat grew and grew from 4 people to close to 200, designed a logo, had meet ups in major cities in the US - NY / LA / Taiwan / SF and various conferences including Permission-less, Consensus, and NFT NYC.\n\n![LA](https://images.mirror-media.xyz/publication-images/qyxkfRHl_Y3VfdqCjPvKh.jpg?height=960&width=1280)\n\n![New York](https://images.mirror-media.xyz/publication-images/lUARWTQWWgv5OFSMgKgQK.jpg?height=960&width=1280)\n\n![San Francisco](https://images.mirror-media.xyz/publication-images/9KPw5X-S2F3y535frX5tx.jpg?height=960&width=1280)\n\n![Taiwan](https://images.mirror-media.xyz/publication-images/fK4QPA_5vSp01jJLsidDs.jpg?height=960&width=1280)\n\n### What are we building?\n\nWe defined our roadmap, made a pitch deck and fund raised 40 ETH for our $IDK tokens initial offering back in May.\n\n![](https://images.mirror-media.xyz/publication-images/0XTg6VsP615re3L0zfG0Y.png?height=660&width=1186)\n\nSince then, members have been working hard to continue to build and expand our community and fulfill the roadmap and beyond.\n\nOur first podcast episode talks about why we started this DAO with more background story and some of the vision. You can listen to the [preview](https://twitter.com/buzhidao_tw/status/1532769336628236293?s=20&t=cTIyTuGZ0TOn3CykX15VhQ) here and the full episode on multiple platforms on [Apple](https://apple.co/38L6HmW), [Spotify](https://spoti.fi/3tgmhOx), [YouTube](https://youtu.be/HKGe4dIhC0Y) with subtitles\n\n![](https://images.mirror-media.xyz/publication-images/anxht9pmSFDyXNvW4iwVt.jpg?height=720&width=1280)\n\nWe’ve also started a workshop series #想知道 to help people learn useful and relevant web3 topics\n\n![](https://images.mirror-media.xyz/publication-images/Gu3d29UtENVXhiL9t-QLn.jpg?height=1080&width=1080)\n\nOur first public facing event will also be happening during NFT NYC in collaboration with TAP NY - a perfect marriage for us considering our mission to bridge different Taiwanese communities and bring more people from web2 to web3. Would love for you to join us! [Pick up a free ticket here](https://www.eventbrite.com/e/proxy-presents-taiwan-crypto-night-with-tap-ny-x-buzhidao-tickets-358818625167)\n\n![Sponsored by Proxy: better chat and social platform for web3 where communities come together. ](https://images.mirror-media.xyz/publication-images/JeHVsFGphPAO7ehrZvFOX.png?height=720&width=1440)\n\n### Get involved!\n\nIt’s been an amazing journey for us seeing all these people coming together for this shared mission and selflessly contributing their time and effort, a separate post is required to share all the leanings and lessons we had along the way.\n\nIf this mission speaks to you and you want to contribute or connect with us, feel free to join our [Discord](https://discord.gg/p9agnPsApA) and introduce yourself! We welcome anyone to be a contributor where you can earn tokens for membership!\n\nIf you are interested in officially joining the DAO as a member, feel free to fill out this [membership application form](https://www.buzhidao.tw/application). We are currently organized into pods - Infra, Product, Growth and Capital to streamline what we’re building and we’d love for you to join our mission!\n\nHere is an early design of our personalized membership card (NFT + physical card) and merch!\n\n![Designed by Angela aka pugmama](https://images.mirror-media.xyz/publication-images/NKwSVME0VrsagcHcza_-H.jpg?height=864&width=1280)\n\n![Official BZD merch](https://images.mirror-media.xyz/publication-images/kcRTcy3neXrVtBgv16RgO.png?height=1288&width=1036)\n\nThank you for reading! Follow us on [Twitter](https://twitter.com/buzhidao_tw) to see all the dank memes and stay in the 知 DAO\n\n*(A big goal of ours was to help organize and sponsor ETH Taipei at the end of the year before it was recently cancelled due to quarantine and border control rules. We still plan to make something happen, if this is something of interest to you and your organization, do reach out! Let’s do something amazing for Taiwan)*\n\n![some members at the launch party](https://images.mirror-media.xyz/publication-images/Wo-TFBADq4EZ8oQ1qILJS.png?height=799&width=1894)\n\n", "timestamp": 1655357378, "digest": "sLgPf61oiltlQS7nwHeYsNBuWBJeuPcEb2yWPGMZasg", "contributor": "0xF146f3bf137683c6d2fE266F6a2DC352A615Eb0C"}
{"id": "NO1qAHc9Y7PA8y_N53yujkYnC3tZ0QRSHB6AzM6JDPw", "title": "Introducing Showtime 2: Free NFTs, App Stores launches & more", "body": "*We are thrilled to unveil Showtime 2, a web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”, the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655357384, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "WDL_XkN7dIe1vhk0QIUJ2l1YOynVcja8IYVq-mBU3QM", "title": "Introducing Showtime 2: Free NFTs, App Stores launches & more", "body": "*We are thrilled to unveil Showtime 2, a brand new web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”, the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655357364, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "-f3A7-ec2Ke769B9r8_iL7naARtbhzeSYOaFulGubsE", "title": "代币设计方法论：价值流", "body": "X to earn的一个潮流逐渐受到大家追捧，可惜的是很多系统的代币设计都不是很成功。其中的原因有很多，但是一个最重要的原因是无脑撒币：即简单的因为用户使用了平台就给予用户代币的行为是非常不靠谱的，这种设计通常忽视内容质量并且非常容易导致经济系统的失衡。一个好的代币系统应该有如下两个特点：\n\n1. 代币是为了激励目标的实现，而不能是目标本身。你的目标可以是激励好的内容，可以是用户增长，但是不能是简单的代币增值。\n2. 价值流清晰且可持续。当设计一个代币系统的时候我们必须搞清楚以下问题: 什么行为在为产品创造价值？什么行为在消耗价值？价值的产生和消耗的循环是如何实现的？这个系统是可持续的吗？\n\n这篇文章主要讨论第二项，即价值流的问题。我们将以现有的Web2基于广告的社交网络为例，根据它的价值流进行代币设计。\n\n## Step 1: 搞清楚价值来源\n\n大家都对当前社交网络基于广告的商业模式很熟悉了。在这个模式下，商家给社交网络付费，用户则免费使用平台，收入减去成本即社交平台本身的利润。\n\n![价值流图 v1.0](https://images.mirror-media.xyz/publication-images/Rp1tR76imv3xr0zJautjZ.png?height=506&width=2988)\n\n根据上图，人们很容易将商家作为社交网络的价值来源。有一种说法是，如果你没有给一个产品付费，那么你就是产品本身。但是，真的是这样吗？用户真的没有给社交网络付费吗？如果我们跳出社交网络为中心的视角，把它放在一个更大的商品经济的图景里，我们就能看出，上图的价值流，只是一个更大的价值流的一部分。\n\n![价值流图 v2.0](https://images.mirror-media.xyz/publication-images/Kvo2fwj0HkScdAvcDm9DH.png?height=1640&width=3154)\n\n一个更完整的故事是：商家在社交网络上打广告，用户通过社交网络从商家那里购买商品，商家把利润中的一部分划出来作为市场营销的支出付给社交媒体当广告费。事实上，社交网络的收入仍然是用户支付的，只不过商家倒了一手，付费用户看起来就像“免费用户”了！\n\n我将当前社交网络的这种特性称为**寄生性**，即社交网络是寄生在一般市场经济上的。寄生性主导的社交网络必须起到加速商品市场流通的作用，而非只关注用户的需求。用户是真正的价值来源，但是完整的价值流动被社交网络的寄生性掩盖了。\n\n## Step 2: 用户行为细分\n\n基本的价值流搞清楚了之后，我们就要做行为细分。这里要搞清楚的问题是，什么样的行为是创造价值的？什么样的行为是消耗价值的？\n\n对于上节提到的社交网络，我们可以将用户的行为细分为三类：\n\n1. **商品购买行为，**如浏览或者点击广告，这些行为为社交网络直接创造了价值\n2. **内容消费行为，**如浏览内容，这类行为没有为平台创造价值，并且消耗了社交网络的价值\n3. **内容创作行为，**这个情况比较复杂，如果创作的内容促成了商品购买行为(通过拉新或者转化)，它也为平台间接创造了价值，但是这种价值创造可能是具有“时差”的。一个视频可能刚发出来的时候无人问津，但是过了一段时间后大火。 \n\n这里我们需要注意广告模式和内容付费模式的区别。内容付费模式下，内容消费者作为主要的价值输入来源为其他人付费，而广告模式下，是最终的商品购买者为其他所有人付费。\n\n这个也解释了为什么社交网络很难做成订阅和广告的混合模式。在订阅模式下， 订阅行为直接为系统输入价值，然而，愿意订阅的用户往往也是可以通过广告转化为商品购买者的高价值人群，即这两种价值输入方式是互斥的。这些人一旦通过订阅来规避广告，广告的商业模式会丧失大量商品购买者，从而丧失价值输入渠道，从而让广告模式无以为继。这也给了我们一种判定不同商业模式优劣的方式，如果我们要颠覆当前的社交网络，一定要通过优化价值流的方式降低社会总成本，而不能简单的从广告模式转向订阅模式。\n\n## Step 3: 目标细分\n\n平台根据它的发展阶段细分，我们发现，平台不同的发展时期有不同的目标。\n\n社交网络早期首要目标是形成规模效应，因为规模效应本身可以带来用户增长。换句话说，”用户使用这个社交平台是因为其他人也使用这个平台“。换句话说，早期用户对平台的使用就是在帮助平台形成规模效应，就是在帮助平台做用户拉新和用户转化，也间接的为平台创造了价值，这个价值是由后进入的用户进行偿付的。据此我们可以根据阶段和行为做一个渐进的分析：\n\n1. **内容消费行为，**一直消耗价值，但是早期同时也创造价值\n2. **内容创作，**一直消耗价值，但是早期同时也创造价值，后期好的内容也可以创造价值\n3. **商品购买行为，**创造价值\n\n## Step 4: 代币设计\n\n现在很多Social to earn的项目本质上就是将我们上述所说的行为和价值代币化，从而达成平台增长和盈利的目标。这种带有社交属性的代币我们称之为社交代币，社交代币的价值是多方面的：\n\n1. **增加价值流动的透明度。**一个好的代币系统应该致力于将系统的价值流显化，从而提高价值流通的效率。\n2. **增加系统调节的灵活性。**我们可以调节系统的参数来平衡我们的目标，早期我们可以加大激励以提高用户增长，后期则要更加注重平衡性，系统参数不能是一成不变的。\n\n根据上节的行为和目标分析，一个最直接的代币设计方案是:\n\n1. **商品购买相关行为，**对用户进行代币奖励\n2. **内容消费行为，**早期免费或者对用户进行代币奖励，后期需要花费代币\n3. **内容创作行为，**早期免费，后期需要花费代币，但是根据内容的受欢迎程度系统会奖励内容创作者一定量的代币\n\n但是现实生活中，用户一般都是先成为内容消费者，后成为商品购买者。内容创作者也面临着相同的困境。一般来说，一个新的内容创作者前期的作品一般浏览量很少。让用户提前付费会极大的打击用户的积极性，影响用户增长。现有的系统都是用后期的营收覆盖使用成本，所以一个更加合理的方式是：\n\n1. **商品购买相关行为，**对用户进行代币奖励\n2. **内容消费行为，**早期免费，后期收费或者免费\n3. **内容创作行为，**在扣除成本的基础上据内容的受欢迎程度奖励内容创作者适量的代币\n\n## 总结\n\n### 原则\n\n1. 搞清楚价值流的来源和流动，确保价值流动是可持续的、自洽的\n2. 搞清楚具体的用户行为是在消耗价值还是创造价值\n3. 将时间的因素考虑进来，根据不同时期的不同目标来调整自己的模型\n4. 这个模型最好是可调的，可以将一些关键参数以一种合适的方式交给社区治理\n\n一旦我们搞清楚了价值流，就可以判断出一个X to earn的模型是不是靠谱。Social to earn未必不可行，但是我们需要确保我们只对那些创造价值的行为进行奖励，而不是无脑的对所有用户的所有行为撒币。\n\n### 局限\n\n1. 只讨论了三种简单的用户行为。社交平台的行为是多样化的，对于不同的行为我们都应该考察它们的价值流，从而才能得到一个全面的分析。我们甚至可以把非用户的行为纳入进来，比如投资人的投资、程序员的开发和线下的社区运营。\n2. 只是一种定性的分析。具体的代币设计应该根据具体的成本和预期收益进行量化的分析\n3. 如何判断一个内容是好的？如何判断一个内容带来了多少价值？这个需要社区想出一种更加创新的方法，但是早期的时候可以模糊一些，快速迭代调整", "timestamp": 1655357530, "digest": "nS4AG2e8VlxLMKLih7PXYAOsZnE0AXge-VtRpLvMe2w", "contributor": "0xdbCaf063873dC6be53c007Cf8f8447E303Cac8A3"}
{"id": "Mlj04191NKFIoEQIHc-nPsCUx4babE8geoWVXuySHRQ", "title": "【撸币养家】Nansen 一个非常优秀的区块链分析平台，未来值得期待", "body": "* 欢迎大家关注[@撸币养家](https://twitter.com/lubi1666)，了解更多空投讯息，保姆级空投教程，互相交流进步！\n* 推特账号：<https://twitter.com/lubi1666>\n\n![](https://images.mirror-media.xyz/publication-images/-ynS7QVdnR5oqOLH-I3Xl.png?height=895&width=1828)\n\n今天给大家介绍的这个项目是一个非常优秀的区块链分析平台【Nansen】，它把各大公链上数据和数百万聪明的钱包收集，不断的挖掘新的数据，做出的一个区块链分析平台，分析Smart Money（优秀投资人）钱包地址的行为和链上活动，查看资金流向、发现新项目或代币、精细化分析交易，快人一步知道投资信息。\n\n我相信随着区块链技术的发展，我们需要一些这样的平台，帮助我们在海量的信息里面，精准的找到我们需要的资源，有用的信息，而不是盲目，随机的大海捞针。利用好工具，对我们在WEB3.0 行里里面能更好的发展。\n\n今天主要是给大家介绍一下 【**Nansen】** 免费版本，能免费收获的一些信息，给我们提供的帮助。\n\n**一、**【**HOME**】\n\n我们能看到三个列表板块，分别是近期市场上热门的： **热门的Defi、热门的Token（代币）、热门的NFT，**  非常明确的能知道我们目前市场上的一些项目情况。\n\n![](https://images.mirror-media.xyz/publication-images/GWzMATMCzc_oEhXFYBqCV.png?height=519&width=1500)\n\n市场动态融资等信息\n\n![](https://images.mirror-media.xyz/publication-images/EW_3-FbmJ4GQsEXqMBexL.png?height=498&width=1475)\n\n**二、**【**NFT Paradise**】\n\nNFT 市场数据模块，过去市场24小时的NFT情况（包括NFT 的地板价格），来自于Opensea API 接口汇总。\n\n![](https://images.mirror-media.xyz/publication-images/i7xmW7y2V1duprhq0TEwx.png?height=907&width=1820)\n\n**三、【Stablecoin Master】**\n\n稳定币、交易所稳定币的余额，知名钱包和链上交易量指标等信息，可以通过面板查看（如图）\n\n![](https://images.mirror-media.xyz/publication-images/qxEPKnJXkSnokH3McQaPO.png?height=833&width=1514)\n\n稳定币的发展趋势\n\n![](https://images.mirror-media.xyz/publication-images/LwP3xlcXvjtsNbE-oLW5D.png?height=692&width=1521)\n\n**四、【ETH Tracker】**\n\n这个模块可以查看交易所的 ETH 余额，ETH链上交易情况。\n\n![](https://images.mirror-media.xyz/publication-images/pkBcbikGr_N7YxSuTBNQ7.png?height=896&width=1818)\n\n**五、【Gas Tracker】**\n\nETH 手续费Gas 图表，一目了然。\n\n![](https://images.mirror-media.xyz/publication-images/QMBNrxlThcPviLyABck1v.png?height=882&width=1830)\n\n六、【各大公链分析模块】\n\n如图\n\n1、ETH每天活跃地址，2、每天ETH 交易数据，3、ETH用户数量（交易所），4、实时统计ETH的交易（交易所）\n\n![](https://images.mirror-media.xyz/publication-images/QFvTY55ZOtEJtDmRsDzOb.png?height=867&width=1566)\n\n活跃的钱包\n\n![](https://images.mirror-media.xyz/publication-images/FU3zgMC0ST49q_kQf1oNc.png?height=930&width=1890)\n\n最近大家非常期待、火爆的奥德赛（arbitrum）链的数据，一览无余呀！\n\n![](https://images.mirror-media.xyz/publication-images/BJHvCQvtqvktm48IJbyal.png?height=922&width=1823)\n\n![](https://images.mirror-media.xyz/publication-images/GloXeV_xDpvyaAsR61-Eu.png?height=834&width=1371)\n\n![](https://images.mirror-media.xyz/publication-images/Khl3fBRg57S4mKqCPj2Gt.png?height=510&width=1518)\n\n这是我们比较实用的一些免费的模块，大家可以看看，现在免费注册，邮箱即可。\n\n大家猜猜它，未来会发行Token 吗？哈哈，会不会给早期用户意外空投呢，值得期待。\n\n**免费注册地址**\n\n[https://pro.nansen.ai/?utm_source=twitter&utm_medium=lubiyangjia&utm_id=TwitterKOL](https://pro.nansen.ai/?utm_source=twitter&utm_medium=lubiyangjia&utm_id=TwitterKOL)\n\n**融资信息 | 顶级投资机构A16Z 投资**\n\n![](https://images.mirror-media.xyz/publication-images/PyFt_otVeQZcpQPyn9Wy7.png?height=580&width=1658)\n\n[https://twitter.com/lubi1666/status/1537033829092761600?s=20&t=TlOn-mAeRAtQWt6TX_RNyg](https://twitter.com/lubi1666/status/1537033829092761600?s=20&t=TlOn-mAeRAtQWt6TX_RNyg)\n\n项目方推特：**[https://twitter.com/nansen_ai](https://ttps://twitter.com/nansen_ai)**\n\nDiscord：<https://discord.gg/z9Ruc8mY>\n\n官网：<https://www.nansen.ai/>", "timestamp": 1655357551, "digest": "JXa2DD1hKXI8dcCAubkMMaWJk7fxFHXR-XjDPjpRT6M", "contributor": "0x694db880a0929131FFC6ea87FeA878b5fAd39444"}
{"id": "Q1NVkmc2i4QzuZ_r_zbpp-2WSeLaO2LlEtr-0asT56w", "title": "Enter Showtime 2: Free NFTs, App Stores launches & more", "body": "*We are thrilled to unveil Showtime 2, a web3 social network on iOS, Android and web. Showtime 2 flagship feature is “Free NFTs”, the easiest way for a creator to drop a free NFT to their community – similar to POAP for crypto conferences. Showtime 2 is rolling out as we speak: Free NFTs is live this week at [showtime.xyz](https://showtime.xyz/).*\n\nFor the past six months, we’ve been quietly re-building our entire platform from scratch. This hard work paid off, and from now on it’s quite literally showtime for us: we will publicly launch many new features we think you’ll love.\n\nTo get yourself up to speed, here is some context on the state of our project until today:\n\n* **So far, Showtime showed a strong interest towards less financial and more socially-driven web3 products**. Since the original website launch (also known as *tryShowtime*) last year, we learnt a lot. Back then, NFTs had just gone viral. Dozens of thousands of digital art creators came to Showtime to curate, customize and showcase their art collection from all NFT platforms – all in one user-friendly interface. Although today’s NFTs are still mostly used as tradeable assets, *tryShowtime* was a sneak peak into a very bright future for web3 social networks.\n* **From now on, we will be testing out many web3 social features, starting with *Free NFTs*.** This past month, the NFT landscape has drastically shifted away from mindless speculation, and as always, we’re thinking ahead. We are launching *Free NFTs* imminently, letting anyone claim a free NFT from their favorite creator (more details later in this article). Next, expect new features you’ve never seen before. We are excited about non-financial primitives such as *creator tokens* (read our CEO Alex Masmej’s blog [on a16z](https://future.a16z.com/creator-tokens-and-community-tokens/)) and *[soulbound](https://newsletter.banklesshq.com/p/decentralized-society-desoc-explained?s=r) tokens*.\n* **We are committed to building a bleeding-edge web3 social network**. Despite the extreme market environment, we stay true to our mission: make a web3 product accessible and social. Success for us is simple: it means that people tell their friends to use Showtime. Thanks to our world-class investors such as Paradigm, Naval and 3LAU, we are fortunate to be playing the long game as a healthy company – in fact, we are currently hiring! [Check out our open roles here](https://www.notion.so/showtimeinc/Work-at-Showtime-Public-fa6282938e284134b302184062d7e329).\n\nNow that we caught up, let’s breakdown the major changes coming with Showtime 2.\n\n## From digital artists to web3 content creators.\n\nFirst, we realized that digital artists didn’t need *tryShowtime* as much as they used to. Since last summer, NFT marketplaces consolidated, OpenSea became the clear category winner, thus making “aggregating NFT marketplaces” not as relevant as it once was. Plus, digital art collectors represent only a dozen wealthy people per artist on average, a dynamic far removed from social networks like Instagram or TikTok, where popular creators engage with immeasurably larger audiences. Instead of having the occasional expensive trade, we focus on building lightweight, repeatable user interactions that feel familiar to people.\n\nSo we asked ourselves: if not digital artists, who today would benefit the most from a web3 social network? Our answer fits into what we call “web3 content creators”. Here are two examples of users we think may benefit from Showtime:\n\n* **Web3-curious musicians**. Musicians are infamously struggling to live off their passion. Not only do streaming services like Spotify don’t pay well, but their complete lack of transparency prevents artists to communicate and engage with their listeners. And unlike the dozen hobbyist collector per digital artist, musicians have thousands and even millions of hardcore fans (“[NFTs and a Thousand True Fans](https://future.com/nfts-thousand-true-fans/#:\\~:text=The%20thousand%20true%20fans%20thesis,bundle%20of%20distribution%20and%20monetization)“, [Chris Dixon](https://twitter.com/cdixon)). Music NFTs are nice collectibles, but what tool can we build for the millions of dedicated listeners who can’t afford expensive NFTs? This is what we at Showtime want to figure out.\n* **Tech-literate content creators**. Content creators also have a hard time monetizing their content, and tech-centered creators are more eager than ever to experiment with novel ways of engaging their communities. For example, [Adam Levy](https://twitter.com/levychain) is the host of Mint, a podcast discussing the web3 creator economy. Mint audience is crypto-native, so it wouldn’t be hard for his audience to experiment with new ways to create value and reward engagement. Adam gifted listeners “Participation NFTs” as a proof that they were early fans of the podcast.\n\nThose new personas provide a unique opportunity to go beyond buying and selling NFTs, and instead experiment with features that do not require existing capital, like earning digital assets for free.\n\nWith that in mind, we are proud to announce our newest feature: Free NFTs.\n\n## Free NFTs: Claim a free NFT from your favorite creator.\n\nWith *Free NFTs*, a creator can easily drop a NFT to their community via a shareable link. Our goal is to provide the easiest way for an average internet user to own their first NFT.\n\n* **You guessed it: free!** Free to drop, free to claim, zero gas fees.\n* **Grow your web3 audience:** each claimer will automatically follow you on Showtime, so creators will be able to engage with their holders.\n* **Creators make money only if fans make money:** thanks to EIP-2981, secondary sales on OpenSea and any Polygon-supported NFT marketplaces will earn royalties for their creators.\n* **Owned by creators:** each drop is a collection minted via [Zora](https://zora.co/) Editions, meaning that a creator has total control over their drop. They can display and sell it outside of Showtime, and even add features via tools such as such as [Guild.xyz](https://guild.xyz/) (NFT-gated group chats) or [Coinvise.co](https://coinvise.co/) (NFT-gated airdrops).\n\nThe rationale for *Free NFTs* is simple: **most people are currently priced out of NFTs**, so we need to kickstart their web3 journey in a way that doesn’t involve money. We want people to engage with their favorite creators and access experiences they couldn’t have before thinking about perhaps gain value someday. **For creators, they don’t want their web3 campaign to be seen as a cash grab**, but are always eager to engage with their audience in new and meaningful ways. And since they can add features to their NFT drop, they can create their own exclusive membership pass. Possibilities are endless for creators to make their drop a fun and attractive giveaway. And if the NFT ever resells, both the creator and their earliest fans make money together.\n\nWe can’t wait to see how creators will use *Free NFTs*.\n\n## A universal app (iOS, Android, web) powered by our open-source design system.\n\nAs we announced earlier, we took some time to make Showtime the most accessible web3 platform. Following that vision, our new app is available on web, iPhone and Android.\n\nAnd we’re open-sourcing our app: our frontend lead [Axel Delafosse](https://twitter.com/axeldelafosse) published our design system live at the App.js conference. [You can watch Axel’s talk here](https://www.youtube.com/watch?t=22190&v=te7bwfNsRKg&feature=youtu.be).\n\n![How to build a universal design system, Axel Delafosse at App.js.](https://images.mirror-media.xyz/publication-images/2Db88GmAfB5n1NFnmQACH.png?height=1914&width=3446)\n\n## Focusing on Showtime NFTs – the end(?) of marketplaces aggregation\n\nAs part of our changes, we took the decision to stop aggregating NFT marketplaces, and displaying only Showtime NFTs on our app. This includes our current marketplace and our new Free NFTs feature. This was a difficult decision to make: Showtime got its rapid start last year because it pulled NFTs from Opensea, Hic et Nunc and more. But as we noted earlier, the market has changed and instead of displaying collectibles, we believe that doubling down on our in-house web3 innovation is the best way forward. We may aggregate other NFTs again in the future, but for now, we believe it’s best to reduce our scope.\n\n––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––––\n\nWe as an ecosystem have a generational opportunity to break free from platforms like Facebook, and give the enormously valuable data they profit from straight to users. Primitives like NFTs, social tokens, non-transferable tokens and more will help us get there.\n\nSee y’all in the metaverse,\n\nThe Showtime team.\n\n*Follow us on [Twitter](https://twitter.com/@Showtime_xyz), [Instagram](https://instagram.com/showtime_xyz) and [Discord](https://discord.gg/gZs7yeWQ6Q) to stay tuned for our upcoming announcements.*", "timestamp": 1655357519, "digest": "MbRZIhlfgCgsQCGuBwE3f6CWtq8CGtiUp9ovB9E1NPA", "contributor": "0xE3fAC288a27fBdF947C234F39d6E45FB12807192"}
{"id": "Kuav3yUIZV39t7YtEFBUvbth_QT7WAm2koRlyArIqUo", "title": "代币设计方法论：价值流", "body": "X to earn的一个潮流逐渐受到大家追捧，可惜的是很多系统的代币设计都不是很成功。其中的原因有很多，但是一个最重要的原因是无脑撒币：即简单的因为用户使用了平台就给予用户代币的行为是非常不靠谱的，这种设计通常忽视内容质量并且非常容易导致经济系统的失衡。一个好的代币系统应该有如下两个特点：\n\n1. 代币是为了激励目标的实现，而不能是目标本身。你的目标可以是激励好的内容，可以是用户增长，但是不能是简单的代币增值。\n2. 价值流清晰且可持续。当设计一个代币系统的时候我们必须搞清楚以下问题: 什么行为在为产品创造价值？什么行为在消耗价值？价值的产生和消耗的循环是如何实现的？这个系统是可持续的吗？\n\n这篇文章主要讨论第二项，即价值流的问题。我们将以现有的Web2基于广告的社交网络为例，根据它的价值流进行代币设计。\n\n## Step 1: 搞清楚价值来源\n\n大家都对当前社交网络基于广告的商业模式很熟悉了。在这个模式下，商家给社交网络付费，用户则免费使用平台，收入减去成本即社交平台本身的利润。\n\n![价值流图 v1.0](https://images.mirror-media.xyz/publication-images/Rp1tR76imv3xr0zJautjZ.png?height=506&width=2988)\n\n根据上图，人们很容易将商家作为社交网络的价值来源。有一种说法是，如果你没有给一个产品付费，那么你就是产品本身。但是，真的是这样吗？用户真的没有给社交网络付费吗？如果我们跳出社交网络为中心的视角，把它放在一个更大的商品经济的图景里，我们就能看出，上图的价值流，只是一个更大的价值流的一部分。\n\n![价值流图 v2.0](https://images.mirror-media.xyz/publication-images/Kvo2fwj0HkScdAvcDm9DH.png?height=1640&width=3154)\n\n一个更完整的故事是：商家在社交网络上打广告，用户通过社交网络从商家那里购买商品，商家把利润中的一部分划出来作为市场营销的支出付给社交媒体当广告费。事实上，社交网络的收入仍然是用户支付的，只不过商家倒了一手，付费用户看起来就像“免费用户”了！\n\n我将当前社交网络的这种特性称为**寄生性**，即社交网络是寄生在一般市场经济上的。寄生性主导的社交网络必须起到加速商品市场流通的作用，而非只关注用户的需求。用户是真正的价值来源，但是完整的价值流动被社交网络的寄生性掩盖了。\n\n## Step 2: 用户行为细分\n\n基本的价值流搞清楚了之后，我们就要做行为细分。这里要搞清楚的问题是，什么样的行为是创造价值的？什么样的行为是消耗价值的？\n\n对于上节提到的社交网络，我们可以将用户的行为细分为三类：\n\n1. **商品购买行为**，如浏览或者点击广告，这些行为为社交网络直接创造了价值\n2. **内容消费行为**，如浏览内容，这类行为没有为平台创造价值，并且消耗了社交网络的价值\n3. **内容创作行为**，这个情况比较复杂，如果创作的内容促成了商品购买行为(通过拉新或者转化)，它也为平台间接创造了价值，但是这种价值创造可能是具有“时差”的。一个视频可能刚发出来的时候无人问津，但是过了一段时间后大火。\n\n这里我们需要注意广告模式和内容付费模式的区别。内容付费模式下，内容消费者作为主要的价值输入来源为其他人付费，而广告模式下，是最终的商品购买者为其他所有人付费。\n\n这个也解释了为什么社交网络很难做成订阅和广告的混合模式。在订阅模式下， 订阅行为直接为系统输入价值，然而，愿意订阅的用户往往也是可以通过广告转化为商品购买者的高价值人群，即这两种价值输入方式是互斥的。这些人一旦通过订阅来规避广告，广告的商业模式会丧失大量商品购买者，从而丧失价值输入渠道，从而让广告模式无以为继。这也给了我们一种判定不同商业模式优劣的方式，如果我们要颠覆当前的社交网络，一定要通过优化价值流的方式降低社会总成本，而不能简单的从广告模式转向订阅模式。\n\n## Step 3: 目标细分\n\n平台根据它的发展阶段细分，我们发现，平台不同的发展时期有不同的目标。\n\n社交网络早期首要目标是形成规模效应，因为规模效应本身可以带来用户增长。换句话说，”用户使用这个社交平台是因为其他人也使用这个平台“。换句话说，早期用户对平台的使用就是在帮助平台形成规模效应，就是在帮助平台做用户拉新和用户转化，也间接的为平台创造了价值，这个价值是由后进入的用户进行偿付的。据此我们可以根据阶段和行为做一个渐进的分析：\n\n1. **内容消费行为**，一直消耗价值，但是早期同时也创造价值\n2. **内容创作**，一直消耗价值，但是早期同时也创造价值，后期好的内容也可以创造价值\n3. **商品购买行为**，创造价值\n\n## Step 4: 代币设计\n\n现在很多Social to earn的项目本质上就是将我们上述所说的行为和价值代币化，从而达成平台增长和盈利的目标。这种带有社交属性的代币我们称之为社交代币，社交代币的价值是多方面的：\n\n1. **增加价值流动的透明度**。一个好的代币系统应该致力于将系统的价值流显化，从而提高价值流通的效率。\n2. **增加系统调节的灵活性**。我们可以调节系统的参数来平衡我们的目标，早期我们可以加大激励以提高用户增长，后期则要更加注重平衡性，系统参数不能是一成不变的。\n\n根据上节的行为和目标分析，一个最直接的代币设计方案是:\n\n1. **商品购买相关行为**，对用户进行代币奖励\n2. **内容消费行为**，早期免费或者对用户进行代币奖励，后期需要花费代币\n3. **内容创作行为**，早期免费，后期需要花费代币，但是根据内容的受欢迎程度系统会奖励内容创作者一定量的代币\n\n但是现实生活中，用户一般都是先成为内容消费者，后成为商品购买者。内容创作者也面临着相同的困境。一般来说，一个新的内容创作者前期的作品一般浏览量很少。让用户提前付费会极大的打击用户的积极性，影响用户增长。现有的系统都是用后期的营收覆盖使用成本，所以一个更加合理的方式是：\n\n1. **商品购买相关行为**，对用户进行代币奖励\n2. **内容消费行为**，早期免费，后期收费或者免费\n3. **内容创作行为**，在扣除成本的基础上据内容的受欢迎程度奖励内容创作者适量的代币\n\n## 总结\n\n### 原则\n\n1. 搞清楚价值流的来源和流动，确保价值流动是可持续的、自洽的\n2. 搞清楚具体的用户行为是在消耗价值还是创造价值\n3. 将时间的因素考虑进来，根据不同时期的不同目标来调整自己的模型\n4. 这个模型最好是可调的，可以将一些关键参数以一种合适的方式交给社区治理\n\n一旦我们搞清楚了价值流，就可以判断出一个X to earn的模型是不是靠谱。Social to earn未必不可行，但是我们需要确保我们只对那些创造价值的行为进行奖励，而不是无脑的对所有用户的所有行为撒币。\n\n### 局限\n\n1. 只讨论了三种简单的用户行为。社交平台的行为是多样化的，对于不同的行为我们都应该考察它们的价值流，从而才能得到一个全面的分析。我们甚至可以把非用户的行为纳入进来，比如投资人的投资、程序员的开发和线下的社区运营。\n2. 只是一种定性的分析。具体的代币设计应该根据具体的成本和预期收益进行量化的分析\n3. 如何判断一个内容是好的？如何判断一个内容带来了多少价值？这个需要社区想出一种更加创新的方法，但是早期的时候可以模糊一些，快速迭代调整", "timestamp": 1655357899, "digest": "HHU-uRD5b00QhuPHhcHwYaYFTcqnSSnGfeDT2NzrNgU", "contributor": "0xdbCaf063873dC6be53c007Cf8f8447E303Cac8A3"}
