{"id": "fIaxpia79jTmLs520pQntzTpoXxEx3pw_IIHpQibm4c", "title": "What is web3", "body": "web3 is the child of web2 and bitcoin. It's a fork of Nakamoto’s blockchain that combines the speed and progress of our technology stack but the values and principles of web1.\n\n![](https://images.mirror-media.xyz/publication-images/819rNg8x_abPDEBZnO5jn.jpeg?height=563&width=1000)\n\nIn 1989 Tim Berners-Lee created the Internet as we know it, with the vision that it should be an open digital network available to all people. This vision allowed the creation of the first open protocols such as HTTP (web pages), SMTP (email), RSS (news), TCP/IP, etc. They were the pillars to build all the digital services and products that we know of.\n\nBut these protocols were limited in functionality and user experience, which led to the emergence of closed platforms that leveraged this open systems to create private networks. By offering better software experiences for free and with venture capital tactics they managed to grow very fast and attract millions of people to its platforms. This evolved and eventually they had so much information about its users that powerful players emerged and with them, an evil business model of personal information exploitation.\n\nEventually, the strategies of these products and services created networks that do not equitably distribute the generated value. They just extract and exploit information that they subsequently monetize.\n\nWeb3 and crypto is a movement that wants to better redistribute the value of our information through a new system based on open source and decentralization. What allows this movement is a new paradigm that proposes a new type of computer. It is a virtual computer that always works and can make commitments about performing actions (smart contracts). It’s maintained by all of us and no one can turn it off or manipulate it.\n\nThe main values ​​proposed by the web3 computational paradigm are the following:\n\n**Privacy**: Although everything in the blockchain is public, privacy refers to not giving our personal data necessarily whenever we use a service, since these data, apart from being private, also has economic value that corporations exploit with our consent or participation.\n\n**Portability**: Through tokens or nft we can now own digital assets. This implies that they are not on a 3rd party private server. This reduces the switching costs that are so high in web2 monopolies, for example, in theory you would be able to move your digital audience to another network. Greater portability means more services that compete among for better quality options and lower commissions. \n\n**Composability**: web3 is primarily about open-source code. These dapps will run forever and cannot be modified. The fact that they are really open invites other entrepreneurs and programmers to build upon them with the confidence that they will not will change because they don’t align anymore with the commercial strategy of a founder. The number of projects that never existed due to the limitations of these closed platforms is incalculable. With web3, hundreds of creative innovations will emerge. For example, there are already defi lending protocols that are open source and are on the blockchain, operating as protocols. In this way, any application will be able to make use of them and create better experiences for the user.\n\n**Identity**: The concept of identity in web3 is that it is ours and we have full control over it. We don’t have to delegate it to centralized entities so that they can exploit it. The idea is that your audience, your content and your data are yours and you can move, hide and modify it. Identity in web3 is now a cryptographic wallet that holds your assets, certificates, social graph and much more.\n\n**Ownership**: Thanks to NFTs we can own the non-fungible, that is, owners of absolutely everything that exists in the digital world. By being the owner, we are also part owner of the networks in which we participate and we have rights over that property. Rights to use it, sell it, rent it, and also gives us the right to vote and governance.\n\nWeb3 is about finance, it's about open economies, about owning the data, about owning", "timestamp": 1657624682, "digest": "17udvR2vN4P7xi-3v4n6Qb88N8zHBpDZhcChk2jeRRM", "contributor": "0x7E0b0363404751346930AF92C80D1fef932Cc48a"}
{"id": "m7uNG_08RTwv3gZJOEgY6pF53ZKjRe2d5PKW9b_SZ-4", "title": "Web3.0-知识学习资源", "body": "在2014年，dot波卡创建人提出web3.0概念\n\n在18年就接触区块链，但由于当于区块链应用还比较少，特别是数字货币处于炒状态，对于web3.0没有太多关注。\n\n2021年由于块链的火爆，开始正式进入区块链，因为这个时候区块链行业已不再只是虚炒了，而是有很多应用，而区块链技术也成为web3.0最重要的技术。\n\n一句话web3.0是一个基于区块链的互联网。\n\n从进入区块链开始，我开始了疯狂的学习web3.0的过程，所以我会把学习的好的资源分享供大家参考，我会不断的更新。\n\n**一、YOUTUBE上学习资源**\n\n**1、web3投资研究**\n\n鉴叔(J Club)\n\nVIC talk\n\nmr block 区块先生\n\n钻石手DiamondHands：专注于价值项目深度分享\n\nAll For Research\n\nMetaMania(专注于NFT）\n\n**二、开发相关**\n\netherscan.io  区块链浏览器，查合约地址、验证合约是否成功。\n\ndappradar.com\n\n智能合约开发框架：Hardhat(javascript) Truffle(javascript) Brownle(python)\n\n**二、web3.0工作相关**\n\nweb3.0时代的工作最大特点是可以远程。\n\n1\\.remote3.co\n\n[https://remote3.co/](https://remote3.co/)\n\n2\\.web3.career\n\n[https://web3.career/](https://web3.career/)\n\n在最后附上vic列的项目分类\n\nDefi系列-入门级去中心化交易所深度解读（uniswap&sushiswap） .\n\nDefi系列-借贷赛道的多维度发展和算法稳定币（Aave&compound&spell）\n\nDefi系列-Defi的造血机器（Curve&Convex）\n\nDefi系列-流动性管理解决方案（tokemak&ohm）\n\nGamefi系列-gamefi的发展历程和龙头项目（axie、星鲨）\n\nGamefi系列-gamefi游戏中的元宇宙（sand、mana、neos）\n\nNFT系列-NFT项究竟有什么价值？（punk、bayc、azuki、otherseide土地、Ape）\n\nDAO赛道系列-什么是DAO？目前web3.0中DAO的发展现状（ant、bitdao)\n\n底层基础设施系列-跨链（layer0、anyswap）\n\n底层基础设施系列-区块链存储（fil、ar）\n\n底层基础设施系列-l2协议（op、arb、polygon)\n\nSocialfi系列-Socialfi有什么价值？为什么我们需要web3社交（ENS）\n\nSocialfi系列-Socialfi的发展现状（lens、cyberconnect\\\\5degrees）\n\n底层基础设施系列-Web3.0世界的流量入口（galaxy、兔子洞）\n\nNFT交易平台--（Opensea、looksrare、x2y2)\n\nNFT借贷平台-（BendDAO、Jpeg、NFTX、NFTFI、FLOORDAO）", "timestamp": 1657624751, "digest": "cFywTcLSauNQjyAcTuJdIAKP-bsOBd5NsDfTOZi8SF8", "contributor": "0x8d5b2fb2610ca51fd336e8262519802c380EB16E"}
{"id": "FuFGrRRrz2-lhoGzd25BLkQ20Kos1Vo52RblJnADUUg", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs.", "timestamp": 1657624812, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
{"id": "Huhk2j0IAPs6rXO5Xfr5c9ahNONV6Cj6nr66o6X_2_o", "title": "10 Keywords for the Next Crypto Bull Market's New Narrative", "body": "When it comes to \"narrative\", we usually understand it as \"storytelling\". Not really.\n\nNarrative Economics, the latest book written by Nobel prize-winning economist Robert Shiller, provides us with a brand-new perspective. Shiller discovered the critical role of \"narrative\" in financial asset pricing and market volatility: events themselves may not be important, but the way the \"story\" is processed, encoded, processed, and embellished matters a lot. If the same event is interpreted from different perspectives, at different levels, and with different logic, the impact on financial markets will be completely different.\n\nIn this regard, the crypto market is inherently financial, and constantly looking for new narratives, which is an important way to attract funds and talents. Only when funds and talents continue to enter the market can new narratives be realized.\n\nSo, the new narrative creates new room for growth. It is crucial for crypto practitioners to discover and anticipate the new narrative of the future to make respond and layout in advance.\n\nSince 2020, we have witnessed the rise of DeFi, the emergence of NFTs, the popularity of GameFi, the nationwide pursuit of the metaverse, the implementation of Layer 2, the madness of the new public chain, etc. These narratives in different fields facilitate the rapid growth of the crypto market.\n\nThe concept of Web3 is ambitious. The research team of Cryptogram Venture (CGV) tries to figure out the key clues that belong to new narratives of the next crypto bull market from the perspective of the needs of segmented scenarios and the pain points and trends of the current crypto industry.\n\n![10 Keywords for the Next Crypto Bull Market's New Narrative](https://images.mirror-media.xyz/publication-images/UCD0wfgoCoan5lPCh3Nqn.png?height=486&width=830)\n\n 1. **Soulbound Token**\n\n    **Scenario A:** Traditional financial markets are built on credit. In the crypto lending market, it is difficult for individual borrowers with insufficient collateral to obtain mortgages due to technical limitations in proving an individual's or institution's ability to repay the loan.\n\n    **Scenario B:** DAOs may face a huge threat in the event of sybil attacks, where individuals or groups accumulate large amounts of governance tokens and manipulate votes on proposals in their favor.\n\n    **Scenario C:** If users lose the wallet's secret key, it will result in a permanent loss of access to the wallet. Is it possible to recover the secret key by transferring control of the lost account to the new secret key through social networks such as friends, family, and other contacts?\n\n    In May 2022, economist and sociologist E. Glen Weyl, lawyer Puja Ohlhaver, and Ethereum founder Vitalik Buterin proposed Soulbound Token (SBT).\n\n    The concept of \"soulbound\" originated from the multiplayer online role-playing game \"World of Warcraft\". Most of the powerful props in this game are soulbound. Once the soulbound props are picked up, they cannot be transferred or sold to other players.\n\n    SBTs are known as the components of the original foundation in the Decentralized Society (DeSoc) Web3 trend. Similar to resumes or medical records in the non-Web3 world, SBTs are non-transferable tokens that represent the \"commitments, credentials and affiliations\" that make up the social relationships on a Web3 network.\n\n    With the help of SBTs, the issue of insufficient mortgage loans can be well solved by developing a provable reputation system; the issue of sybil attacks on DAOs can be well solved by checking the correlation between voted Souls and held SBTs. Besides, SBT will play an important role in scenarios such as social wallet recovery, airdrop mechanism optimization, GameFi levels, standings, and special skill binding.\n\n    CGV deems that the proposal of SBT may create a richer Web3 world for users, that is, integrating real social structures (such as families, churches, teams, companies, etc.) into Web3, not just the financial system (DeFi).\n 2. **Zero-Knowledge Proof**\n\n    Scenario D: To protect the privacy of users, how do data analytics companies manage to draw conclusions on data analysis without seeing data or addresses?\n\n    Scenario E: DeFi users do not want their property transactions to be viewed or tracked by others. What should they do?\n\n    Zero Knowledge Proof (ZKP) is a method by which the prover can prove to the verifier that a given statement is true while the prover avoids conveying any additional information apart from the fact that the statement is indeed true. Zk-snark and ZK-Stark are two of the most widely used technologies after ZKP mechanism is transformed into computer programming languages.\n\n    In 2021, Vitalik said in an article, “Perhaps the most powerful cryptographic technology to come out of the last decade is general purpose succinct zero knowledge proofs, usually called zk-SNARKs.”\n\n    As one of the main usage scenarios of ZKP, privacy is classified into transaction privacy and data privacy.\n\n    For a long time, many people have wondered: Why is the privacy issue big on promises and short on action? The number of users and usage is not large, and many people even think that privacy is a false proposition. In the Web3 era, we have seen the emergency of various applications such as DeFi, NFT, GameFi, and SocialFi, and the chains have more and more features. Simple anonymous transfers can no longer meet people's needs for privacy.\n\n    In a transaction, if you have to prove that you own an unspent asset, but you do not want to reveal the entire source of the asset, ZKP can solve the information leakage caused by transaction transparency, such as transfer address and amount. It is quite important for financial applications such as currency payments, hedge funds, exchanges, and P2P. Projects such as Manta Network, Aleo, and NYM deserve attention.\n\n    In terms of data protection, many projects protect data privacy (blockchain hybrid architecture) via trusted execution environment (TEE), multi-party secure computing, etc., such as identity information, medical information, etc.\n\n    With the increasing requirements for the protection of user data and the expansion of cryptocurrency usage, the prediction of renowned investor Naval Ravikant - the inevitable endpoint of crypto is maximum decentralization and maximum privacy - may gradually become a reality.\n 3. **Modularity**\n\n    Scenario F: Currently, L2s based on ETH Rollup mainly include Arbitrum, Optimism, Starkware, Zk-sync, Polygon, Aztec, Boba, Metis. In the future, there may be 10 to 20 new rollups, and there may be strong liquidity fragmentation between these L2s.\n\n    Scenario G: A secondary market that allows the trading of existing DeFi options has not yet been established. The secondary market with liquid DeFi options could become a reality if a viable limit order book exchange is achieved and the minimum segment size for trading is reduced (by lowering transaction costs). \n Scenario H: Arbitrum, one of the most popular Ethereum Layer 2 scaling networks, opened the second phase of the Odyssey activities. Due to high gas costs caused by heavy load on the chain, Arbitrum announced the suspension of Odyssey activities. Embarrassingly, Arbitrum's main goal is to significantly reduce gas costs to improve user experience.\n\n    It is generally believed that a single public chain has the problem of \"impossible trinity\", and it is difficult to achieve security, scalability, and decentralization simultaneously. Modularity is essentially a vision centered on scaling solution, a solution to the \"impossible trinity\".\n\n    The modular public chain is to modularize the techniques, applications, rules, and standards of the public chain. Each module is a blockchain, and they are responsible for different features (such as execution layer, consensus security layer, data availability layer, DEX application chain, stable currency application chain, NFT application chain, derivative application chain, etc.). It is convenient for different project developers to match processing solutions according to their needs.\n\n    For example, transactions are executed through high-speed rollups, the secure settlement layer handles settlement, and the low-cost and high-volume data availability layer deals with security.\n\n    In fact, the modular public chain is not a new concept. With the maturity of the Ethereum Layer 2 solution, it has gradually attracted the attention of the industry.\n\n    Currently, the Ethereum Layer 2 solution is not a panacea. The Optimism and Arbitrum have encountered major issues one after another, indicating that Layer 2 is still in an infancy stage. With the influx of users, various bugs may appear.\n\n    Therefore, the first generation of smart contract platforms represented by Ether, which tries to do everything from data storage to Turing complete on one platform, has a long way to go. In the future, we will see the stack break down into data availability and consistency, block validation and construction, transaction ordering and block proposal, and multi-purpose or directed computation. Projects such as Celestia and Assembly have been fully explored.\n\n    We believe the composability of blockchain technology, from DeFi to modular public chain, will enrich the crypto world.\n 4. **Hyperautomation**\n\n    Scenario I: The V3 released by Uniswap improves the refined operation of LPs, but both LP farmers who want to earn transaction fees and project teams who want to better motivate their token liquidity often run into trouble beyond liquidity.\n\n    Scenario J: For loan users, they do not want to be liquidated by the platform in the event of drastic changes in the market. If one is able to set the collateral/debt ratio, once it falls below the threshold set by the user, one would like the platform to sell some of the collateral to pay off the debt, thus keeping as much collateral as possible for the user.\n\n    Scenario K: In GameFi projects, players are required to pay gas fees for the creation and execution of transactions. If users don’t have enough network token balances, or transactions get stuck due to a sudden spike in gas fees, players can’t stay in the game, resulting in high bounce rates.\n\n    The traditional financial services industry is full of complex processes, transactions, and payments connecting clients, buyers, dealers, regulators and other stakeholders, often resulting in high manual reliance on process management issues, which makes automation increasingly important for providing a seamless client experience.\n\n    \"Hyperautomation\" has become an effective tool for improving efficiency in the traditional financial industry. It refers to the effective combination of machine learning, process mining, API integration and intelligent workflow orchestration to automate the delivery of services to clients without high complexity. Business process automation tools and artificial intelligence technology are the two cores of hyperautomation.\n\n    In the world of Web 3, especially in the field of DeFi, there are a host of features that need to be triggered periodically or under specific conditions, such as periodic revenue reinvestment, periodic payroll, liquidity rebalancing, etc. The project team hopes to automate these behaviors and improve the efficiency and usage experience of the protocol,\n\n    such as stablecoin protocols for automatic revenue reinvestment, aggregation protocols for arbitrage trading, NFT shard protocols for distributing pledge rewards, and money management protocols for paying DAO members' salaries.\n\n    If the project party establishes the entire robot program to trigger the operation of the smart contract, it will take lots of time and cost to establish, operate and maintain it. In this regard, DeFi developers can outsource their web3 DevOps needs and focus on building core products. It creates large market space for automation service providers, such as Gelato, Chainlink, and KP3R, etc.\n\n    For example, Gelato Relay helps Web3 application and infrastructure developers employ simple APIs to quickly, cost-effectively, and reliably mine arbitrary transactions on behalf of their users or protocols, enabling use cases such as gas-free transactions, solving common user experience issues such as the need to switch between multiple networks or concerns about stuck transactions.\n\n    CGV holds that in the long run, if smart contracts in the Web 3 world can make real-time, safe and fast responses to specific scenarios in the real world and the Web 2 world, and build a bridge between the real world and Web 2 APIs and Web 3 smart contracts, hyper-automation will have a more promising future.\n 5. **External Market**\n\n    Scenario L: The emergence of Web3 and the popularity of NFTs have made many people enthusiastic about the encryption market, but they generally do not have a good understanding of the encryption market, and the threshold for registering digital wallets and completing on-chain transactions is high.\n\n    Scenario M: Some public chains and DeFi protocol developers face hundreds or even dozens of active users every day, and fail to expand their customer base.\n\n    Scenario N: Some traditional manufacturers and Internet companies intend to integrate NFT technology with their business to build new business models. Additionally, many NFT ecological service providers are competing for the stock market of encrypted users. Can the demands of the two be reconciled?\n\n    From the perspective of economics, the impact of a private economic behavior on social welfare is called externality.\n\n    The CGV research team reviewed the history of the crypto industry and found that every magnificent bull market is inextricably associated with the burst of a specific externality market.\n\n    Before 2018, the miners, computing power market, digital currency trading, and exchange market were the main elements of the crypto industry. From 2018 to 2020, with the rise of DeFi summer, liquidity providers, pledges, and insurance markets were in full swing. Since 2021, X-to-earn market, Guild market, NFT creation market have become the best testing ground for creating a crypto externality market.\n\n    For example, StepN, based on the user's pursuit of health through running, has encouraged hundreds of thousands or even millions of people who have never been exposed to the crypto world to create digital asset wallets, and popularized basic DeFi operations. Axie is just a battle game, but it has nurtured the thriving Guild economy. Some guilds have become inclusive financial service facilities in Southeast Asia. AYC has huge externalities and uses NFTs to form a large group of high-net-worth investors.\n\n    From the perspective of Web3, token has high liquidity, high openness and composability, making Web3 products and agreements generate unexpected external market.\n\n    Looking forward to the next cycle, public chains, NFTs, and DeFi may be the first batch of key areas to trigger a new wave of externality markets.\n\n    Taking StepN, which used to rely on Solana, as an example, it has successively become the largest NFT trading market on Solana and the DEX with the highest transaction volume, etc., attracting hundreds of thousands of new users to the Solana ecosystem, which in turn \"nourishes\" the competitiveness of the public chain. It is believed that in the future, there will be many applications similar to StepN, and their support for different public chain ecologies may influence the competitive pattern of the public chain.\n\n    Besides, NFTs are not just PFPs used to show off or socialize business cards. Most NFTs represent a subculture or meme color, which gives people a sense of belonging. What NFT can achieve in the future is to reach the goal of a license-free community in a value-added way.\n\n    NFTs may become the best tool for connecting the real economy and the cryptoeconomy, but they are often overlooked by today's NFT ecosystem.\n\n    In the real economy, the user portraits of many products are different, and the data between products and companies are not interconnected. The users of Company A and Company B may be highly overlapped. With the help of NFT tools, companies can better target users, making it easier for users to find tribes and optimizing the process of exchanging signals with others, which is bound to create more new externalities to the crypto industry.\n\n    For example, many business entities can offer unique discounts based on the historical record of the wallet. It is something a traditional membership card cannot do. How amazing it would be if the owner of a BMW model used NFTs to get discounts on products like LV, Apple, or even a real estate property without having to get authorization from a different brand owner.\n\n    Similarly, in terms of Cefi and DeFi, whoever can attract more external capital will have more say in the financial markets.\n\n    Since its establishment, the FTX trading platform has constantly made efforts and achieved results in compliance. SBF has said that although compliance would slow down the development and expansion in the short term, it facilitates stable and long-lasting business expansion in the long term. FTX focuses on compliance development because it attaches great importance to the development of externality markets.\n 6. **X to Earn 2.0**\n\n    Scenario O: From Axie Inifity to StepN, it seems that the X to Earn mode is cursed with a \"death spiral.\" When can old products usher in the \"second curve\"? Can we create a sustainable X to Earn mode? \n Scenario P: Play to Earn, Move to Earn, Bike to Earn, Learn to Earn, Drive to Earn, Sleep to Earn, Eat to Earn, Read to Earn, Write to Earn, Code to Earn, Create to Earn, Sing to Earn, Meditate to Earn, etc. Which type is the most promising?\n\n    X to Earn is essentially a new growth paradigm of Web3. Scenario X is the foundation of the project, and the economic model Earn is designed to serve X.\n\n    After experiencing the dazzling X to Earn market and the bear market, it is believed that very few projects will stand out. We tentatively call this stage the X to Earn 1.0. As the X to Earn 2.0 is approaching, we will see new market changes.\n\n    The popularity of the X to Earn mode does not mean that everything can adopt this mode. The right specific scenario is the primary condition for the success of X to Earn.\n\n    The CGV research team also agrees with Mtyl's understanding of the selection of X scenarios. A suitable X needs to satisfy: 1. The labor results can be quantified. Labor outcomes that are difficult to be explicitly quantified may pose significant challenges to the design of economic models; 2. Positive value of the scenario to the public. Provide intangible value to users, reduce revenue sensitivity, and make it easier to attract new users. Sports, games, learning, and reading are the four main scenarios that are favored. Among them, iJump, ATP.Club and other projects deserve long-term attention.\n\n    As for the economic model, whether it is a dual token, high reward, user attraction, fission, etc., the core is to control the inflow and outflow of the elements of the entire economic system, adjusting while developing.\n\n    Additionally, building product barriers through network effects, educating and guiding users to pay more attention to the intangible value of the scenario to obtain, etc., are also important business model evolutionary trends.\n\n    Of course, the daily operation of X to Earn is also very important. How to balance comprehensive factors such as community data flow, new users, gold farming returns, and user conversion rates are equally challenging in X to Earn 1.0 and 2.0.\n 7. **NFT Finance (NFTFi)**\n\n    Scenario Q: Most of the investment income of NFT still comes from buying low and selling high. Investors are often afraid to enter or exit the market for fear of \"selling at a low price\" or mispricing the asset, which is not conducive to increasing transaction volume and frequency. \n Scenario R: As NFTs can only be purchased in integers and vary in rarity, different NFTs have different values, making it difficult to improve the transaction experience.\n\n    Scenario S: In the eyes of different collectors or investors, even the same NFT has different values, and the ambiguous pricing makes it more difficult for buyers and sellers to reach a consensus on the transaction, resulting in insufficient liquidity and capital utilization.\n\n    Whether it is the emergence of NFTs such as personal profile pictures/avatars (PFP) and digital artworks, or the record-breaking transaction volume of NFT trading markets such as OpenSea and LooksRare, they have validated that NFTs have values and are financial assets.\n\n    In theory, all financial assets can be securitized—that is, converted into the tradable, fungible items with monetary value.\n\n    However, in the NFT financial world, issues such as reliable and accepted valuations and instant liquidity models have not yet been resolved, and NFT financialization has a long way to go.\n\n    According to CGV, taking the size of the lending market as an example: in the traditional financial market, the lending penetration rate is over 50% in the $40 trillion credit market for hard assets (mortgages and real estate industry, etc.); the lending penetration rate is about 10% in the $2 trillion art and collectibles market. The NFT transaction volume in May 2022 was $3 billion, and optimistic estimates suggested that NFT credit market penetration rate was between 1 to 3%.\n\n    Fair and timely pricing is the first step in the development of the NFT financial market. However, high market volatility, extreme trading volume fluctuations, and the diverse characteristics of NFTs make NFT valuation and evaluation very challenging and complex. The exploration of oracle based on on-chain data (e.g., Upshot, NFTBank) or manually-evaluated projects (e.g., Abacus) is noteworthy.\n\n    The lack of a scalable, low-risk and credible price evaluation mechanism severely restricts the development of the NFT credit market, resulting in the demand for NFT-backed loans exceeding the supply of loan capital and causing significant unmet demand for NFT lending.\n\n    If only CryptoPunks, BAYC, MAYC, CloneX, which are blue-chip top NFT holders in the lending market, are the main service targets, NFT Finance will only be a castle in the air.\n\n    However, the peer-to-peer model represented by NFTfi and Arcade, and the peer-to-pool model represented by BendDAO, as well as Cedar's \"buy now, pay later\" model, etc., have innovated their unique way.\n\n    It is worth noting that dividing NFTs into fragmented and fungible tokens cannot effectively address liquidity issues. In the absence of utility and increased revenue, the essence is to convert an illiquid NFT into an illiquid ERC-20 token. When many people share the same NFT, it may cause new difficulties for asset governance.\n\n    Additionally, as NFT technology is widely used across industries, just as there are general-purpose and specialized marketplaces today, we may see more financialized products targeting specific NFT categories, such as specialized protocols for medical records, conversations, insurance contracts, etc., as the NFT financial infrastructure for various vertical fields.\n 8. **Virtual Real Estate**\n\n    Scenario T: There are more and more metaverse platforms for socializing, playing games, selling NFT, attending conferences, and attending virtual concerts. All of them sound cool, but who should design, develop, operate and maintain the specific scenarios and gameplay?\n\n    Scenario U: What is the value of owning a piece of virtual real estate in the metaverse, other than waiting for the land price to rise? Can I borrow from the market if I need money?\n\n    Since its inception, the metaverse has been regarded as an important way to build the future digital world. People imagine that everything in the real world will be replicated in the metaverse, and even gain a unique experience that transcends the limitations of time and space.\n\n    Virtual real estate has become the first field in the current metaverse economic system to be found valuable, and is known as the \"cornerstone of metaverse assets\". It is estimated that the value of the virtual real estate industry will grow at a CAGR of 31.2% between 2022 and 2028.\n\n    Virtual real estate is not only a digital image, but also a programmable space within the virtual reality platform. Assuming you own a piece of virtual real estate where you can host events and collect rents; sell banners or advertisements and receive advertising revenues; organize various games and receive commissions from the proceeds of games. Early entrants can get access to the earliest asset transactions in the metaverse and preferential access to the latest assets.\n\n    Therefore, the construction and innovation of business models based on virtual real estate, with a view to providing more immersive, real-time and diverse pan-entertainment experiences for landowners, artists, business owners and various users, will become a new trend and innovative business growth point.\n\n    CGV predicts that in the futuestate, such as DAOs and guilds, and emerging businesses such as virtual real estate issuance, and operation and trading platforms may have huge market demand.\n\n    Taking MetaEstate, a metaverse ecological service provider as an example, it has conducted relevant business exploration and practice, carried out extensive business around global metaverse planning and rational land use, building excellent buildings, introducing famous IP, developing usage scenarios, marketing activities, property management services, etc. It has also laid out virtual real estate management, fund assetization, business globalization and EstateFi financial cooperation, forming a closed loop of metaverse virtual real estate ecological services.\n 9. **Crypto Mobile Terminal**\n\n    Scenario V: Most of the DAPPs encrypted by Web 3 are deployed on the computer side. Even the Web 3 wallet Metamask has a better user experience on the computer side. If users want to mint an NFT using a phone, the experience is terrible.\n\n    Scenario W: Hardware wallets are increasingly recognized as safe but somewhat cumbersome to use. Nowadays, when everything is integrated into mobile phones, it is sometimes a bit troublesome to carry around a hardware wallet.\n\n    Currently, mobile Internet has occupied most of the user's time, it is inconvenient for users to operate on the PC side. However, crypto users are often forced to do so.\n\n    Objectively, many crypto, decentralized finance, and NFT applications are less operable on mobile devices than on desktop, or have cumbersome user interfaces. If the native mobile hardware and system are used as the bottom layer, many problems can be easily solved.\n\n    The hardware demand for wallet, known as the entrance to the encrypted world, will gradually be stimulated. Many people may criticize that the security of the built-in cold wallet in mobile phones cannot compete with the hardware wallet. However, once cryptocurrency transactions become widespread, asset share reaches a certain level, or a large amount of liquidity is generated, the demand for secure storage hardware will constantly unleashed. Let's look at the U shield, which seems to have withdrawn from the stage of history after the widespread application of bank's APP.\n\n    Today, we have seen crypto projects and traditional phone manufacturers' new attempts in the crypto phones. On June 23, 2022, Solana Labs announced that it was developing its smartphone brand, Saga, with a built-in Solana Mobile Stack (including mobile wallet adapter, seed bank, and Solana Pay) at a cost of about $1,000. It will come on the market in early 2023. On June 29, HTC launched Metaverse cell phone, Viverse App with built-in portal to the metasverse, Vive Avatar that can build virtual avatars, Vive Wallet that manages virtual assets, etc.\n\n    Based on the analysis of the CGV research team, encrypted mobile devices are more than just making cryptocurrency applications more mobile friendly, and the project party may play a bigger game.\n\n    If Solana Mobile joins hands with mobile operators to carry out market activities such as recharging and pledging SOL, using the phone for free and enjoying preferential packages on phone bills, does this open a new chapter in Solana's ecology to some extent?\n10. **Crypto ETF**\n\n    Scenario X: For newcomers to the crypto industry, the endless emergence of cryptocurrency products and high transaction costs require simpler channels and user-friendly products to meet their investment needs safely and conveniently.\n\n    Scenario Y: For one or more fields with promising future, professional investors hope to select their favorite ETF/portfolio and balance investment risks according to style, industry, cross-market, asset class and other personalized mix.\n\n    Scenario Z: As a KOL with millions of fans or an investment-type DAO, they want to select mainstream tokens in the market based on a customized liquidity pool, issue, and manage their DeFi derivative assets (ETF/portfolio), and get revenues.\n\n    ETF is not a new term. Every once in a while, you hear that a company has filed an application for a Bitcoin ETF to the SEC. But so far, the SEC has either delayed approval of the Bitcoin ETF or repeatedly solicited public opinions.\n\n    ETF (Exchange Traded Fund) is an exchange-traded open-end index fund, also commonly known as an exchange-traded fund. It is listed in the exchange and traded with variable fund shares. After the global financial crisis in 2008, ETFs became the most popular investment tool. By the end of 2021, according to Wind, the total size of US ETFs ($7.19 trillion) was about 10% of the size of the US stock market ($68.9 trillion).\n\n    As a simple and convenient way to access Bitcoin, Bitcoin ETFs help investors avoid the complex process of cryptocurrency trading and the risks that crypto assets may face in transmission and storage, which can stimulate more demand for buying and trading. Therefore, the approval of cryptocurrency ETFs is an important sign for cryptocurrencies to move towards compliance and attract more traditional investors.\n\n    On October 19, 2021, ProShares Bitcoin Strategy ETF (BITO), the first ETF to track Bitcoin futures prices, was listed on the New York Stock Exchange. Although it tracks bitcoin futures prices, it marks a milestone in the cryptocurrency's acceptance by traditional financial regulators. We believe that in the near future, with the promotion of regulatory compliance, the Bitcoin spot ETF may be approved for listing.\n\n    In addition to Bitcoin ETFs and Ethereum ETFs connected to the traditional financial world, crypto ETFs are expected to become a new blue ocean market.\n\n    Investors can make an informed investment without having to know the complexity of the different crypto protocols, the economics of each token, or the historical performance. Create a diversified portfolio of crypto assets by simply investing in a single ETF.\n\n    Currently, more and more exchanges have introduced leveraged ETFs into their encrypted financial derivatives ecosystem, and companies and investors are also looking forward to a convenient, easy-to-operate, and secure investment portfolio/ETF trading platform (such as DeSyn Protocol, Phuture, etc.).\n\n    It is foreseeable that after the adoption of the Bitcoin spot ETF and the perfection of the crypto ETF market, crypto ETF administrators (financial advisors) such as BlackRock iSahres in the traditional financial field will become new roles for trading platforms, ETF issuance management platforms, investment institutions, DAOs and KOLs to compete for, and it may form the \"Matthew effect\".\n\n    In the current special world, at a special time point, there is too much uncertainty and interference for such a special encryption industry. It is indeed difficult to seek the theme of the new narrative of the next bull market.\n\n    But history often tells us that opportunity is often left to those who are prepared for it.\n\n    May we all be lucky enough to be prophets, narrators and witnesses of the new crypto narrative, and to welcome the new starting point of the crypto market.", "timestamp": 1657624963, "digest": "ILOMn6noOrHwvRNmFidf1y2QEXtsgvT7yp53poCl6uQ", "contributor": "0xA4D1A29a3AC43b46108E1b8aa7818AddF283BbA7"}
{"id": "lQlZ5agaP2Hty7qPUksan4wDK9ccdF2mTJ6o5P2CG34", "title": "You are not late and you are definitely not early. Everything is on time. Just wait", "body": "Мой друг закончил институт в двадцать три года, но после этого долго околачивался и безуспешно искал работу. Другого моего однокурсника судьба сделала успешным директором в 28 лет, но он умер в 49. А кто-то стал директором только в 49, а умер в 90. Разные скорости, разный ход и план событий.\n\nКто-то до сих пор холост в тридцать шесть лет, а у кого-то в двадцать пять уже есть семья и трое детей. Всего двадцать пять, но одна уже готовится к разводу, а другая ждет четвертого ребенка и в их семье мир и согласие.\n\nАлександр Македонский в 31 год покорил весь древний мир, но умер в 33 года. Лермонтов стал известным поэтом и завершил свою карьеру в 26 лет, а Нельсон Мандела провел в тюрьме 27 лет, после чего в 77 лет стал популярным президентом. Макрон и Лукашенко стал президентом в 39 лет; Зеленскому 41 год, а Дональду Трампу всего 70. Шумахер стал чемпионом в 25, Нино Фарино выиграл свою первую гонку в 44.\n\nОснователь магазинов Zara Амансио Ортега стал миллиардером в 65 лет, а Сергей Брин в 23 года. Симпатичная Ли Со Хён, президент южнокорейской Cheil Industries, стала миллиардером в 43 года, оставив многих мужчин далеко позади. Валентина и Анатолий Хромых из Липецкой области воспитали 20 детей и вошли в реестр рекордов России как одна из самых многодетных семей России, а Джордж Клуни впервые стал отцом в 55 лет.\n\nУ каждого в этом мире свой график, назначенная скорость и свой маршрут. Ваши задачи и цели. Все многогранно и неоднозначно. Время есть для всех. Для некоторых это быстро и быстро. Для некоторых это медленно и подробно. Если подумать, все в мире работает на основе индивидуального хронометра. Страны, люди, идеи. В свое время стреляет, в свое время гаснет.\n\nЛюди вокруг вас могут быть перед вами, а кто-то может быть позади вас. Все естественно и гармонично. Не нужно сравнивать себя ни с кем. У каждого своя уникальная дистанция в своем часовом поясе. Не стоит огорчаться, завидовать никому, они двигаются в свое время, а вы в свое. Жизнь – это мгновение, ожидающее своих событий. Время и шанс, как говорится. Так что расслабьтесь и наслаждайтесь. Всему свое время, место и обстоятельства. Вы не опоздали и уверены, что не опоздали. Вы вовремя. Просто подожди. Жди своего счастья.", "timestamp": 1657624941, "digest": "CIup1sFQcEfXbPkYUnZgRaOxMlZIBo9vbvmhK5t7eUA", "contributor": "0xA734a2DE4578b49749Ff1D17F23D37a31c9C9955"}
{"id": "Q1PNpYir9v0-cEz3KqbJNidohGB4_-UDUJW-zUm68X4", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs and I hope our friends the Christians and indigenous peoples of the world are relieved.", "timestamp": 1657624904, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
{"id": "Y4ChPvTXH8B4QP9PcFQ_s4h9cx8gjHdh1xJaMFBssqE", "title": "What is web3", "body": "web3 is the child of web2 and bitcoin. It's a fork of Nakamoto’s blockchain that combines the speed and progress of our technology stack but the values and principles of web1.\n\n![](https://images.mirror-media.xyz/publication-images/819rNg8x_abPDEBZnO5jn.jpeg?height=563&width=1000)\n\nIn 1989 Tim Berners-Lee created the Internet as we know it, with the vision that it should be an open digital network available to all people. This vision allowed the creation of the first open protocols such as HTTP (web pages), SMTP (email), RSS (news), TCP/IP, etc. They were the pillars to build all the digital services and products that we know of.\n\nBut these protocols were limited in functionality and user experience, which led to the emergence of closed platforms that leveraged this open systems to create private networks. By offering better software experiences for free and with venture capital tactics they managed to grow very fast and attract millions of people to its platforms. This evolved and eventually they had so much information about its users that powerful players emerged and with them, an evil business model of personal information exploitation.\n\nEventually, the strategies of these products and services created networks that do not equitably distribute the generated value. They just extract and exploit information that they subsequently monetize.\n\nWeb3 and crypto is a movement that wants to better redistribute the value of our information through a new system based on open source and decentralization. What allows this movement is a new paradigm that proposes a new type of computer. It is a virtual computer that always works and can make commitments about performing actions (smart contracts). It’s maintained by all of us and no one can turn it off or manipulate it.\n\nThe main values ​​proposed by the web3 computational paradigm are the following:\n\n**Privacy**: Although everything in the blockchain is public, privacy refers to not giving our personal data necessarily whenever we use a service, since these data, apart from being private, also has economic value that corporations exploit with our consent or participation.\n\n**Portability**: Through tokens or nft we can now own digital assets. This implies that they are not on a 3rd party private server. This reduces the switching costs that are so high in web2 monopolies, for example, in theory you would be able to move your digital audience to another network. Greater portability means more services that compete among for better quality options and lower commissions. \n\n**Composability**: web3 is primarily about open-source code. These dapps will run forever and cannot be modified. The fact that they are really open invites other entrepreneurs and programmers to build upon them with the confidence that they will not will change because they don’t align anymore with the commercial strategy of a founder. The number of projects that never existed due to the limitations of these closed platforms is incalculable. With web3, hundreds of creative innovations will emerge. For example, there are already defi lending protocols that are open source and are on the blockchain, operating as protocols. In this way, any application will be able to make use of them and create better experiences for the user.\n\n**Identity**: The concept of identity in web3 is that it is ours and we have full control over it. We don’t have to delegate it to centralized entities so that they can exploit it. The idea is that your audience, your content and your data are yours and you can move, hide and modify it. Identity in web3 is now a cryptographic wallet that holds your assets, certificates, social graph and much more.\n\n**Ownership**: Thanks to NFTs and Tokens we now have real digital property. By being the owner, we are also part owner of the networks in which we participate and we have rights over that property. Rights to use it, sell it, rent it, and also gives us the right to vote and governance.\n\n**Conclusion**\n\nWeb3 is about finance, it's about open economies, about owning the data, about owning digital things for the first time in our lives. The digital world is as real and tangible as the physical world, yet until now we didn’t have infrastructure, property or rights. A handful of monopolies owned everything. This is the digital Renaissance.", "timestamp": 1657624939, "digest": "17udvR2vN4P7xi-3v4n6Qb88N8zHBpDZhcChk2jeRRM", "contributor": "0x7E0b0363404751346930AF92C80D1fef932Cc48a"}
{"id": "4-Zoy8C0RHmIqEd6jU-iA15AqqTRdfzV7td7j-gyRbI", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs and I hope our friends the Christians, indigenous and all good peoples of the world are relieved.", "timestamp": 1657625053, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
{"id": "T4BCu4lXfFs7O1hV_Hz_rS0Tzjx9ZmJY8gf3dkIpDBI", "title": "10 Keywords for the Next Crypto Bull Market's New Narrative", "body": "说到“叙事”，我们通常将其理解为“讲故事”。并不真地。\n\n诺贝尔经济学奖获得者罗伯特·席勒的最新著作《叙事经济学》为我们提供了全新的视角。席勒发现了“叙事”在金融资产定价和市场波动中的关键作用：事件本身可能并不重要，但“故事”被处理、编码、处理和修饰的方式很重要。如果从不同的角度、不同的层次、不同的逻辑去解读同一个事件，对金融市场的影响就会完全不同。\n\n对此，加密市场本质上是金融的，不断寻找新的叙事方式，是吸引资金和人才的重要途径。只有资金和人才不断进入市场，才能实现新的叙事。\n\n因此，新的叙事创造了新的增长空间。对于加密从业者来说，发现和预测未来的新叙事，提前做出响应和布局至关重要。\n\n2020年以来，我们见证了DeFi的崛起、NFT的出现、GameFi的火爆、元界的全民追捧、Layer 2的落地、新公链的疯狂等等。这些不同领域的叙事促进了加密市场的快速增长。\n\nThe concept of Web3 is ambitious. The research team of Cryptogram Venture (CGV) tries to figure out the key clues that belong to new narratives of the next crypto bull market from the perspective of the needs of segmented scenarios and the pain points and trends of the current crypto industry.\n\n![10 Keywords for the Next Crypto Bull Market's New Narrative](https://images.mirror-media.xyz/publication-images/UCD0wfgoCoan5lPCh3Nqn.png?height=486&width=830)\n\n 1. **Soulbound Token**\n\n    **Scenario A:** Traditional financial markets are built on credit. In the crypto lending market, it is difficult for individual borrowers with insufficient collateral to obtain mortgages due to technical limitations in proving an individual's or institution's ability to repay the loan.\n\n    **Scenario B:** DAOs may face a huge threat in the event of sybil attacks, where individuals or groups accumulate large amounts of governance tokens and manipulate votes on proposals in their favor.\n\n    **Scenario C:** If users lose the wallet's secret key, it will result in a permanent loss of access to the wallet. Is it possible to recover the secret key by transferring control of the lost account to the new secret key through social networks such as friends, family, and other contacts?\n\n    In May 2022, economist and sociologist E. Glen Weyl, lawyer Puja Ohlhaver, and Ethereum founder Vitalik Buterin proposed Soulbound Token (SBT).\n\n    The concept of \"soulbound\" originated from the multiplayer online role-playing game \"World of Warcraft\". Most of the powerful props in this game are soulbound. Once the soulbound props are picked up, they cannot be transferred or sold to other players.\n\n    SBTs are known as the components of the original foundation in the Decentralized Society (DeSoc) Web3 trend. Similar to resumes or medical records in the non-Web3 world, SBTs are non-transferable tokens that represent the \"commitments, credentials and affiliations\" that make up the social relationships on a Web3 network.\n\n    With the help of SBTs, the issue of insufficient mortgage loans can be well solved by developing a provable reputation system; the issue of sybil attacks on DAOs can be well solved by checking the correlation between voted Souls and held SBTs. Besides, SBT will play an important role in scenarios such as social wallet recovery, airdrop mechanism optimization, GameFi levels, standings, and special skill binding.\n\n    CGV deems that the proposal of SBT may create a richer Web3 world for users, that is, integrating real social structures (such as families, churches, teams, companies, etc.) into Web3, not just the financial system (DeFi).\n 2. **Zero-Knowledge Proof**\n\n    Scenario D: To protect the privacy of users, how do data analytics companies manage to draw conclusions on data analysis without seeing data or addresses?\n\n    Scenario E: DeFi users do not want their property transactions to be viewed or tracked by others. What should they do?\n\n    Zero Knowledge Proof (ZKP) is a method by which the prover can prove to the verifier that a given statement is true while the prover avoids conveying any additional information apart from the fact that the statement is indeed true. Zk-snark and ZK-Stark are two of the most widely used technologies after ZKP mechanism is transformed into computer programming languages.\n\n    In 2021, Vitalik said in an article, “Perhaps the most powerful cryptographic technology to come out of the last decade is general purpose succinct zero knowledge proofs, usually called zk-SNARKs.”\n\n    As one of the main usage scenarios of ZKP, privacy is classified into transaction privacy and data privacy.\n\n    For a long time, many people have wondered: Why is the privacy issue big on promises and short on action? The number of users and usage is not large, and many people even think that privacy is a false proposition. In the Web3 era, we have seen the emergency of various applications such as DeFi, NFT, GameFi, and SocialFi, and the chains have more and more features. Simple anonymous transfers can no longer meet people's needs for privacy.\n\n    In a transaction, if you have to prove that you own an unspent asset, but you do not want to reveal the entire source of the asset, ZKP can solve the information leakage caused by transaction transparency, such as transfer address and amount. It is quite important for financial applications such as currency payments, hedge funds, exchanges, and P2P. Projects such as Manta Network, Aleo, and NYM deserve attention.\n\n    In terms of data protection, many projects protect data privacy (blockchain hybrid architecture) via trusted execution environment (TEE), multi-party secure computing, etc., such as identity information, medical information, etc.\n\n    With the increasing requirements for the protection of user data and the expansion of cryptocurrency usage, the prediction of renowned investor Naval Ravikant - the inevitable endpoint of crypto is maximum decentralization and maximum privacy - may gradually become a reality.\n 3. **Modularity**\n\n    Scenario F: Currently, L2s based on ETH Rollup mainly include Arbitrum, Optimism, Starkware, Zk-sync, Polygon, Aztec, Boba, Metis. In the future, there may be 10 to 20 new rollups, and there may be strong liquidity fragmentation between these L2s.\n\n    Scenario G: A secondary market that allows the trading of existing DeFi options has not yet been established. The secondary market with liquid DeFi options could become a reality if a viable limit order book exchange is achieved and the minimum segment size for trading is reduced (by lowering transaction costs). Scenario H: Arbitrum, one of the most popular Ethereum Layer 2 scaling networks, opened the second phase of the Odyssey activities. Due to high gas costs caused by heavy load on the chain, Arbitrum announced the suspension of Odyssey activities. Embarrassingly, Arbitrum's main goal is to significantly reduce gas costs to improve user experience.\n\n    It is generally believed that a single public chain has the problem of \"impossible trinity\", and it is difficult to achieve security, scalability, and decentralization simultaneously. Modularity is essentially a vision centered on scaling solution, a solution to the \"impossible trinity\".\n\n    The modular public chain is to modularize the techniques, applications, rules, and standards of the public chain. Each module is a blockchain, and they are responsible for different features (such as execution layer, consensus security layer, data availability layer, DEX application chain, stable currency application chain, NFT application chain, derivative application chain, etc.). It is convenient for different project developers to match processing solutions according to their needs.\n\n    For example, transactions are executed through high-speed rollups, the secure settlement layer handles settlement, and the low-cost and high-volume data availability layer deals with security.\n\n    In fact, the modular public chain is not a new concept. With the maturity of the Ethereum Layer 2 solution, it has gradually attracted the attention of the industry.\n\n    Currently, the Ethereum Layer 2 solution is not a panacea. The Optimism and Arbitrum have encountered major issues one after another, indicating that Layer 2 is still in an infancy stage. With the influx of users, various bugs may appear.\n\n    Therefore, the first generation of smart contract platforms represented by Ether, which tries to do everything from data storage to Turing complete on one platform, has a long way to go. In the future, we will see the stack break down into data availability and consistency, block validation and construction, transaction ordering and block proposal, and multi-purpose or directed computation. Projects such as Celestia and Assembly have been fully explored.\n\n    We believe the composability of blockchain technology, from DeFi to modular public chain, will enrich the crypto world.\n 4. **Hyperautomation**\n\n    Scenario I: The V3 released by Uniswap improves the refined operation of LPs, but both LP farmers who want to earn transaction fees and project teams who want to better motivate their token liquidity often run into trouble beyond liquidity.\n\n    Scenario J: For loan users, they do not want to be liquidated by the platform in the event of drastic changes in the market. If one is able to set the collateral/debt ratio, once it falls below the threshold set by the user, one would like the platform to sell some of the collateral to pay off the debt, thus keeping as much collateral as possible for the user.\n\n    Scenario K: In GameFi projects, players are required to pay gas fees for the creation and execution of transactions. If users don’t have enough network token balances, or transactions get stuck due to a sudden spike in gas fees, players can’t stay in the game, resulting in high bounce rates.\n\n    The traditional financial services industry is full of complex processes, transactions, and payments connecting clients, buyers, dealers, regulators and other stakeholders, often resulting in high manual reliance on process management issues, which makes automation increasingly important for providing a seamless client experience.\n\n    \"Hyperautomation\" has become an effective tool for improving efficiency in the traditional financial industry. It refers to the effective combination of machine learning, process mining, API integration and intelligent workflow orchestration to automate the delivery of services to clients without high complexity. Business process automation tools and artificial intelligence technology are the two cores of hyperautomation.\n\n    In the world of Web 3, especially in the field of DeFi, there are a host of features that need to be triggered periodically or under specific conditions, such as periodic revenue reinvestment, periodic payroll, liquidity rebalancing, etc. The project team hopes to automate these behaviors and improve the efficiency and usage experience of the protocol,\n\n    such as stablecoin protocols for automatic revenue reinvestment, aggregation protocols for arbitrage trading, NFT shard protocols for distributing pledge rewards, and money management protocols for paying DAO members' salaries.\n\n    If the project party establishes the entire robot program to trigger the operation of the smart contract, it will take lots of time and cost to establish, operate and maintain it. In this regard, DeFi developers can outsource their web3 DevOps needs and focus on building core products. It creates large market space for automation service providers, such as Gelato, Chainlink, and KP3R, etc.\n\n    For example, Gelato Relay helps Web3 application and infrastructure developers employ simple APIs to quickly, cost-effectively, and reliably mine arbitrary transactions on behalf of their users or protocols, enabling use cases such as gas-free transactions, solving common user experience issues such as the need to switch between multiple networks or concerns about stuck transactions.\n\n    CGV holds that in the long run, if smart contracts in the Web 3 world can make real-time, safe and fast responses to specific scenarios in the real world and the Web 2 world, and build a bridge between the real world and Web 2 APIs and Web 3 smart contracts, hyper-automation will have a more promising future.\n 5. **External Market**\n\n    Scenario L: The emergence of Web3 and the popularity of NFTs have made many people enthusiastic about the encryption market, but they generally do not have a good understanding of the encryption market, and the threshold for registering digital wallets and completing on-chain transactions is high.\n\n    Scenario M: Some public chains and DeFi protocol developers face hundreds or even dozens of active users every day, and fail to expand their customer base.\n\n    Scenario N: Some traditional manufacturers and Internet companies intend to integrate NFT technology with their business to build new business models. Additionally, many NFT ecological service providers are competing for the stock market of encrypted users. Can the demands of the two be reconciled?\n\n    From the perspective of economics, the impact of a private economic behavior on social welfare is called externality.\n\n    The CGV research team reviewed the history of the crypto industry and found that every magnificent bull market is inextricably associated with the burst of a specific externality market.\n\n    Before 2018, the miners, computing power market, digital currency trading, and exchange market were the main elements of the crypto industry. From 2018 to 2020, with the rise of DeFi summer, liquidity providers, pledges, and insurance markets were in full swing. Since 2021, X-to-earn market, Guild market, NFT creation market have become the best testing ground for creating a crypto externality market.\n\n    For example, StepN, based on the user's pursuit of health through running, has encouraged hundreds of thousands or even millions of people who have never been exposed to the crypto world to create digital asset wallets, and popularized basic DeFi operations. Axie is just a battle game, but it has nurtured the thriving Guild economy. Some guilds have become inclusive financial service facilities in Southeast Asia. AYC has huge externalities and uses NFTs to form a large group of high-net-worth investors.\n\n    From the perspective of Web3, token has high liquidity, high openness and composability, making Web3 products and agreements generate unexpected external market.\n\n    Looking forward to the next cycle, public chains, NFTs, and DeFi may be the first batch of key areas to trigger a new wave of externality markets.\n\n    Taking StepN, which used to rely on Solana, as an example, it has successively become the largest NFT trading market on Solana and the DEX with the highest transaction volume, etc., attracting hundreds of thousands of new users to the Solana ecosystem, which in turn \"nourishes\" the competitiveness of the public chain. It is believed that in the future, there will be many applications similar to StepN, and their support for different public chain ecologies may influence the competitive pattern of the public chain.\n\n    Besides, NFTs are not just PFPs used to show off or socialize business cards. Most NFTs represent a subculture or meme color, which gives people a sense of belonging. What NFT can achieve in the future is to reach the goal of a license-free community in a value-added way.\n\n    NFTs may become the best tool for connecting the real economy and the cryptoeconomy, but they are often overlooked by today's NFT ecosystem.\n\n    In the real economy, the user portraits of many products are different, and the data between products and companies are not interconnected. The users of Company A and Company B may be highly overlapped. With the help of NFT tools, companies can better target users, making it easier for users to find tribes and optimizing the process of exchanging signals with others, which is bound to create more new externalities to the crypto industry.\n\n    For example, many business entities can offer unique discounts based on the historical record of the wallet. It is something a traditional membership card cannot do. How amazing it would be if the owner of a BMW model used NFTs to get discounts on products like LV, Apple, or even a real estate property without having to get authorization from a different brand owner.\n\n    Similarly, in terms of Cefi and DeFi, whoever can attract more external capital will have more say in the financial markets.\n\n    Since its establishment, the FTX trading platform has constantly made efforts and achieved results in compliance. SBF has said that although compliance would slow down the development and expansion in the short term, it facilitates stable and long-lasting business expansion in the long term. FTX focuses on compliance development because it attaches great importance to the development of externality markets.\n 6. **X to Earn 2.0**\n\n    Scenario O: From Axie Inifity to StepN, it seems that the X to Earn mode is cursed with a \"death spiral.\" When can old products usher in the \"second curve\"? Can we create a sustainable X to Earn mode? Scenario P: Play to Earn, Move to Earn, Bike to Earn, Learn to Earn, Drive to Earn, Sleep to Earn, Eat to Earn, Read to Earn, Write to Earn, Code to Earn, Create to Earn, Sing to Earn, Meditate to Earn, etc. Which type is the most promising?\n\n    X to Earn is essentially a new growth paradigm of Web3. Scenario X is the foundation of the project, and the economic model Earn is designed to serve X.\n\n    After experiencing the dazzling X to Earn market and the bear market, it is believed that very few projects will stand out. We tentatively call this stage the X to Earn 1.0. As the X to Earn 2.0 is approaching, we will see new market changes.\n\n    The popularity of the X to Earn mode does not mean that everything can adopt this mode. The right specific scenario is the primary condition for the success of X to Earn.\n\n    The CGV research team also agrees with Mtyl's understanding of the selection of X scenarios. A suitable X needs to satisfy: 1. The labor results can be quantified. Labor outcomes that are difficult to be explicitly quantified may pose significant challenges to the design of economic models; 2. Positive value of the scenario to the public. Provide intangible value to users, reduce revenue sensitivity, and make it easier to attract new users. Sports, games, learning, and reading are the four main scenarios that are favored. Among them, iJump, ATP.Club and other projects deserve long-term attention.\n\n    As for the economic model, whether it is a dual token, high reward, user attraction, fission, etc., the core is to control the inflow and outflow of the elements of the entire economic system, adjusting while developing.\n\n    Additionally, building product barriers through network effects, educating and guiding users to pay more attention to the intangible value of the scenario to obtain, etc., are also important business model evolutionary trends.\n\n    Of course, the daily operation of X to Earn is also very important. How to balance comprehensive factors such as community data flow, new users, gold farming returns, and user conversion rates are equally challenging in X to Earn 1.0 and 2.0.\n 7. **NFT Finance (NFTFi)**\n\n    Scenario Q: Most of the investment income of NFT still comes from buying low and selling high. Investors are often afraid to enter or exit the market for fear of \"selling at a low price\" or mispricing the asset, which is not conducive to increasing transaction volume and frequency. Scenario R: As NFTs can only be purchased in integers and vary in rarity, different NFTs have different values, making it difficult to improve the transaction experience.\n\n    Scenario S: In the eyes of different collectors or investors, even the same NFT has different values, and the ambiguous pricing makes it more difficult for buyers and sellers to reach a consensus on the transaction, resulting in insufficient liquidity and capital utilization.\n\n    Whether it is the emergence of NFTs such as personal profile pictures/avatars (PFP) and digital artworks, or the record-breaking transaction volume of NFT trading markets such as OpenSea and LooksRare, they have validated that NFTs have values and are financial assets.\n\n    In theory, all financial assets can be securitized—that is, converted into the tradable, fungible items with monetary value.\n\n    However, in the NFT financial world, issues such as reliable and accepted valuations and instant liquidity models have not yet been resolved, and NFT financialization has a long way to go.\n\n    According to CGV, taking the size of the lending market as an example: in the traditional financial market, the lending penetration rate is over 50% in the $40 trillion credit market for hard assets (mortgages and real estate industry, etc.); the lending penetration rate is about 10% in the $2 trillion art and collectibles market. The NFT transaction volume in May 2022 was $3 billion, and optimistic estimates suggested that NFT credit market penetration rate was between 1 to 3%.\n\n    Fair and timely pricing is the first step in the development of the NFT financial market. However, high market volatility, extreme trading volume fluctuations, and the diverse characteristics of NFTs make NFT valuation and evaluation very challenging and complex. The exploration of oracle based on on-chain data (e.g., Upshot, NFTBank) or manually-evaluated projects (e.g., Abacus) is noteworthy.\n\n    The lack of a scalable, low-risk and credible price evaluation mechanism severely restricts the development of the NFT credit market, resulting in the demand for NFT-backed loans exceeding the supply of loan capital and causing significant unmet demand for NFT lending.\n\n    If only CryptoPunks, BAYC, MAYC, CloneX, which are blue-chip top NFT holders in the lending market, are the main service targets, NFT Finance will only be a castle in the air.\n\n    However, the peer-to-peer model represented by NFTfi and Arcade, and the peer-to-pool model represented by BendDAO, as well as Cedar's \"buy now, pay later\" model, etc., have innovated their unique way.\n\n    It is worth noting that dividing NFTs into fragmented and fungible tokens cannot effectively address liquidity issues. In the absence of utility and increased revenue, the essence is to convert an illiquid NFT into an illiquid ERC-20 token. When many people share the same NFT, it may cause new difficulties for asset governance.\n\n    Additionally, as NFT technology is widely used across industries, just as there are general-purpose and specialized marketplaces today, we may see more financialized products targeting specific NFT categories, such as specialized protocols for medical records, conversations, insurance contracts, etc., as the NFT financial infrastructure for various vertical fields.\n 8. **Virtual Real Estate**\n\n    Scenario T: There are more and more metaverse platforms for socializing, playing games, selling NFT, attending conferences, and attending virtual concerts. All of them sound cool, but who should design, develop, operate and maintain the specific scenarios and gameplay?\n\n    Scenario U: What is the value of owning a piece of virtual real estate in the metaverse, other than waiting for the land price to rise? Can I borrow from the market if I need money?\n\n    Since its inception, the metaverse has been regarded as an important way to build the future digital world. People imagine that everything in the real world will be replicated in the metaverse, and even gain a unique experience that transcends the limitations of time and space.\n\n    Virtual real estate has become the first field in the current metaverse economic system to be found valuable, and is known as the \"cornerstone of metaverse assets\". It is estimated that the value of the virtual real estate industry will grow at a CAGR of 31.2% between 2022 and 2028.\n\n    Virtual real estate is not only a digital image, but also a programmable space within the virtual reality platform. Assuming you own a piece of virtual real estate where you can host events and collect rents; sell banners or advertisements and receive advertising revenues; organize various games and receive commissions from the proceeds of games. Early entrants can get access to the earliest asset transactions in the metaverse and preferential access to the latest assets.\n\n    Therefore, the construction and innovation of business models based on virtual real estate, with a view to providing more immersive, real-time and diverse pan-entertainment experiences for landowners, artists, business owners and various users, will become a new trend and innovative business growth point.\n\n    CGV predicts that in the futuestate, such as DAOs and guilds, and emerging businesses such as virtual real estate issuance, and operation and trading platforms may have huge market demand.\n\n    Taking MetaEstate, a metaverse ecological service provider as an example, it has conducted relevant business exploration and practice, carried out extensive business around global metaverse planning and rational land use, building excellent buildings, introducing famous IP, developing usage scenarios, marketing activities, property management services, etc. It has also laid out virtual real estate management, fund assetization, business globalization and EstateFi financial cooperation, forming a closed loop of metaverse virtual real estate ecological services.\n 9. **Crypto Mobile Terminal**\n\n    Scenario V: Most of the DAPPs encrypted by Web 3 are deployed on the computer side. Even the Web 3 wallet Metamask has a better user experience on the computer side. If users want to mint an NFT using a phone, the experience is terrible.\n\n    Scenario W: Hardware wallets are increasingly recognized as safe but somewhat cumbersome to use. Nowadays, when everything is integrated into mobile phones, it is sometimes a bit troublesome to carry around a hardware wallet.\n\n    Currently, mobile Internet has occupied most of the user's time, it is inconvenient for users to operate on the PC side. However, crypto users are often forced to do so.\n\n    Objectively, many crypto, decentralized finance, and NFT applications are less operable on mobile devices than on desktop, or have cumbersome user interfaces. If the native mobile hardware and system are used as the bottom layer, many problems can be easily solved.\n\n    The hardware demand for wallet, known as the entrance to the encrypted world, will gradually be stimulated. Many people may criticize that the security of the built-in cold wallet in mobile phones cannot compete with the hardware wallet. However, once cryptocurrency transactions become widespread, asset share reaches a certain level, or a large amount of liquidity is generated, the demand for secure storage hardware will constantly unleashed. Let's look at the U shield, which seems to have withdrawn from the stage of history after the widespread application of bank's APP.\n\n    Today, we have seen crypto projects and traditional phone manufacturers' new attempts in the crypto phones. On June 23, 2022, Solana Labs announced that it was developing its smartphone brand, Saga, with a built-in Solana Mobile Stack (including mobile wallet adapter, seed bank, and Solana Pay) at a cost of about $1,000. It will come on the market in early 2023. On June 29, HTC launched Metaverse cell phone, Viverse App with built-in portal to the metasverse, Vive Avatar that can build virtual avatars, Vive Wallet that manages virtual assets, etc.\n\n    Based on the analysis of the CGV research team, encrypted mobile devices are more than just making cryptocurrency applications more mobile friendly, and the project party may play a bigger game.\n\n    If Solana Mobile joins hands with mobile operators to carry out market activities such as recharging and pledging SOL, using the phone for free and enjoying preferential packages on phone bills, does this open a new chapter in Solana's ecology to some extent?\n10. **Crypto ETF**\n\n    Scenario X: For newcomers to the crypto industry, the endless emergence of cryptocurrency products and high transaction costs require simpler channels and user-friendly products to meet their investment needs safely and conveniently.\n\n    Scenario Y: For one or more fields with promising future, professional investors hope to select their favorite ETF/portfolio and balance investment risks according to style, industry, cross-market, asset class and other personalized mix.\n\n    Scenario Z: As a KOL with millions of fans or an investment-type DAO, they want to select mainstream tokens in the market based on a customized liquidity pool, issue, and manage their DeFi derivative assets (ETF/portfolio), and get revenues.\n\n    ETF is not a new term. Every once in a while, you hear that a company has filed an application for a Bitcoin ETF to the SEC. But so far, the SEC has either delayed approval of the Bitcoin ETF or repeatedly solicited public opinions.\n\n    ETF (Exchange Traded Fund) is an exchange-traded open-end index fund, also commonly known as an exchange-traded fund. It is listed in the exchange and traded with variable fund shares. After the global financial crisis in 2008, ETFs became the most popular investment tool. By the end of 2021, according to Wind, the total size of US ETFs ($7.19 trillion) was about 10% of the size of the US stock market ($68.9 trillion).\n\n    As a simple and convenient way to access Bitcoin, Bitcoin ETFs help investors avoid the complex process of cryptocurrency trading and the risks that crypto assets may face in transmission and storage, which can stimulate more demand for buying and trading. Therefore, the approval of cryptocurrency ETFs is an important sign for cryptocurrencies to move towards compliance and attract more traditional investors.\n\n    On October 19, 2021, ProShares Bitcoin Strategy ETF (BITO), the first ETF to track Bitcoin futures prices, was listed on the New York Stock Exchange. Although it tracks bitcoin futures prices, it marks a milestone in the cryptocurrency's acceptance by traditional financial regulators. We believe that in the near future, with the promotion of regulatory compliance, the Bitcoin spot ETF may be approved for listing.\n\n    In addition to Bitcoin ETFs and Ethereum ETFs connected to the traditional financial world, crypto ETFs are expected to become a new blue ocean market.\n\n    Investors can make an informed investment without having to know the complexity of the different crypto protocols, the economics of each token, or the historical performance. Create a diversified portfolio of crypto assets by simply investing in a single ETF.\n\n    Currently, more and more exchanges have introduced leveraged ETFs into their encrypted financial derivatives ecosystem, and companies and investors are also looking forward to a convenient, easy-to-operate, and secure investment portfolio/ETF trading platform (such as DeSyn Protocol, Phuture, etc.).\n\n    It is foreseeable that after the adoption of the Bitcoin spot ETF and the perfection of the crypto ETF market, crypto ETF administrators (financial advisors) such as BlackRock iSahres in the traditional financial field will become new roles for trading platforms, ETF issuance management platforms, investment institutions, DAOs and KOLs to compete for, and it may form the \"Matthew effect\".\n\n    在当前特殊的世界，特殊的时间点，这样一个特殊的加密行业存在太多的不确定性和干扰。下一轮牛市新叙事的主题确实难找。\n\n    但历史经常告诉我们，机会往往留给有准备的人。\n\n    愿我们都有幸成为新加密叙事的先知、叙述者和见证者，迎接加密市场的新起点。", "timestamp": 1657625161, "digest": "ILOMn6noOrHwvRNmFidf1y2QEXtsgvT7yp53poCl6uQ", "contributor": "0xA4D1A29a3AC43b46108E1b8aa7818AddF283BbA7"}
{"id": "-XOeCF5t5UbfqOYEAmtwytDXZsw2-UtYwzV_9kEW47g", "title": "gfhfgjkjhkjhjk", "body": "dsfdggdfsadf", "timestamp": 1657625079, "digest": "RNCSMtQf0sX1SLYEfcUpRf4pdc8OD5gZRJAc6R2lRII", "contributor": "0x1aDD1758B593952e6E34e6a436a02A79A9dd9e9d"}
{"id": "YIZwyTBbDmZ-DjgnCHzr-wCp6LMwdoupMat2OUHR1CE", "title": "gfhfgjkjhkjhjk", "body": "dsfdggdfsadf", "timestamp": 1657625171, "digest": "fltrVF7ukgV5RbPTMlvBlNpfyTE3uYrLWhkbFI8XOWA", "contributor": "0x1aDD1758B593952e6E34e6a436a02A79A9dd9e9d"}
{"id": "QL9uWw5s4932Yme8p0JDPnKY2Mir-dreCaJWOqGeOtQ", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs and I hope our friends the Christians, indigenous and all good peoples of the world are relieved. \n\nAn eye for an eye.", "timestamp": 1657625280, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
{"id": "ovOpTd9LhYu3NG1Fiz7uQPvqqWTVYMYh3XWow5GaF6o", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs and I hope our friends the Christians, indigenous and all good peoples of the world are relieved. \n\nThe Laws of Moses: עֲשֶׂרֶת הַדִּבְּרוֹת You shall set up these stones, which I command you today, on Aargaareezem", "timestamp": 1657625540, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
{"id": "IHxezJQSEBiWazJfzG4GE6fVEaIkDNSwNQLyzEmR2T0", "title": "168porn", "body": "168porn ", "timestamp": 1657625668, "digest": "GDayxjsxuhLvb9NF5mbQI6kMUChomB8dLAerxDPx9vA", "contributor": "0x3D39f3a3371D53a3Abb77A99F9F8782b87c98639"}
{"id": "oaDVuX6uh8zt0hqFXEnM62P1U7pkO6yCEywQbVq6yzU", "title": "PlayerOne Weekly Updates #24", "body": "### 🔥 What's New\n\n* Added Settle Down Phase 1 rewards list of Mystery Boxes\n* Completed Settle Down Phase 2 related content\n\n### 🐛 Bug Fixed\n\n* Fixed Space Editor Image Upload bug\n* Fixed Space Editor Voxel Upload bug\n\n### 🚀 Optimization\n\n* Optimized Settle Down claim status\n* Optimized the reward Mystery Box UI\n\n\n***\n\n* Meebits Theme Park Sneak-Peak\n\n  [https://twitter.com/PlayerOneWorld/status/1545001808178819072?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg](https://twitter.com/PlayerOneWorld/status/1545001808178819072?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg)\n\n\n\n* Announce the partnership with Mfer\n\n[https://twitter.com/PlayerOneWorld/status/1545342373575569408?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg](https://twitter.com/PlayerOneWorld/status/1545342373575569408?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg)\n\n* PlayerOne Video Promotion Contest\n\n  [https://twitter.com/PlayerOneWorld/status/1544572119496790017?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg](https://twitter.com/PlayerOneWorld/status/1544572119496790017?s=20&t=hRb1vWnZI8TNm9ZDa-tvMg)\n\n\n\n***\n\n### 🕹️ About PlayerOne\n\nPlayerOne is a sandbox gaming platform based on blockchain technology. It is divided into four sections: strong creative tools, vibrant social scenes, accessible trade marketplaces, and a Play to Earn gaming system.\n\nPlayerOne is constructing a world with an open metaverse. Everyone in this world may make special objects and structures, transfer original NFT works into Metaverse, enjoy NFT works by the world’s top artists, and converse with like-minded peers online.\n\nYou may also capture a special pet in the metaverse, take it swimming in the virtual world, train it, fight alongside it, and let it generate significant revenue for you through PVE or PVP.\n\n![](https://mirror.xyz/_next/image?url=https%3A%2F%2Fimages.mirror-media.xyz%2Fpublication-images%2FvcubhNUFQYZWJ5gcKL9ml.png&w=3840&q=90)\n\n**Follow Us：**[Website ](https://playerone.world/)| [Twitter](https://twitter.com/PlayerOneWorld) | [Medium](https://medium.com/playerone) | [Discord](http://discord.gg/playeroneworld) | [Telegram](https://t.me/playeroneworld)", "timestamp": 1657625626, "digest": "221ptM13s6tCzvqfgXQotmbWIy7FGvRdlP8V5C7_QJ0", "contributor": "0xAaAc7279d800b006E2c0E90840f09A7a27EedbDd"}
{"id": "x4YLCX6OS35k2cT8kAVqhZiuhfJkyD7vuo78s7xMQEM", "title": "JUDAIC GRAIL SYMBOLS", "body": "Let me introduce myself, my name is Chai, translating as “life” in Hebrew (Remember blue suede shoes and his gold chain?)\n\nHere's the story part, the Cohen's were a priestly, mystical and wealthy caste. They displayed ancient hand signs of which I have discovered two variations to date (exhibit one (2332 BCCB this is a prediction for the coming of the Messiah, I add a caveat that I am assuming that this time-horizon relates to the common era) and exhibit two(262 BFB take this with a pinch of salt, but Before Flood Babylon)). These two variations of hand signs are attached for you all (below).\n\nExhibit one displays two hands. Firstly let's examine the left hand. It displays two fingers spread out on the left hand side of the left hand and three fingers spread out on the right hand side of the left hand, denoting the number sequence (2,3). Next, let's examine the right hand side where there are three fingers spread out on the left side of the right hand ,followed by two fingers spread out on the right side of the right hand (3.2). Therefore, the sequence that shone out to myself is as follows 2332. Now notice the dots in exhibit two. I perceived these dots to be vector points or kind of building tools (bearing in mind I am away with the fairies at this point, desperate and trying to uncover something to cling onto my faith). So I placed two dots one inch apart at the base, two dots one inch up and so on and built my holy NFT. 2332 is a prediction by the Cohen’s of Before Christ, Christ Born with a depiction of the coming of Messiah.\n\n![Exhibit one](https://images.mirror-media.xyz/publication-images/7B0X80vBmV2VM9tMY_1pa.png?height=212&width=237)\n\n![Exhibit Two](https://images.mirror-media.xyz/publication-images/uo4NPzvQQwRSyncrPyT4C.jpg?height=254&width=300)\n\nNow you can take a glimpse of the result, that I believe is a true representation of arguably THE MESSIAH, or possibly the attire of the Kohanim (you get me I need nice threads!)\n\n![BCCB 2332](https://images.mirror-media.xyz/publication-images/ayC9Aviwma3GCBl8xQSqn.gif?height=2896&width=963)\n\nRight I understand that many of you are still sceptical and possibly thinking this guy's got serious issues (no comment, I'm alright thank you for your concern).\n\nLet's take exhibit two; it displays on the left hand two fingers separated on the left side and once again three fingers separated on the right side of the left hand, however, this time the three fingers on the right hand side of the left hand are connected to three symmetrical fingers on the right hand denoting the following 2 and 6. Finally there are two fingers separated on the right hand side of the right hand. The combination is 262, once built it produced Hexagonitron (Noah's ark I believe or Gilgamesh). Right so 3 floors, 13 tribes (centre) and 5 compartments that’s what just happened!\n\n![Noah's Ark (Gilgamesh) 262](https://images.mirror-media.xyz/publication-images/JJflF6ZvN57ynleJG600S.png?height=588&width=1554)\n\nIn coming days I will be publishing a road map for these arguably historic art pieces and their influence on modern art scape coupled with recommendations for uses in advertising and industrial use.\n\nI am taking this juncture to emphasise that it is too much of a statistical improbability for Chai to be the original creator, we have revived the Judaic nation and our beliefs and I hope our friends the Christians, indigenous and all good peoples of the world are relieved. \n\nThe Laws of Moses: עֲשֶׂרֶת הַדִּבְּרוֹת You shall set up these stones, which I command you today, on Aargaareezem", "timestamp": 1657625603, "digest": "72sVFKlyHxK42pNBZmNPHdVKKam2Zq992AuSbrkhMD4", "contributor": "0x74207Fe0251104b94f79DD801F4C15235db01911"}
