{"id": "TOcJjjMH8XqDuG0WCxrmzMfIUwt90XAoT1yEDdVb2ns", "title": "Ulysses First Mirror Dashboard", "body": "Hello World, This is my first dashboard on the mirror protocol i just discover this protocol studying with @andrewhong5297 the currents Data analytics tools on web3. \n  \n I gonna use this protocol to share my currents analysis and cases of study that i gonna work \n\n \n \n\n \n ", "timestamp": 1659033352, "digest": "EdZk2ENrAny3tilpvKNzyzUqXsnZXkcLY78qSfE8K9M", "contributor": "0xa7df1BD320457bad8be52855F8A884150cCE7daC"}
{"id": "iAs2y2i-ZMq0VDztygQWufnNMQhHFfx14X7mKgCLAsg", "title": "Own up if you f*ck up", "body": "Maybe you stumbled upon this while still actively considering to break the “big news” to your answerable party.  \n\nEasier said than done, looks better on paper than in person, but here’s some brownie points for owning up if you’re wrong, from a leader’s perspective.\n\n## You Take Everyone Into Consideration\n\nEspecially if you are in a position of authority, you already know what your mates are going to have to go through to blind rush a project. \n\nLack of sleep, absolutely hating what you used to love, refilling your 5th cup of coffee, being irritable at your partner, doubting your work quality. \n\nBeing among [the 73% of millenials](https://www.forbes.com/sites/sarahlandrum/2016/10/05/3-times-when-millennials-should-say-no-at-work/?sh=2f2524091e85) who find it hard to say “no”, more often that not we depend on figures of authority to promote the right culture. \n\n## Deadlines Are More Considerate Than You Think \n\nAssuming you already have the desirable traits of finishing your project under normal circumstances, things just *happen* in life. \n\nYou lose a loved one, your car broke down, your cat went into labour, in most cases clients are more than willing to accept a deadline extension on compassionate grounds.\n\nThis is why pay-to-complete-fast should be discouraged if the minus of the equation is having someone unwillingly stay up at odd hours. They didn’t sign up for that.\n\n## Your Quality Of Work Is Questionable\n\nTime is no state of matter, but one thing they do have in common is that you simply cannot squeeze a few week’s worth of work into 3 days. \n\nJust like a fruit when you cut corners, there’s only so much inefficiencies you discover before you start cutting the product itself. \n\nYou will start feeding your starving to do list with half baked work, in the same way a person who couldn’t care less about his job would. \n\n## The Balance Of Being Humble Yet Responsible\n\nI get it, this is not ideal for everyone if your project is a life or death situation. Surgeon, if you’re reading this please do get back to your operation and consider to have others on shift to step in next time. \n\nNor is something serious enough to own up, if its a university paper you have no interest about I’d give it a pass. ", "timestamp": 1659034898, "digest": "dxi6p5fzSVcTFGmrhG-hbPxwS52Cc4L79_ieLds5z4w", "contributor": "0x955866Ee0bD3B8B0BE4d4EA306670F34b90EF3ed"}
{"id": "N4WISA9E8rd69o34HG_TfK7TFqaHWIQBGbfd7JdPGSo", "title": "$ENIOLA 04: Building in a Bear Market", "body": "*Hey peeps, this is the first update post Launch House + NFT.NYC. Last month there was a focus on launching, launching and launching. For the most part, a unique blend of resources, connections and timelines were in-line to act as a launchpad for various projects (entrepreneurial and personal). It’s been well documented that current market conditions have put a spanner in the works for many start-ups, scale-ups and other builders. Some of my friends have lost the majority of their net worth, whilst others have now entered the job market. In these unprecedented times, the sentiment of many people on crypto Twitter is just to hunker down and build. But reality for the majority doesn’t allow for such basic and unthoughtful advice. All I can say is do what you can to get through the bear market. Get that job AND build, support your family AND build, take care of your body and mind AND build. To be comfortable building a startup in any market condition is some form of privilege in itself; something that builders and investors forget sometimes. Build if it makes sense. Do not be roped in by the simple platitudes you see online.*\n\nI think that’s my most extended introduction to any of my updates thus far → lets' dive in!\n\n### Month In Retrospect\n\n* I wrapped up a month in New York as part of Launch House, Founders House Summer 2022 Cohort (yes, it’s a long title). I had an amazing time there, built connections, had fun and learnt a lot. You can read [articles](https://eniola.mirror.xyz) and view [tweets](https://twitter.com/elijah_ajuwon/status/1528877678115586048?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1528877678115586048%7Ctwgr%5E%7Ctwcon%5Es1_c10&ref_url=https%3A%2F%2Feniola.mirror.xyz%2FA2MwquHQCIlQtTEsTyHJpvtMcDORoeHaisy0a-ZEetw) about my experiences.\n* I attended NFT.NYC for the first time as well, it was a good conference with amazing speakers from the biggest VCs and founders of some of the biggest web3 startups. However, I found that there was more value in the satellite events and after-parties, for me personally. I think I may end up applying to speak at the conference next year.\n* A demo for early.fans can be viewed on our [notion wiki](https://earlyfans.notion.site/early-fans-wiki-7e45427b91d74f29b2889e11b4120386). There you can get to grips with the looks and feel of the first iteration of our MVP.\n* We started having meetings with VCs, from both the United Kingdom and States. As mentioned before this is a numbers game. Each VC has different theses and methods. I have received varying advice from the firms; some of which conflicting but it’s important to build with users, make sure there’s a market and get some early traction. Someone will eventually take the first leap.\n* There were no proposals for $ENIOLA holders to vote on this month. Monthly proposals will make a come-back.\n\n### Biggest Takeaways\n\n* Right now I am unwavering. Even with these market conditions and personal circumstances, my first thought is what can I do to continue building. Do I get a job? Do I split the raise? Who do I partner with or reach out to? Should I relocate? My game plan may have changed but the goal hasn’t.\n* I want to feel small again. When I was in New York, I was constantly being reminded of how unremarkable and small I was. Now I know the language is dramatic and don’t worry I am not going through a quarter-life or identity crisis, it is just impossible for me to be comfortable with my achievements or goals. Some of my peers are doing amazing things. I know that comparison is the death of joy, but I what I took from this was the difference in my personal mentality and drive when around a certain type of individual. \n\n### What’s Next\n\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n* \\[redacted\\]\n\n*To view the redacted content please buy some $ENIOLA you can reach out to me or buy it on [Uniswap](https://app.uniswap.org/#/swap?chain=mainnet).*\n\n\n---\n\n### Final Thoughts\n\nTo the builders (in whatever capacity) reading this,c sondier your environment. When this type of discourse happens people typically focus on their friends and WHO they are surrounded by. However, what is equally important is WHAT are you surrounded by. What resources do you have access to? What infrastructure has been set up in your location? What ecosystems are you plugged into? The whats are as equally important as the whys.", "timestamp": 1659034956, "digest": "d3RTD4bbrAJZ1QZzCFnuZpQYhvcWujabklEYi4o6t-0", "contributor": "0xE314f925f05c8f5e4063Dd19684992196f5d89D9"}
{"id": "GQcOI9zqyI7sps8NdG6wS5LP_oqGjAXODpgqy2ZIOLw", "title": "Deploy your first smart contract to distribute your video on blockchain", "body": "Share is a protocol and dApp built on blockchain that enables creators to choose the price per stream of their audio or video content, distribute the content directly to consumers, make it accessible on any web application, and receive payments instantly when their content is streamed. Share has a wide variety of applications including music, video, and podcasts.\n\n*This article overviews the process to **deploy a VIDEO on blockchain with SHARE** and provides example information that you can use to test out the process.*\n\n\n---\n\n## Prerequisites\n\nIn the *[Share User Guide](https://docs.formless.xyz/share-protocol/guides/share-dapp-user-guide)* you can find the general requirements to use Share. This includes [selecting and setting up a Web3 wallet](https://docs.formless.xyz/share-protocol/guides/share-dapp-pre-release-user-guide/select-and-setup-a-wallet) and [connecting to the Share dApp](https://docs.formless.xyz/share-protocol/guides/share-dapp-user-guide/connect-to-the-dapp). If you haven’t already and are not familiar with some of the Web3 terminology and technology, please make sure you visit these sections and learn about what you’ll need to interact with Share.\n\n## Upload your video file and create a smart contract\n\n 1. **Video file.** Prepare a video file in MP4 format. MP4 is the most popular format for digital video. If you don't already have a video that you want to use for testing, you can use this [demo MP4 video](https://formless-eng.s3.us-east-2.amazonaws.com/share-testvideo.mp4).\n 2. **Website location.** Navigate to <https://share.formless.xyz/create> in your web browser. Here you’ll see a series of steps where you will input information that is used to create the details of your smart contract.\n 3. **Creator Name.** Enter \"My Test Name\". This is the name you use to identify yourself, e.g. your artist name or your real name. This can be anything you choose, for example, you can do things like \"KANYE X JAY-Z\" if you'd like to list multiple names. Your content ownership is uniquely identified through your blockchain address, not the name entered here.\n 4. **Title.** Enter \"My Test Video Title\". Similar to the name field, this can be anything you want. The content will be uniquely identified using its smart contract address. This title is purely for display purposes.\n 5. **Upload.** Select \"Choose File\" and locate the test video MP4 file that we prepared above.\n 6. **Artwork and previews.** Select “Custom Artwork” and upload an image file that meets the file type and size requirements identified on screen. This image will appear as a thumbnail and as a screen cap on your video. Select “Custom Video Preview” and upload a video file that represent a segment of your full video content and meets the file type and size requirements identified on screen. Users will be able to play this content prior to purchasing access to your content. If your content is free, there’s no need to add the Custom Video preview since all of your content will play for free. \n 7. **Royalty Splits.** You’ll see your wallet address auto-populated in the Primary Owner field. When you start uploading content that has multiple creators, you can select the “Split Royalties” box, add addresses of other owners, identify their proportional share of royalties, and they’ll also be added as content owners in your smart contract. For now, keep this unchecked and proceed with yourself as the single owner of the content. This means revenues will flow to your address when the content is viewed.\n 8. **Price For Access.** Enter “0.25”. This means that viewers will need to pay 25 cents to watch your new video. The payment won't require them to enter any financial information, it will automatically flow from their wallet on the blockchain seamlessly. In this example, we're using 25 cents, but the beauty of Share is that you can set this value to be anything that you want. It can be 0 for free content, or any amount you wish, even $1M if that's what you think it's worth. You know your audience and the worth of your content better than we ever could.\n 9. **Apple and Google Pay.** Select “Enable Apple and Google Pay”. This will allow consumers to purchase access to your content using Apple Pay and Google Pay, and they won’t need to connect a Web3 wallet in order to purchase access to your content. This is an optional feature and is only available for content that is priced equal to or above 17 cents. There are a few additional fees ($.30 + 7.9% of the transaction value) that consumers will have to pay for the convenience of using Apple or Google Pay, but depending on your use case and how you’re pricing your content it may make sense.\n10. **Access Grant Time.** Enter 1 DAY, 0 HOURS, 0 MINUTES. This is the amount of time that the viewer will have access to your content after they complete the instant micro-payment. This is also completely up to you. For example, you can set this to be 5 minutes or 5 months. Each time the content is viewed, Share will check the blockchain to see if the viewer still has access. Once the time is up, they'll need to pay again to experience the content.\n11. **Blockchain.** You’ll see \"Polygon Mainnet” auto-populated in the Blockchain field. This is the blockchain that we're going to use to store the contract for the content. As we noted earlier, we're using Polygon because it is fast, inexpensive, and fully compatible with Ethereum. \n12. **Cloud.** This is the backend infrastructure platform used to serve the content file globally. GCP is the default value, but this will be configurable such that you can specify your own server in the future if you'd like to. Please read the [Terms of Service](https://formless.xyz/terms) (ToS) with regard to hosting uploaded content. Share does not have the ability to modify or revoke smart contract assets deployed through the service, however we reserve the right to suspend content *hosting* associated with these contracts. This means if your contract violates the ToS, we will not serve the associated content, and it is your responsibility to update your deployed smart contract with a new URI which points to a Share protocol compliant host.\n13. **Review.** This displays the amount that it will cost to create and deploy the contract to blockchain. You’ll need to have at least this amount of MATIC tokens in your wallet for the transaction to process.\n14. **Deploy.** Select “Create”.  This will create your smart contract. You’ll see a message in your wallet asking you to verify the transaction. Once you’ve verified your transaction will process and result in your smart contract deployed on the blockchain. \n15. **Completion.** Congratulations! You’ve successfully deployed a smart contract on blockchain that is ready for distribution. You can select the link to view your content, or you can copy/past the link to share it with potential customers. \n16. **More.** Read about how you can [Send text messages with smart contract links](https://placholder).\n\n\n---\n\nWant more detail? Visit our [Creator Guide](https://app.gitbook.com/o/Ph5xno4MLS6IY0kdARee/s/vcxQC1Zn1P2Knw0WqAEa/\\~/changes/StIBaIJJO2fgStRVZAHG/guides/share-dapp-creator-guide). \n\nHave questions or need help? Contact us at [info@formless.xyz](https://mailto:info@formless.xyz) or visit us on [Discord](https://discord.gg/hgCpWt2bJq).", "timestamp": 1659035009, "digest": "bd7ymHa2uNXHbplm1VJY32qewbsw_moJ2yvVtvsLVAM", "contributor": "0x659dbD5089A5b6E3747b8C33D24385E8663181e0"}
{"id": "LmZISR81pEi0i2S8mk24bc8kSdleQKdDo3NX9zsilIo", "title": "Experience Autonomy’s Self-Transferring NFTs with MetaDungeon!", "body": "This past weekend, we were thrilled to announce our forthcoming NFT-powered game, MetaDungeon, at this year’s Metaverse Summit event in Paris!\n\n## World’s first player vs. blockchain and aNFTs\n\n[MetaDungeon](http://meta-dungeon.io) is the first NFT-powered game that inverts the classic player versus environment (PvE) genre, and introduces a new concept of [player versus blockchain](https://mirror.xyz/0x6B87AbC02Fc4E2406219C69ecE0280ca39476b31/flj3TLtY-0mtkuwHj46Cr-7bEf6JuCV85zT-Ok09kSY) (PvB) – where players are able to engage and fight with Web3 objects, such as NFTs and on-chain characters. This project is the first time a decentralized automation protocol for NFTs and blockchain games has been deployed.\n\nThe game integrates multiple automation features to achieve [autonomous NFTs (aNFTs)](https://mirror.xyz/0x6B87AbC02Fc4E2406219C69ecE0280ca39476b31/6wGjQ-Saz4YUISqx3oXS1tQXLLOdXaC_WfFYKlqoq-Y), and for the first time, on-chain non-playable characters (NPCs). aNFTs are an iteration of NFTs that have the ability to vote, fund, and even transfer themselves thanks to the automation capabilities of the Autonomy protocol. MetaDungeon is also the first blockchain game that requires players to be collaborative and rely on team mechanics, incorporating other NFT projects which players own as an essential part of gameplay.\n\n\"The vast majority of characters in Web2 games like Cyberpunk 2077 or World of Warcraft are NPCs that interact with each other or the player independently,” says James Key, Founder and CEO of Autonomy. “Through the development of aNFTs, it is now possible to build these types of engaging characters a blockchains. This represents a watershed moment for blockchain gaming and metaverses to build the types of games that generations of gamers are familiar with, and vastly expand the variety of games that can be built on blockchains.\"\n\n## How to participate in MetaDungeon\n\nThe MetaDungeon game consists of Heroes and Bosses, where all Bosses are aNFTs and each player is a Hero NFT. Heroes team up to fight world Bosses (aNFTs) and score loot worth real money. Players interact with 3 sets of NFTs: Heroes, the players in the game; Bosses, who the Heroes fight; and Gear, the unique items that Bosses drop. Players have the opportunity to earn loot from killing each Boss in the form of NFTs and tokens, which a Boss holds. Holding a Player NFT and defeating a boss is all that’s needed to receive loot.\n\nPlayers will be able to obtain a Hero NFT via the Genesis Drop, which will happen in three phases.\n\n* Phase one: Sign up for the [mintlist form](https://form.typeform.com/to/u2RioRYq?typeform-source=blog.autonomynetwork.io) to secure guaranteed access to mint at least one Hero on August 9, 2022.\n* Phase two: Allowlisted communities (who already hold certain yet-to-be-revealed NFTs) will have a chance to mint an NFT on August 10, 2022, on a first come first serve basis.\n* Phase three: There may be a Hero NFT public sale down the line during which anyone will be able to get their hands on the remaining collection of Hero NFTs – if there are any left standing.", "timestamp": 1659036364, "digest": "ATUviwtf37WV2sCcZnHoUCJ7GBUVF1Kza6P2HTLqeoE", "contributor": "0x9C00Beae824b9f7eD84704012f3d245992F81601"}
{"id": "OSdJRqY-1jXJBwL-23EA1XioykXctr-Fv2J4GBdaKXY", "title": "Bundlr Validator Node", "body": "![](https://images.mirror-media.xyz/publication-images/Zf5fCBQTE-Q9IPBGG9c8X.png?height=334&width=1153)\n\nBundlr makes web3 data storage on Arweave accessible on multiple networks and currently accounts for over 90% of data uploaded to Arweave.\n\nBundlr is a Proof-of-Stake network that sits on top of Arweave. Approximately every 30 minutes, 10 validators are randomly chosen to run the network. Nodes (known as bundlers) are used to bundle multiple layer 2 transactions into a single Arweave (layer 1) transaction.\n\n# RUN A BUNDLR VALIDATOR ON TESTNET- JULY 2022\n\n[Bundlr Testnet](https://medium.com/bundlr-network/bundlr-launches-its-first-testnet-4bedd76e7c) is now live. You must use a domain or static IP, dynamic IPs will cause your validator to become undiscoverable. This guide is assuming a fresh install of Ubuntu 20.04 LTS.\n\nHardware Specs:\n\n* Memory: 8 GB RAM\n* CPU: Quad-Core\n* Disk: 250 GB SSD Storage\n* Bandwidth: 1 Gbps for Download/100 Mbps for Upload\n\n## 1. Install Pre-requisite Software\n\nUpdate and install the following packages which are required to continue\n\n```\nsudo apt update && sudo apt upgrade -y\n```\n\n```\nsudo apt install curl ncdu htop git wget build-essential libssl-dev gcc make libssl-dev pkg-config npm -y\n```\n\n### Install Docker\n\n```\ncurl -fsSL https://get.docker.com -o get-docker.sh\nsh get-docker.sh\n```\n\nGrant Permissions for docker and confirm it is installed\n\n```\nsudo usermod -aG docker $USER\ndocker --version\n```\n\n### Install Docker Compose\n\ndocker-compose is a way of saving the docker run command in a file, so that you can just start/stop/modify it easily. Going to be using this for this guide.\n\n```\nsudo apt install docker-compose -y\ndocker-compose --version\n```\n\n### Install Rust\n\nInstall Rust, the following installs cargo a package manager for Rust and rustc the compiler for Rust.\n\n```\ncurl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh\n```\n\n![run what your terminal tells you when it completes](https://images.mirror-media.xyz/publication-images/NYfSIdE5gQIYrSW5aqPRV.png?height=472&width=1264)\n\nrestart your terminal/ current shell and confirm its installed successfully by running the following commands\n\n![](https://images.mirror-media.xyz/publication-images/5JqQeHxTVnCyt96W4eOUT.PNG?height=340&width=1345)\n\n### Upgrade nodejs to v16.16\n\nwe need the latest version to run properly, I got a lot of errors with an older version installed, check current version with\n\n```\nnode -v\n```\n\nClear NPM's cache, Use n to install latest stable version\n\n```\nsudo npm cache clean -f\nsudo npm install -g n\nsudo n stable\n```\n\n![check node version again, if not correct try restart the shell](https://images.mirror-media.xyz/publication-images/K-57VVU4VQWgtJ52aS21u.png?height=297&width=1336)\n\n## 2. Download Repository and Set-up\n\n### Clone the validator repository\n\n```\ngit clone --recurse-submodules https://github.com/Bundlr-Network/validator-rust.git\n```\n\n### Create Arweave Wallet\n\nYou can generate a new one [here](https://arweave.app/), ensure you save the Seed and json file, Now create a file to save your Arweave wallet in the project root at `./wallet.json`.\n\n```\nsudo nano ./wallet.json\n```\n\nopen your .json file you created from the arweave wallet using notepad, copy the entire contents to the terminal, save/write out with ‘ctrl+O’ then exit with ‘ctrl+X’\n\nconfirm its there, you should see your wallet.json\n\n```\nls -la\n```\n\n**Copy Wallet to /validator-rust/ directory also**\n\n```\nsudo cp ./wallet.json /home/ubuntu/validator-rust\n```\n\nmake sure its the correct location (might be different from /home/ubuntu/, you can use ‘ls -la’ to find and also confirm its there once done.\n\n### Environment Variables\n\nchange directory\n\n```\ncd validator-rust\n```\n\nyou should have a example.env file in your /validator-rust/ copy the example.env file\n\n```\nsudo cp example.env .env\n```\n\nopen the file to edit\n\n```\nsudo nano .env\n```\n\nReplace the contents of the Example file in the terminal with the following\n\n```\nPORT=80\nVALIDATOR_KEY=./wallet.json\nGW_WALLET=./wallet.json\nBUNDLER_URL=\"https://testnet1.bundlr.network/\"\nGW_CONTRACT=\"RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKA\"\nGW_ARWEAVE=\"https://arweave.testnet1.bundlr.network/\"\n```\n\nThis is from the [docs](https://docs.bundlr.network/docs/participate/Types%20of%20Nodes/Validator/validator-join#environment-variables), Database_URL can be ignored, the 1st validator Contract for this Testnet is the following:RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKAbe sure to check the pinned messages on Discord, for any updates on this\n\n![](https://images.mirror-media.xyz/publication-images/4llzLBxvPhq4csJLPyLXH.png?height=294&width=1004)\n\n## 3. Build and Run the Validator\n\nchange to the correct directory\n\n```\ncd /home/ubuntu/validator-rust\n```\n\nonce in the Directory run to start docker file, -d to detach and run in the background\n\n```\ndocker-compose up -d\n```\n\nthis should start 3 docker containers, if successful we can confirm by running, which shows all running containers\n\n```\ndocker ps -a\n```\n\n![Check the Logs of all three, to confirm no errors](https://images.mirror-media.xyz/publication-images/TIbDt1Vl1Y7KmFsC5XJWH.png?height=84&width=1000)\n\n```\ndocker logs -f <container-name>\n```\n\nif you need to go back to make any changes such as checking your .env file or wallet.json file is correct (usually to culprit of errors) you need to stop and remove all three running containers\n\n```\ndocker stop <container-name> && docker rm <container-name>\n```\n\nNow we should have the validator running in the background, we can move on the registering and staking the validator\n\n## 4. Register Validator and Stake\n\n### Install Testnet CLI\n\n```\nsudo npm i -g @bundlr-network/testnet-cli@latest\n```\n\n### Claim Tokens from the Faucet\n\nYou can claim Testnet tokens [here](https://bundlr.network/faucet), you will need a valid twitter account and the Arweave wallet address created earlier.\n\n**check balance**\n\n```\nnpx @bundlr-network/testnet-cli@latest balance <YOUR-WALLET-ADDRESS>\n```\n\n![should see something like this, press y to confirm, it may take a while to output your token balance](https://images.mirror-media.xyz/publication-images/H0nM-5DuaM6OtzTXaElqG.png?height=78&width=859)\n\n### Register Validator and Stake\n\nto join the Testnet run the following\n\n```\nnpx @bundlr-network/testnet-cli@latest join <validator-contract> -w <path-to-wallet> -u <validator-url> -s <stake-tokens>\n```\n\n1st validator Contract (in pinned messages on discord): RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKA\n\nPath to wallet: ./wallet.json\n\nValidator URL: http://<your-static-IP-address>:80\n\nStake Tokens (amount claimed from Faucet): 25000000000000. `-s <stake-tokens>` this can be omitted and the CLI will default to the minimum required stake in atomic units\n\nWhen successful it should say ‘done’ and this can take up to 20-30mins.\n\n## 4. Other Commands \n\n**Check Validator balance**\n\n```\nnpx @bundlr-network/testnet-cli@latest balance <address>\n```\n\n**Check validator is active**\n\n```\nnpx @bundlr-network/testnet-cli@latest check <validator contract address> <your address>\n```\n\n![press y to proceed and it should return the result like so](https://images.mirror-media.xyz/publication-images/R2fsyv8MaEkyvb3q5iM23.png?height=88&width=1174)\n\n**Upgrade validator (latest release)**\n\nto upgrade to latest software version run the following from the `validator-rust` directory  \n \n\nupdate the repository \n\n```\ngit pull origin master\n```\n\n \n Build \n\n```\ndocker-compose build\n```\n\n \n Run again, check logs using the command from part .3  \n\n```\ndocker-compose up -d\n```", "timestamp": 1659036455, "digest": "LZ8RKCblMsNdXOfhW3M6xlOz5yiPtXxBKavjIpA71Xg", "contributor": "0xf3bF9DDbA413825E5DdF92D15b09C2AbD8d190dd"}
{"id": "HSljW0nF6TJOYHcDb3N-cMzOcZlTXAZguxlV3wisAxE", "title": "To Make a Universe ", "body": "(Thoughts about ecosystem development & the Shimmer dApp space)\n\n![Southern Ring Nebula; source](https://images.mirror-media.xyz/publication-images/Ep_zZhZ0h77W8e6VfDaGM.png?height=457&width=491)\n\nObservers floating in the void before the big bang would have sounded similar to a few rascal degens living in the Iota discord’s meme channel:\n\n![](https://images.mirror-media.xyz/publication-images/2lR7rKDUEAKIDI9K87CpH.png?height=913&width=407)\n\nFortunately for them, it turns out the answer is *right about now*. With the release of the Shimmer beta, projects will be pushing the limits of its features. With the following Shimmer mainnet, smart contract functionality, and a little bit of luck, we will see an explosion of dApps hurling themselves into the Shimmer universe.\n\nThe job of ecosystem development within the Iota Foundation is to make this bang as loud as possible.\n\nFor transparency, I thought I’d take a second to explain this effort and my involvement in it.\n\n*Note: everything here is from my own point of view and doesn’t necessarily reflect the opinions of other within the Iota Foundation or even in the Touchpoint crew. It’s also very much a joint effort and I’m just one of many trying to build the best ecosystem possible.*\n\n# A bit about myself\n\nAdam / [@Schpoopel](https://twitter.com/Schpoopel) here. My first interaction with cryptocurrency was installing — and subsequently forgetting — the Bitcoin mining software on my computer in 2010. I’m not sure it even fully synced to the network.\n\nIt wasn’t until 7 years later that I purchased my first bitcoin.\n\nDuring this time I was schlepping around the globe as an army aviation officer. After nearly a decade of this, I went back to university. Yet, this weird hobby with magic internet money kept pulling at my attention…\n\nI was keeping an ear to the themes of crypto, playing around in different ecosystems, trading my way up (…and down), minting NFTs, falling for the odd scam, and thinking about decentralization and the difference between innovation and vaporware. Eventually I gave in and focused on crypto full-time.\n\nMy first professional assignment in crypto was spent scribbling and designing educational courses for [ZeFi](https://zefi.com/en), which aims to bring crypto knowledge to the Arabic-speaking world. Luckily for me, their content is also in English (my Arabic doesn’t get much past *habibi*). During my tenure there, we wrote beginner courses on blockchain, smart contracts, cryptocurrencies, and NFTs, while participating in talks on the social impacts of distributed ledger technology. I also traveled a bit to help spread the good word.\n\n[https://twitter.com/Schpoopel/status/1524764276413636609](https://twitter.com/Schpoopel/status/1524764276413636609)\n\nLater, I was fortunate enough to get picked up as an ecosystem developer by the Iota Foundation, which I’d followed since I initially drifted into the crypto space. The task at hand: contribute to a flourishing and robust universe of decentralized applications (dApps) built with Iota smart contracts.\n\n# “Ecosystem Developer”\n\nA job title as equally ambiguous in crypto discords as at family dinners (on par with “consultant”), one could be forgiven for assuming I’m either doing something for the environment or programming. While I enjoy those things, the job *instead* entails building up a network of applications that are usable, useful, economically sustainable, and even fun.\n\nSometimes this effort involves learning lessons from other protocols, e.g. when examining how Avalanche’s daily active users (DAUs) got up the slope (unaltered [source](https://messari.io/article/state-of-avalanche-q1-2022)):\n\n![I may have added too many red lines](https://images.mirror-media.xyz/publication-images/bwbS_Ik7sdkmzRJm0P7BW.png?height=511&width=914)\n\nAt other times, I’m reaching out to payment gateways (Simplex, Transak, etc.) to see how we can get a fiat-on ramp onto the native Firefly wallet.\n\nRegardless of the task — of which there are many — everything revolves around making Shimmer and Assembly as successful as possible. Perhaps nowhere is this effort more evident than in our open builder's program, Touchpoint.\n\n# Builders. Investors. Experts.\n\nTouchpoint was designed late last year and officially [announced](https://blog.assembly.sc/introducing-touchpoint/) in March 2022. A product of [Dan](https://twitter.com/DanSimerman), [Corey](https://twitter.com/CoreyST_), and [Christian](https://twitter.com/christiansaur2), the vision was to create a dedicated space for builders to work together while getting hands-on support from the IF and connect to investors. You can think of it as a mix between being a cohort-based accelerator (a la Y-Combinator) and an ecosystem hub. Such a space, involving recent multichain converts and pioneers of Iota tech alike, allows us to find and remove common obstacles between the projects.\n\nOur “hands on support” can take the form of introducing projects to potential partner dApps, investors, or a slew of experts ranging from product designers to code auditors. We’ve even met up personally with some of these projects at Iota meetups and at the Berlin office to talk through their roadmaps.\n\nSome other activities that have gone on in Touchpoint are:\n\n* **Networking**: We made connections with law firms and smart contract auditors, to find cost-effective solutions for project teams. Projects have also coordinated among themselves and with IF members on ideas for e.g. DeFi educational platforms.\n* **Fundraising**: We advised projects on their fundraising strategies (developers don’t work for free after all…), discussed valuations, and reviewed a hefty stack of pitch decks.\n* **Communications**: Suz ran an excellent communications workshop, and the projects have since had 1:1 assistance with her on their their comms strategy. We’ve also helped them gain exposure via blog articles and retweets.\n* **Product studio**: The Iota design studios held a community call and worked individually with UI / UX / product strategy among the projects.\n* **Technical Support**: Ani, our developer advocate, and some from the Iota Smart Contract team have been in close contact with many of the projects in the discord, allowing them to prepare their dApps for deployment.\n\nIn these aspects, Touchpoint is unique in the crypto space; we simply do not find this level of support, open communications, and networking in other ecosystems (…we asked around).\n\nThis is also a lot of work! Christian has the honor of managing **over one-hundred-fifty channels in the discord**… This spans around 50 groups, all of which are at different developmental stages (from ideation to launch). Besides the general chat rooms, there are chats with each project, investor, expert, and matchmaking channels where we introduce projects to each other. You know all those “we at \\[X\\] are proud to announce a partnership with \\[Y\\]”? You can thank him for some of those.\n\nThis isn’t to mention the telegram groups we facilitate between, say, a project and an outside auditing firm. Lastly, there’s the screening, which involves 30 minute calls with the projects to make sure they are seriously building something relevant for the ecosystem. Multiply this by 200 applicants, and our time gets filled up very fast.\n\nBecause of that, we expanded the team. Even while many VCs went “risk-off” with their capital and tech layoffs abound, the Touchpoint team took me on board in February. More recently, [Austin](https://twitter.com/bandalof17) joined up as has been focusing on outreach into other ecosystems. If you need a reason to be optimistic about how seriously we take Shimmer, here you go.\n\n# The State of the DAppspace\n\nMeanwhile, teams have had their heads down in development mode. Even as the IF fine tunes the Shimmer mainnet, many projects have claimed a piece of this universe for themselves. These include DEXs, wallets with in-app payments, lending protocols, yield aggregators, metaverses, meme projects, domain name services, NFT marketplaces, launchpads, DAOs, infrastructure projects on the level of Alchemy/Infura, real-world asset platforms, and games. The full list can be found [here](https://shimmer.network/ecosystem).\n\n*I should note that not all of these projects are working with Touchpoint. This is of course ok! If a project team wants to go on their own and not be a part of Touchpoint, more power to them. But we’re here if you need us. :)*\n\n![Shimmer on, you crazy diamonds](https://images.mirror-media.xyz/publication-images/eyoFS6YItMn2IZzn-1hFn.png?height=537&width=813)\n\nIt is not only dApps that are popping up. We also have [seriously](https://www.youtube.com/channel/UCj013MZSgIOlUdi9Mzx51mw) [informative ](https://open.spotify.com/show/387nS9czdx47kJZ6Mho28m)[and](https://www.youtube.com/channel/UCS0Tr-pPipB-dg0ISaiUlIw) [funny](https://www.youtube.com/c/SpecWeekly) content producers spicing the place up (and this is only the English content!). Thanks to these creators, our message is starting to build and propagate. People are becoming aware about feeless native assets & NFTs on the layer 1, unchained liquidity between layers and smart contract chains, and our composable architecture.\n\n# Going Forward\n\nIs that all? Well, no, we are also in looking into bringing oracles, bridges, indexers, stablecoins, block explorers, blue-chip dApps, and multi-signature wallets into the ecosystem. I can’t spoil anything here, but I can say that some of these conversations are already months in the making.\n\nWithin the Touchpoint program, we are working to source more funding for projects. One of our biggest challenges has been to get capital flowing to projects during a year when 2/3 of the crypto market dried up. Fear not! We are connecting with more investors, and converting older connections to the Shimmer vision.\n\nTouchpoint will increasingly leverage its role as a coordinator to host events within the server, as well as helping the project teams broadcast their events outside of it. From these, the community can expect more talks, demos, and generally more awareness for the dApps and the ecosystem at large.\n\nWill it all be enough to outshine (✨outshimmer?✨) the [hundreds](https://chainlist.org/) of EVM-compatible networks in existence? We’re doing all we can on that front, but part of this relies on you too, dear reader. Here’s how to get involved:\n\n* coordinate meetups / Stammtische and invite your favorite IF member\n* get involved on the [Iota Governance Forum](https://govern.iota.org/)\n* vote in Firefly\n* [apply](https://airtable.com/shrxW5Fs6NGDOkkBv) for Touchpoint\n* register your project on the [ecosystem page](https://shimmer.network/ecosystem)\n* listen out for the community calendar\n* follow [any](https://twitter.com/Schpoopel) [of](https://twitter.com/DanSimerman) [us](https://twitter.com/CoreyST_) [on](https://twitter.com/christiansaur2) [twitter](https://twitter.com/bandalof17) (or [on](https://medium.com/@christiansaur) [medium](https://simerman.medium.com/))\n* invite us to your twitter space, online event, podcast\n* keep building\n* don’t be a stranger\n\nFor my part, I will be available on discord and twitter. Feel free to ping me to talk ecosystem dev stuff! Perhaps you know of a project we should be looking at, or just want to know where our attention currently is.\n\nUntil next time, I hope this gives some insight as to what is going on behind the scenes and how we plan on making the biggest boom in the crypto space.\n\nMay all your *wen’s* be *soon*. \n - Adam", "timestamp": 1659037050, "digest": "rfur0bC0hIec1nn-pZrHBvkqF8Yh8wlB0cXsRmHm7U0", "contributor": "0x654D34445eb7fe967aA95aAFC0C614592F43a33e"}
