{"id": "GPX4fP3gCGCyaRx7CrA_AfRCAA6d2vXym_i6qpIo-fQ", "title": "DeClick: Building the Content Layer of your Decentralized Identity", "body": "## Abstract\n\nSince its birth, users and platforms have cultivated the Internet’s ecosystem together. Companies planted their ideas about what the Web could be and then fertilized them with user data to help them grow. This was a winning formula. Today the web’s ecosystem is teeming with platforms competing to provide users with high-quality services to meet their different needs. We’re glad that things have come so far.\n\nBut, this is only part of the story. The users, although integral to the Web’s ecosystem, have not reaped the same rewards. This is because as these centralized platforms grew so did their power, which they then used to monopolize the Web. Users generated value and data for the platforms, but never really owned anything. And, because of the network effects, they were basically held hostage by the platforms.\n\nThen, to continue to grow, these platforms deployed creative ways of making these platforms more sticky to extract even more data and value from users. More and more the internet started to resemble the original (ガンム) Alita movie, where the people of Zalem were nothing but Jerusalem's human guinea pigs.\n\nThis is the state of Web2. The corporations that dominate the Web have lost sight of the original vision of the Internet: One for all, and all for one.\n\nHowever, the story continues. As a reaction to the corporatization of the Internet, a new era is emerging: Web3.0. This is a place where decentralization, self-sovereignty, and personalization are at its core. And, a place where platforms can no longer hold users hostage by owning all the data.\n\nBut, to make this happen the Web3 world has to be built around the user’s decentralized identity (DID). That is, the DID is what will make the Metaverse possible.\n\nIn Web2, centralized platforms are the creators and controllers of your digital identifiers. But, in Web3, you as the self-sovereign user are completely in charge of this.\n\nThus, DeClick’s vision is to help users create a robust DID, with which they can quickly build their Metaverse environment in any Web3 product. While simultaneously providing the infrastructure for all Web3 developers to integrate and build on.\n\nTo do this, DeClick’s mission is to help build the Content Layer of users' DID. A crucial part of a multifaceted, rich, and, thus, useful decentralized identity.\n\n## Web3.0 and the Metaverse: Why the decentralized identity (DID) matters\n\nWhy is the DID key in this new era of the internet? The answer can be found in three essential but incomplete definitions of Web3:\n\n* The interactions of information on different websites and the information itself can be integrated and used through a third-party platform.\n* Users own their data and can use it on different Dapps.\n* User can audit and synchronize the data with the network.\n\nWe’ve already seen the Web3 user-generated content (UGC) platform dedicated to building decentralized content creation (such as mirror.xyz), products, and protocols dedicated to decentralized social networking (such as CyberConnect and Lens), and a variety of on-chain games.\n\nWhen users interact with these products and generate data (such as trading, creation, playing, etc.) this should not belong to the platform. Instead, it should be stored in a decentralized way to build the user's DID.\n\nSuppose the Metaverse product is like a projector that plays a scene for the user. The scene must be constructed with a combination of user content preferences from different platforms to make it a meaningful experience. The user's DID is the film that the projector uses to project images. In other words, the DID shapes the Web3 world for the user.\n\nWe believe that due to the nature of Web3, the user identity will drive everything. When a user connects with a product for the first time, the developer will provide services based on the user's identity information. For example, when you sign up for Twitter, you don’t need to enter your interests. The content you like on Youtube will be content you’re interested in. The people you follow on Facebook will be the default accounts you follow. The groups you join on Reddit will be related to the topics you like.\n\nIn the Metaverse, the user’s interaction preferences will be used to organize the content of a platform to make it a more personalized experience. For example, if you are a crypto trader, the content from the trading group on Reddit should have a higher weighting than NBA content on Facebook. In other words, interaction preferences are the elements to make up your Web3 world.\n\nIn sum, we believe that DID is vital to both Web3 and the Metaverse.\n\nBut, as things currently stand, the asset data (such as crypto and NFTs) that compose DIDs is weak and one-dimensional. For example, if you have not traded BTC for some time, does this mean you’re not interested in BTC anymore? It could be that you’re still interested but have paused active trading to watch market trends. Ideally in this situation, the developer would analyze your DID to discover that you joined some BTC communities during this time to make a better judgment about your attitudes towards BTC.\n\nFinding a solution for a more robust DID is more important than ever as, on the horizon, is the “Web3 content summer”. But, this new season raises some important questions: What content should be distributed? How should content be organized and categorized? DeClick is answering these questions with its Content Layer concept that will, in turn, help users enrich their DIDs.\n\n## DeClick is more than just a Web3 content distribution platform\n\nDeClick is entirely different from other products - our policy is far more radical. We are developing a content distribution mechanism based on the user’s DID, which provides a decentralized, personalized, and self-sovereign content distribution service. A service that also simultaneously enriches the Content Layer of the user’s DID by feeding data back to the chain.\n\n### Data Source\n\nThe Content Layer of a DID stores all the data on the user’s content preferences. In other words, the Content Layer uses the following data to reveal the “Web3 DNA” of the user’s DID:\n\n* **User wallet**\n\n  User asset profile (different types of assets preferences)\n* **Social connections** \n\n  Friends’ content preferences (content preferences based on the social graph because great minds think alike)\n* **Interactions on Web3** \n\n  The rest of the on-chain data (non-asset-related content preferences, such as creation, reading, playing, etc.)\n\n### Distribution\n\nSimply connect your wallet to read the most relevant content for you. That is, content that is matched with your personalized information. Through our algorithms, we aim to give you a more personalized, convenient, and interactive reading experience.\n\n* **Establishing a content preference model**\n\n  DeClick establishes the users' content preferences by analyzing data within the user's asset profile, social graph, and other Web3 interactions. Then DeClick generates the user's “Web3 DNA Tags” and ranks them according to interaction tendencies. For example, if your assets are mainly composed of NFTs from BAYC, the BAYC Tag must be ranked first.\n\n  In sum, when you connect to DeClick using your wallet/ENS, content will be distributed according to categories that correspond with the “Web3 DNA” that makes up your DID.\n* **Establishing content relevance**\n\n  There is an unfathomable amount of information out there related to each Web3 DNA Tag. But, what DeClick does is help you as the user filter this information. We do this with our filtering algorithm that identifies relevant content that often gets overlooked while also eliminating anything irrelevant or distracting. In other words, we help you find the signal in the noise.\n\n  We use AI to interpret the connotations behind the data we have aggregated, and then structure these interpretations into simple keywords. Then we use keywords to determine if the content is relevant to the user's Web3 DNA Tags.\n* **Establishing content authority**\n\n  Even after eliminating all irrelevant content, what’s left over is still not in a coherent state. The next step then is to go through all the data and help users organize it in a more logical order.\n\n  DeClick achieves this by judging the content creator's “authority” on the respective subject through their on-chain behaviors. For example, if a vast amount of assets are traded at the author's address every day, then there is no doubt that his or her views on market trends should have a high weighting.\n\n  Once establishing the content authority of a creator, we then distribute content to users using an “authority scale”.\n* **Supplemental Web3 information enhancement**\n\n  DeClick will provide information enhancement services of content to give users supplementary information.\n\n  We will do this by analyzing the content and the on-chain behavior of the content creator. For example, a user holding a Yuga Lab’s NFT will see related content on the homepage.\n\n  But, DeClick will not stop there. Suppose you come across the term \"blue-chip NFT\" in a Yuga Labs related article. DeClick will deliver to you blue-chip relevant information and other articles that also reference this \"blue-chip NFT\" as an enhancement to the article.\n\n  Then DeClick will go even further by analyzing the author's on-chain behavior and then match it with your Web3 DNA Tags so the platform can gather even more relevant content for you.\n\n### Enriching the Content Layer of the user’s DID\n\nDeClick will upload two data points between the user and the content:\n\n* **Relationship data**\n* **Interaction data**\n\nThis will mainly be in the following forms:\n\n* **Web3 DNA**\n\n  With the user's authorization, DeClick generates Web3 DNA Tags for the user and will then transmit these to the chain as basic information of the user's DID.\n\n  Web3 DNA Tags and tag rankings represent the user's preferences for content in a field. The Tags will change with the user's interactions on the chain, such as adding, disappearing, rising, or falling.\n* **Correlation and weighting of content**\n\n  DeClick will calculate the relative distance between the user and the content to indicate the degree to which they match. The shorter the distance, the higher degree of the match between the content and the user.\n\n  DeClick will also calculate the correlation between the user and different content that is in the same field, to represent the weighting of the content in this field. That is, the larger the value, the higher weighting the content has.\n\n  These values will be uploaded to the chain along with the user's interaction data to form the Content Layer of the user's DID. With the user's authorization, the developers can have a preliminary understanding of the match between the content and users and the quality of the content.\n\n**Architecture(v1)**\n\n![Architecutre(v1)](https://images.mirror-media.xyz/publication-images/0bk0FpcjDipUxjSJkPel-.png?height=275&width=512)\n\n## How can developers use and co-build with us?\n\nAfter DeClick opens the API or protocol, you as a developer can quickly get the user's content preferences and the correlation and weighting of the different content. This means you no longer have to worry about collecting user portrait data to enrich the Content Layer of your Web3 creations.\n\nWhen a user uses your Web3 product for the first time, you can directly obtain user's content preferences from the Web3 DNA in the Content Layer of DID. This allows you to immediately start distributing content to the user based on known relevance and weighting values. This, of course, doesn’t prevent you from uploading the relevance and weighting values that you think are more reasonable.\n\nFinally, to ensure that DIDs become more and more robust over time, reciprocity has to be a feature. This means that you must also upload data when accessing it from co-builders. Because the Internet should be: All for one and one for all.\n\n**Join us and let’s create the Web3 content summer together!**", "timestamp": 1657886479, "digest": "aEBlEYhoJ8xVFs8KWPJ3f_hAXqf1H9KeI8Wn1vzKCtM", "contributor": "0x98Ab6c021a8E2f9aA92F3804eedF85cDf6742b7E"}
{"id": "smGHybkczX5-_WUZ7rQbEpOMvDhrAMBLNL-VV6EAqDg", "title": "Soulbonds x DegenScore", "body": "One of the core values of web3 is collaboration over competition. Fewer zero-sum games and everyone profiting from productive collabs are just some of the things we all love about this space. That's why we believe that good partnerships are part of a strong foundation for every project. If you are familiar with the Soulbonds project, you probably already know about our partnership with [DegenScore](https://degenscore.com). In this short article, we want to explore more about what the DegenScore team has been up to, what's in it for Soulbonds holders, and how we all can benefit from these partnerships.\n\n# What is DegenScore?\n\n[DegenScore](https://degenscore.com) is a web3 platform that allows users to check out and add context to their past transaction history in a super exciting and gamified way. After connecting your wallet, you will be assigned a score based on how much crazy stuff you have encountered on-chain. Apart from the general score, ranking you somewhere between a pleb and degen, you can also receive unique achievements for certain transactions. The OG version of DegenScore premiered in 2021, right after the great DeFi summer. Since then, the project has constantly been evolving, optimizing how they can collect and process users' on-chain data, following all the most recent DeFi and general crypto trends, to keep their achievements platform up-to-date. DegenScore doesn't store user data and only reads and processes it off the blockchain when users request to get a score through their DApp. The team has recently revamped their DApp once again and returned to web3 with a brand new platform known as DegenScore Episode 2.\n\n# How does the partnership work?\n\nDegenScore is becoming one of the largest projects in the web3 reputation space, and they plan to expand further. Despite the complete transparency, analyzing large amounts of on-chain data isn't a trivial task. The team at DegenScore has built a unique way to consume large amounts of transactions on the Ethereum blockchain and filter this information into interesting highlights for the user to form a web3 reputation or identity. The idea of the partnership is straightforward: DegenScore wants to allow other projects to build on top of their infrastructure so they have opened it up for developers and partners and develop some use cases. On the other hand, we have a cool idea of how to put this data to good use. Our collaboration helps their team spread awareness about their product and develops their ideas further into the latest web3 trends.\n\n# What About My Data?\n\nYou might be wondering what does this mean for your data, how it will be treated and is it safe? Let us assure Soulbonds are much safer than your average project mutable NFT project. There are two sides that we need to explain. Firstly, all your metadata is stored on a fully decentralized [Ceramic Network](https://ceramic.network). We use our server to construct your images as you add more and more traits to them. This data may not be lost, damaged, or edited by anyone else, even if our infrastructure is attacked. Ceramic also provides an immutable unique ID number for your data so that when it is modified, data isn't moved to another URI, unlike in classic decentralized storages like IPFS. This immutability allows us to relieve the users of the gas burden. Once your token is minted, you don't have to overwrite anything on the blockchain. On the other hand, your data is still securely stored and steadily available from Ceramic, unlike with many other dynamic NFT projects where the [centralized server](https://www.colony.online/blog/centralized-vs-decentralized-metadata-for-nfts) is responsible for serving your NFT metadata.\n\n![Soulbonds DApp Architecture](https://images.mirror-media.xyz/publication-images/_gzwVBI-I5NUM5gO1FnNJ.png?height=4167&width=6250)\n\nWe barely use your data, we do not write, store or cache any of your wallet data. Your wallet is primarily used for signing stuff in our DApp - this way we can protect you from intruders who might want to play around with your avatar without your permission. We will take your wallet's public address and pass it down to our colleagues at DegenScore via a secure private communication channel. In return, they will conduct the analysis internally and get back to us with your score and a list of your achievements. We will use this response to show you which additional traits you can apply to your avatar.\n\n# Web3 Is Collaboration Culture\n\nWe at Soulbonds are proud of our partnerships because we believe collaboration is the way to go in the ever-evolving crypto world. This collaboration allows DegenScore to have another prominent use case for their platform. For Soulbonds we now have a solid sustainable web3 product, and everyone else has an opportunity to have a beautiful personified avatar based on their on-chain activity. We also now have strong bridges being built between our communities - DegenScore is particularly popular among strictly DeFi ape audience, and we can help bring some of these users to the world of NFTs. We can show that it's not just about the speculation of assets. It can be much much more.", "timestamp": 1657886584, "digest": "m_mYl9n3GKg9HljcUhBdXjcGCkBwGl3-Qgr_FZgVlow", "contributor": "0x10f55205fAAAED53B24ACCc6294730897D005Acf"}
{"id": "WeETI5Z1HBhdKR56JHSOm65gX15YQqIJbuCmMuQL4DM", "title": "Supercut of us - 46/3650", "body": "23:00-08:00\n\nU2FsdGVkX1/lN71VCqi3vehxyp5AgsXc4rjZJFFuNwg=\n\n08:00-10:00\n\nU2FsdGVkX19poaMMQdsURdS9BbJMoWdl2OGBhS0cGOk=\n\n10:00-12:00\n\n12:00-13:30\n\nU2FsdGVkX1/gWneQLAlTG5PucU7YTyRzRwATwBq+AjE=\n\n13:30-15:30\n\n15:30-17:30\n\n17:30-19:00\n\n19:00-21:00", "timestamp": 1657886566, "digest": "5s4V5f_G6bgj0Faasg4fNFdNK6D7CAMqpJxVwR2JJ4I", "contributor": "0x3dB40d2fA3614a2392Bf4E0799Eabbe6BaB226Ec"}
{"id": "hdfTjlTO4grFFRMmjz6f2T2sQWPhLyD-YC8jkgGlvIM", "title": "Weekly NFT Report - 15th July", "body": "## NFT Marketplace Update\n\n**Let’s take a look at some macro stats to get an idea of the current NFT market landscape.**\n\nOpensea's daily volume for July remains above 30 million. Analyzing the 30 days, we found that June 16th and 17th were the lowest volume days. Since then, there has been a steady increase in volume and market participation.\n\nHowever, compared to last month, the volume is down nearly 35%. Why? Probably because of uncertainty in the market. But on the other hand, the market cap is in the green and is beginning to increase. We see around a 7% increase from the previous month.\n\n![source : NFTGo](https://images.mirror-media.xyz/publication-images/ydlmVucus634O-K-SLZt-.png?height=485&width=1234)\n\nIf we look back at the volume from a 12-month view, we can see that we are far off from all-time highs and even median volumes. \n\nWe can also see that July tends to be a quiet month for NFTs with decent volume returning from August. It means we will have plenty of profit-taking opportunities in the coming month!\n\nHowever, in contrast to last year, we are currently in a bear market and we’ll have to see how the coming months play out.\n\n![source: dune](https://images.mirror-media.xyz/publication-images/vHYbJZowUJlFNTsRpL8r2.png?height=545&width=913)\n\n## Volume is Down but Activity Isn’t\n\nIf we take a look at the general NFT activity, we can see that the buyers vs sellers ratio is not as drastic as the volume and market cap numbers.  It suggests NFT traders and investors are actively committed regardless of ETH vs USD price movement. This is positive sign for the NFT space.\n\n![source : dune](https://images.mirror-media.xyz/publication-images/BwMGTu1wUlZbE56F0ayyG.png?height=392&width=911)\n\nDaily buyers and sellers remain between 20-40k. This suggests that many of the users of opensea are traders flipping between collections. With August around the corner members should use that month to exist collections that they no longer want to hold.\n\n![source: dune](https://images.mirror-media.xyz/publication-images/BvnI_Zw6ugcL7iU_q1bPU.png?height=388&width=910)\n\nIf we zoom out to a weekly, demand is outstripping supply. This is very good for the NFT space - as long as you are buying into the right projects.\n\n## NFT Collections Check\n\nWhen we look at the top collections, most of them are in green in the last 7 days. There was hype surrounding Otherdeed as load tests took place during the 1st half of July. Otherdeed NFT holders were invited to participate in testing the Otherside metaverse and were asked to perform simple actions like run, jump, text, and voice chat. The excitement was reflected in increased trading activity. \n\nWhile the ETH price remains low, investors are picking CryptoPunks. The dollar value against Ethereum means blue-chip NFT projects are cheap compared to their relative ETH value a few months back.\n\n![](https://images.mirror-media.xyz/publication-images/2dBg1TFplxX0JDfxFEq7m.png?height=849&width=1218)\n\n## Top Trending Collections\n\n![source: nft stats](https://images.mirror-media.xyz/publication-images/XHed6xhpHx57Av4qavOGP.png?height=411&width=1211)\n\nWe mentioned The Possessed NFT last week. Much hype surrounded the project. The PFP can switch between states of being Blessed and Possessed. With a floor price of 0.54 ETH last week it has dropped significantly. At the time of writing, it has a current floor price is 0.21 ETH.\n\n## Tip of the Week\n\nWe will kick start a series of NFT tips - our first tip is staying safe with NFT mints.\n\nWe have seen a sudden trend of collection sizes reducing from 10k to 3k or 5k collections. \n\nIn line with this, free mints has become a trend where entry into a collection is just the ETH gas fee away. The collection owners aim to recoup their artist efforts by setting a royalty fee every time the NFT is sold - this allows them to have re-occurring revenue on every sale whilst building a community in the process.\n\nWith the low barrier of entry, scams are rife, and below are our tips to stay safe:\n\n### Tip 1: always use a burner wallet. \n\nThis has been said many times, but use a wallet with minimal ETH and no valuable assets in it. One wrong signature and your 50k ape disappears. On a related note, don't keep your valuable NFTs in a hot wallet, rather move them to a hardware wallet.\n\nA burner wallet is separate (temporary) from your main wallet (Vault), which is mostly used for minting NFTs or interacting with a dApp that is not audited.\n\nYou can create a burner wallet just like any other wallet but for a specific purpose such as minting NFTs or interacting with an unaudited project. \n\nA burner wallet could be a hot or cold wallet where you keep only a minimal amount to pay the gas fees for minting or interacting with any smart contract. \n\nPlenty of new NFT projects are being launched every day. Most of these projects do not have code audits of their minting process. In such cases, any hacker can write a code giving them access to your crypto wallet while minting an NFT. It can further lead to draining your current NFTs and crypto assets. By using a burner wallet, you are minimizing such risks.\n\n### Tip 2: Mint from a contract whenever possible. \n\nThere have been many scams where a project advertises a free mint on their site, but changes the mint button to a signature request for you to approve transfers to your valuable NFTs. This is how your NFTs get stolen quickly. (*Watch out for our guide for minting directly from a contract address)*\n\n### Tip 3: If the contract is unverified on etherscan, run for the hills.\n\nFor a free NFT mint, this almost guarantees something malicious is going on. Unless you know how to read through decompiled bytecode, we highly recommend not to mint. \n\nWell, that is a wrap for the Weekly NFT Report! See you next Friday.\n\n** \n  \n **", "timestamp": 1657886722, "digest": "10qlV0d4Z5bwtXrmWwAKywiX83lkGocerKxYwMGI4K8", "contributor": "0x184254ca63135943e5b33a06c65f01E3c91C0E9F"}
{"id": "ykblq-qo7K16E1yfOfPJqfOXfPmKv3lAcZJlVCKiZi8", "title": "Hello, World!", "body": "Hello, World!", "timestamp": 1657886717, "digest": "Avzg7QJkXHUqHNLMjtA2Ml81_SHsoy8V4OO896nAMRQ", "contributor": "0x345163b58C9090d286cF89d39920526672cBF842"}
{"id": "aUEAtECpl31H7tlU7GX-7Atb6_Q4JQuImei6zlaFgzo", "title": "Weekly NFT Report - 15th July", "body": "## NFT Marketplace Update\n\n**Let’s take a look at some macro stats to get an idea of the current NFT market landscape.**\n\nOpensea's daily volume for July remains above 30 million. Analyzing the 30 days, we found that June 16th and 17th were the lowest volume days. Since then, there has been a steady increase in volume and market participation.\n\nHowever, compared to last month, the volume is down nearly 35%. Why? Probably because of uncertainty in the market. But on the other hand, the market cap is in the green and is beginning to increase. We see around a 7% increase from the previous month.\n\n![source : NFTGo](https://images.mirror-media.xyz/publication-images/ydlmVucus634O-K-SLZt-.png?height=485&width=1234)\n\nIf we look back at the volume from a 12-month view, we can see that we are far off from all-time highs and even median volumes. \n\nWe can also see that July tends to be a quiet month for NFTs with decent volume returning from August. It means we will have plenty of profit-taking opportunities in the coming month!\n\nHowever, in contrast to last year, we are currently in a bear market and we’ll have to see how the coming months play out.\n\n![source: dune](https://images.mirror-media.xyz/publication-images/vHYbJZowUJlFNTsRpL8r2.png?height=545&width=913)\n\n## Volume is Down but Activity Isn’t\n\nIf we take a look at the general NFT activity, we can see that the buyers vs sellers ratio is not as drastic as the volume and market cap numbers.  It suggests NFT traders and investors are actively committed regardless of ETH vs USD price movement. This is positive sign for the NFT space.\n\n![source : dune](https://images.mirror-media.xyz/publication-images/BwMGTu1wUlZbE56F0ayyG.png?height=392&width=911)\n\nDaily buyers and sellers remain between 20-40k. This suggests that many of the users of opensea are traders flipping between collections. With August around the corner members should use that month to exist collections that they no longer want to hold.\n\n![source: dune](https://images.mirror-media.xyz/publication-images/BvnI_Zw6ugcL7iU_q1bPU.png?height=388&width=910)\n\nIf we zoom out to a weekly, demand is outstripping supply. This is very good for the NFT space - as long as you are buying into the right projects.\n\n## NFT Collections Check\n\nWhen we look at the top collections, most of them are in green in the last 7 days. There was hype surrounding Otherdeed as load tests took place during the 1st half of July. Otherdeed NFT holders were invited to participate in testing the Otherside metaverse and were asked to perform simple actions like run, jump, text, and voice chat. The excitement was reflected in increased trading activity. \n\nWhile the ETH price remains low, investors are picking CryptoPunks. The dollar value against Ethereum means blue-chip NFT projects are cheap compared to their relative ETH value a few months back.\n\n![](https://images.mirror-media.xyz/publication-images/2dBg1TFplxX0JDfxFEq7m.png?height=849&width=1218)\n\n## Top Trending Collections\n\n![source: nft stats](https://images.mirror-media.xyz/publication-images/XHed6xhpHx57Av4qavOGP.png?height=411&width=1211)\n\nWe mentioned The Possessed NFT last week. Much hype surrounded the project. The PFP can switch between states of being Blessed and Possessed. With a floor price of 0.54 ETH last week it has dropped significantly. At the time of writing, it has a current floor price is 0.21 ETH.\n\n## Tip of the Week\n\nWe will kick start a series of NFT tips - our first tip is staying safe with NFT mints.\n\nWe have seen a sudden trend of collection sizes reducing from 10k to 3k or 5k collections. \n\nIn line with this, free mints has become a trend where entry into a collection is just the ETH gas fee away. The collection owners aim to recoup their artist efforts by setting a royalty fee every time the NFT is sold - this allows them to have re-occurring revenue on every sale whilst building a community in the process.\n\nWith the low barrier of entry, scams are rife, and below are our tips to stay safe:\n\n### Tip 1: always use a burner wallet. \n\nThis has been said many times, but use a wallet with minimal ETH and no valuable assets in it. One wrong signature and your 50k ape disappears. On a related note, don't keep your valuable NFTs in a hot wallet, rather move them to a hardware wallet.\n\nA burner wallet is separate (temporary) from your main wallet (Vault), which is mostly used for minting NFTs or interacting with a dApp that is not audited.\n\nYou can create a burner wallet just like any other wallet but for a specific purpose such as minting NFTs or interacting with an unaudited project. \n\nA burner wallet could be a hot or cold wallet where you keep only a minimal amount to pay the gas fees for minting or interacting with any smart contract. \n\nPlenty of new NFT projects are being launched every day. Most of these projects do not have code audits of their minting process. In such cases, any hacker can write a code giving them access to your crypto wallet while minting an NFT. It can further lead to draining your current NFTs and crypto assets. By using a burner wallet, you are minimizing such risks.\n\n### Tip 2: Mint from a contract whenever possible. \n\nThere have been many scams where a project advertises a free mint on their site, but changes the mint button to a signature request for you to approve transfers to your valuable NFTs. This is how your NFTs get stolen quickly. (*Watch out for our guide for minting directly from a contract address)*\n\n### Tip 3: If the contract is unverified on etherscan, run for the hills.\n\nFor a free NFT mint, this almost guarantees something malicious is going on. Unless you know how to read through decompiled bytecode, we highly recommend not to mint. \n\nWell, that is a wrap for the Weekly NFT Report! See you next Friday.\n\n** \n  \n **", "timestamp": 1657887131, "digest": "qWM5iRirHOMJeleE_RP3d5F2l6jGqkxK_emFbumBjOg", "contributor": "0x184254ca63135943e5b33a06c65f01E3c91C0E9F"}
{"id": "JcDMme3b1fbRSx_5PfDBLUr9p3PZ-y97weZV9EVkToU", "title": "HOT AND HYPED: INSIDE THE STRANGE LAUNCH OF THE NOTHING PHONE 1\n", "body": "hereThere was a lot riding on Nothing’s Phone 1 launch this week. For months, the company’s CEO Carl Pei, who rose to prominence as one of the co-founders of OnePlus, has been making big promises about Nothing’s first smartphone. “Consumer tech, how did we let it get so boring?” the CEO asked rhetorically [during a livestream back in March](https://www.youtube.com/watch?v=8Cq7dnESV7Y). “We’ve all experienced the gap between the future we were promised and the one we’re living in now.”\n\nThe implication, then, is that Nothing will be the one to close that gap. Indeed, in its invites for this week’s launch event in London, the company characterized the event as “an invitation to unlearn everything the industry has taught us.” In a [recent interview](https://www.engadget.com/interview-with-nothing-ceo-carl-pei-thinks-everyone-elses-smartphones-are-boring-090011028.html), Pei said Nothing is aiming “to bring people back in time to when they felt more optimistic about gadgets.” No pressure then.\n\n*“AN INVITATION TO UNLEARN EVERYTHING THE INDUSTRY HAS TAUGHT US”*\n\nIt’s a level of promise that I’m not sure any device could live up to, but I’ll be damned if I was going to be the one who missed out if Nothing succeeded. Sure, prior to the event, there were already signs that we were about to see something less like “a consumer tech revolution” and more like “a smartphone”— a midrange one, in fact, that wouldn’t even be sold in the US. But maybe the in-person event would shed more light on Nothing’s revolution.\n\nThat’s what led me, on one of the hottest days of the year, down a series of nondescript alleyways in London trying to find the inauspicious location where Nothing had decided to hold the in-person portion of Tuesday’s launch. When you’re promised a revolution, your thoughts might turn to huge stadiums, the Brandenburg Gate, or perhaps a Parisian café. Nothing’s revolution would take place at its London design studio in Camden.\n\n*Posters advertising Nothing’s event, as seen in south London*\n\nPhotography by Jon Porter / The Verge\n\nIf Pei’s good at one thing, it’s taking every opportunity to create “edgy” marketing. Ahead of the launch, Nothing plastered various European capitals with street posters that sat alongside advertisements for local gigs and festivals. The implication? This is more of a cultural event than a simple phone launch. I even spotted a few in my suburb of south London, while across Twitter, people posted photos of posters appearing in [Paris](https://twitter.com/HaskaH_2012/status/1541743247873171458) and [Berlin](https://twitter.com/commissarius/status/1541455530660692032) (all helpfully retweeted by Nothing’s social media team).\n\nAs I approach the event, I bump into another attendee, who it turns out is one of Nothing’s several thousand community investors, who between them have plowed millions of dollars into the company, [according to funding platform CrowdCube](https://www.crowdcube.com/cubex/nothing-4537). That’s in addition to more traditional institutional investors like Alphabet’s GV and other notable names in tech, including “father of the iPod” Tony Fadell, Reddit CEO Steve Huffman, and YouTuber (sometimes) Casey Neistat.", "timestamp": 1657887310, "digest": "680Srh9LtNmfcTfZ0Noijy40q7vj4qjt-w2HY5vIq0k", "contributor": "0x0B370be3b0aD83cB5AC159e3Fee5Ea7209B6cD83"}
{"id": "cmouJZXgxFTbo41nOiwH0MFjYcJ0t6YBwbe_7kO2HOY", "title": "写给深陷恐惧的我，以及你", "body": "全文约4900字，阅读大约需时13分钟\n\n* 开始的开始\n* 什么是恐惧？我们恐惧什么？\n* 不在恐惧中灭亡，就在恐惧中爆发？\n* 我看、我看、我看恐惧\n* 题外话\n\n## 开始的开始\n\n### 去年10月份，偶然在一次活动上见到了OneDegree的联合创始人Alvin Kwock。那时候他坐在我右边，而在场的还有一些港大可爱的同学们。其实单凭回忆有点忘了他具体长什么样了哈哈，不过印象很深的是，戴着方形黑框眼镜的他，眉眼间透露着一种令人亲切的刚毅和睿智。在Alvin请求下，我们挨个给Alvin做了个简单的自我介绍。接着，他突然抛出一个让我有些措手不及的提问，他很认真地问了这样一个问题：“大家講下，你地最驚d咩？”，意思就是让我们一个个来讲讲我们害怕的一些东西，可以是任何情况下的任何事物。万万没想到了，在场子还没暖起来的时候就要回答这个有点点深层的问题。当时觉得怪有意思的，但也没有细想。后来才知道，Alvin和团队开会的时候，他也试过以这种方式去认知彼此。\n\n### 现在回头想想，忽然发现这个问题还挺有得考究的。我之所以觉得那个问题在当时有点突兀，某种程度上，或多或少也是因为我将恐惧——这个像影子一样每天尾随我、与我共存的东西，佯装视而不见、习惯性忽略了吧。还有另一个原因就是，谈论恐惧多多少少带有一点神秘的私人属性，就像谷爱凌在纽约时报的采访中提到的，\"I don't talk about it (my fear) with people who I'm not superclose to”（我不会和我不是非常亲密的人讨论恐惧这件事）。的确，自揭恐惧的时候，就像是脱下自我保护的面具和衣甲，向大众做一个真实自我的袒露。无怪乎Alvin会和他的团队们聊这个话题。作为一个创始人和CEO，毋庸置疑的是，对团队伙伴们的担忧和恐惧了然于胸关乎成败。一个对团队成员没有深层了解的创始人又如何能够为团队提供更好的福利安全网？又如何能够奠定和巩固团队的信任基石呢？像Alvin这样已经在大风险的湍流中激流勇进的人，洞悉自我的恐惧、团队的恐惧、竞争对手的恐惧方能知己知彼百战不殆；而对于尚未身处巨大风浪和漩涡的我而言，或者我们而言，为什么要花时间来谈论恐惧、了解恐惧呢？\n\n### 当然，补充个前提，这里所提到的恐惧，准确而言是心理上的恐惧；生理上的恐惧，比如怕蛇等等之类生理本能式的恐惧反应，我这就暂且不谈了。\n\n### 回答上一个问题之前，可以先讲讲另一个问题。追根溯源，我对恐惧这个话题感兴趣是什么时候开始的呢？具体我也忘记了时间，但是过去这一年多来，我确确实实地感受到，我内心蛰伏的恐惧会突然在关键时刻跑出来作祟。那种很难一下子消退的恐惧就像是物理学上的向心力一样，牵引着我不停地围绕着一个无意义的中心重复着心理内耗的活动，而迟迟无法做出一个良好的决策和行动。这种状态很容易被日常的忙碌所巧妙掩盖，但是，一旦情况有所突变，新的机会或者危机涌现之际，这种状态就露出马脚来，我也因而陷入了一种无谓的挣扎之中。这种无端的消耗内心意志力的恐惧，可能不单单是我，读到这里的你，是否也曾经感同深受呢？著名的普鲁斯特问卷（the Proust Questionnaire）里就有一道这样的问题：What is your greatest fear？（你最惧怕的是什么？）这个问卷的意义旨在深入理解一个人的价值观和自我认知。可见，谈论恐惧是认知自我的其中一步，而认知自我是一个需要长期复盘的课题。所以，这大概是谈论恐惧的原因和意义吧。而除却死亡之外，大大小小的恐惧、担忧、焦虑等如影随形。事实上，我们到底在害怕些什么呢？\n\n![Photo by Sasha Freemind on Unsplash](https://images.mirror-media.xyz/publication-images/lmR7_5SPlqeWqXfjDrI-3.jpg?height=1910&width=2865)\n\n## 什么是恐惧？我们恐惧什么？\n\n### 我们所害怕的究竟是什么呢？是过去和未来。比如此刻，我安坐于此输出文字的当下，四周波澜不惊，没有任何需要恐惧或顾虑的东西，没有任何会直接威胁到我的事物。然而，写着写着，可能脑子会不听使唤，自顾自开起小差，“内心深处可能正在挂虑着未来可能发生的事，或者担心过去发生的某件事会卷土重来”（《重新认识你自己》）。正因为我难以完完全全践行活在当下，所以自然而然被过去的经验和记忆所牵扯，为未来的不确定性而忧心忡忡。克里希那穆提(Jiddu Krishnamurti)在《重新认识你自己》(《Freedom from the Known》)中发问：\n\n> 我们现在必须要问自己，人心可不可能完全地、彻底地存活于当下？只有在这种心智状态下，恐惧才无从生起。若想深入了解这种状态，就必须先了解念头、记忆及时间的结构才行。这种了解不是出自理性或口头上的，而是发自内心和肺腑的了悟，然后你才能从恐惧中解脱出来，那时我们的心才能自由无惧地思想。\n\n### 而再深入一层去思考，我们的恐惧是由念头或者说我们对于一个事实的看法而衍生的。很简单举个例子，小L同学明天要向潜在客户推销研发的新产品，他一想到这件事，就七上八下坐立不安，开始不由自主地害怕被拒绝，被别人冷眼相待，甚至被恶意嘲讽。他害怕的不是向别人推销产品这件事本身，而是害怕自己强行脑补的N种坏结果，是他对这件事背后延伸的负面看法和想象。正如著名的斯多葛学派作家塞内卡(Seneca)所言：“We suffer more often in imagination than in reality\"(折磨我们的往往是想象，而不是真实)。\n\n### 克里希那穆提也说到：\n\n> 因此，该为恐惧负责的就是念头，道理就是这么简单，你不妨亲自观察一下。当你正在专心应付某种危机时，你并没有恐惧，等到念头一起，恐惧才由心生。\n\n### 回归我自身。比如说我现在作为一个半路出家的不定期更新的内容创作者，若是放在之前，可能也会有很多不必要的犹豫和顾虑吧。比方说，在日常一地鸡毛的琐碎中，我会害怕自己慢慢丧失足够的敏锐观察力和灵动的思考力，害怕写着写着可能会有一段时间脑回路堵塞、灵感枯涩，写不出什么有新意的内容。还有就是，现在其实已经慢慢脱离那种需要经常性写文、有持续性内容输入的环境，写文质量可能暗地里已呈螺旋式下跌，可能会害怕写出来达不到自己的期许而失望。又或者说，内容难以得到共鸣和回响，只是一个人的狂欢那也没有意思。\n\n### 与此同时，我越来越感受到不同的背景可以导致的视角的巨大差异，而这种巨大差异让我有一阵子产生了一种混乱，到底哪些是预先需要知道的“常识”？不同的背景导致我们站在不同的维度看待事物，横看成岭侧成峰。在我眼中可能像新大陆一样存在的所谓见闻，可能在另一个人眼中早已是那个环境和背景下常识一样的存在。反之亦然。这种对于自我观点输出得到的反馈的高度不确定性和怀疑，让我曾经在某段时间里战战兢兢。\n\n### 以上反面教材，欢迎大家前来吐槽。很明显，这真实演绎了什么是庸人自扰作茧自缚了哈哈哈。\n\n### 诚然，很多恐惧来源于对自我潜在的威胁，而趋利避害是人的本性，懂得防患于未然也是好事。但是，更多的时候，这些恐惧是多余的想象的结果，这种过度的内心戏码只会搅乱了专注生产的当下。让我们看看克里希那穆提是怎么说的吧：\n\n> 思想在生活的某些层面确实是必要的，然而它一旦变成一种瞻前顾后的心理反射以后，就会造成恐惧和快感，心智便因此而迟钝下来，于是怠惰就难免了。\n\n![Photo by Leslie Wong on Unsplash](https://images.mirror-media.xyz/publication-images/9wwVCNvvgGOBxel34b87R.jpg?height=4000&width=6000)\n\n## 不在恐惧中灭亡，就在恐惧中爆发？\n\n> 我们唯一值得恐惧的就是恐惧本身——这是一种难以名状、盲目衝动、毫无缘由的恐惧，可以使人们转退为进所需的努力全都丧失效力。—— 富兰克林罗斯福(Franklin Roosevelt)\n\n### 真的如此吗？的确，上文所讲的各种恐惧就是值得恐惧的恐惧。\n\n### 但有另外一种恐惧。\n\n### 这是另一个故事了。一次偶然的聚会上，对面刚好坐了一家健康营养品公司的创始人。餐厅里，刻意营造的昏黄灯光轻微摇曳，把整个场子渲染出一种朦胧的不真实感。我对面的这位创始人缓缓道来他曾经所经历的恐惧。“你们知道吗？我那时真的好害怕，整晚整晚地睡不着觉，觉得好像一切都失去了意义”。说到这，他双眼中的某种东西似乎和餐厅内扑闪的灯光对上了频率一样，也开始迷离扑朔了起来。其他桌的人们兀自觥筹交错，我们这里却好像突然掉入了一个异时空里、一个生死无常的宏大命题里。“我害怕我的太太就这么匆匆、这么突然地离开我，那个时候，我才发现自己曾经心心念念的一些东西都不重要，我当时唯一祈求的就是，让她活下去”。那种对命运不由分说、分分钟可能强夺自己所珍爱东西的恐惧，逼使他重新审视自己的人生。所幸他的太太后来手术成功。但那种切肤的恐惧感从此给他埋下了深深的危机意识。你能感受到吗？他以为他的生活被自己安排得井井有条，直到突如其来的无常撞碎了他的想法。他开始恐慌、焦急、害怕，害怕在下一次的无常来临之前，他无法真真正正地过一次自我掌舵的人生。于是，你可以想象到的励志故事来了，他毅然裸辞、创业，第一次真正意义上做了自己渴求的事。当然，他是幸运的，也是被命运所祝福的。想说的是，这种恐惧本质上和前面所讲的无异，这是对未来的恐惧，是自我看法和想象的衍生物。然而，这种恐惧的感觉就像是把我们关在一个全密闭的镜子屋，没有缝隙可以让我们钻进去以逃避镜中可能有些狼狈的自己。置身于其中的我们被无数的自我镜像彻头彻尾地包围，我们被逼着360度无死角地面对自己、看清自己，然后，我们被倒逼着改变。\n\n### 《爱，死亡，机器人》(Love, Death & Robots) 第一季第一集《桑尼的优势》，主角桑尼对那个图谋不轨的坏女人说：\n\n> You don’t come into this world with hate, but fear.\n>\n> That fear is my edge.\n>\n> That fear of death.\n\n### 桑尼对死亡的恐惧就是她的优势，其他人只是把脑意识与魔兽连接上场格斗比赛，而桑尼则是与魔兽连为一体。别人输了，就只是输了一局游戏而已；而她输了，就意味着死亡。对死亡的恐惧倒逼她爆发，恐惧给了她破釜沉舟的力量，恐惧是她战无不胜的法宝。\n\n![Photo by Leslie Wong on Unsplash](https://images.mirror-media.xyz/publication-images/8O5rUWs_fl9rsNQPeOgZP.jpg?height=3669&width=2446)\n\n## 我看、我看、我看恐惧\n\n### 我们在面对恐惧的时候，消耗了很多能量。\n\n### 最经常见到的是这三种模式。勇者直面恐惧，他不允许自己被别人称为懦夫，于是，他大声对自己身上的恐惧放话：“我要了解你，控制你，除掉你。”勇气小一点的，姑且叫小勇士吧，不希望被恐惧绑架的，但又常常有所顾虑，他们不停地和恐惧展开拉锯战，有的时候恐惧占了上风，有的时候小勇士占了上风。勇气再小一点的，直接闭上眼假装看不见自己身上这个庞然大物般的恐惧。\n\n### 除了这三种，有没有一种可能，我们能够以第三者的角度去平静地观察我们的恐惧并与之和平共存？“既不加以判断，也不以你所积累的知识来干预它”？\n\n### 克里希那穆提如是说：\n\n> 你通常能平静地观赏一片云、一棵树或河水的流动，只因为它们对你无关紧要。然而观察自己就不是那么容易了，因为自我的要求过于具体，反应又太过于迅速，因此，当你赤裸裸地面对恐惧、绝望、孤独、嫉妒或其他丑陋的心态时，你能不能心平气和地透视它？\n\n### 如果我们能够以这种置身事外的状态观察恐惧，而不是不停地设法克制或逃避恐惧，就不会形成自我与恐惧之间无止境的斗争。而一生的精力也就不会在这种无止境的斗争中耗尽了。\n\n### 事实上，我们和恐惧并非二元对立的关系，我们既是恐惧的观察者，同时也是产生恐惧经验的整体。\n\n> 你会发现原来观察者本身就是恐惧，你一旦了悟这个事实以后，就不会再枉费精力去斩除恐惧了，于是观察者与被观察者之间的时空距离，顿时消失于无形。你一旦认清自己就是恐惧，和恐惧无二分别，自然会停止所有的斗争，然后恐惧就会完全止息下来。\n\n### 我即恐惧，恐惧即我。于是乎，再不需要刻意地用蛮力去抵御恐惧的降临。\n\n### 不单单恐惧是如此，万千情绪也是同样道理。\n\n### “不用牵挂过去，不必担心未来。踏实于现在，就与过去未来同在“，这句话来自圣严法师，和当晚那位创始人告诉我的意思差不多。他一边向我们解释，右手一边不由自主地放到没有盖的玻璃杯上，不松不紧地、由上而下把杯口握住。摇曳的灯光在他握着杯子的手上流淌，然后顺着他手指间的缝隙稳稳当当地流到杯子里面去，在杯中缓缓摇曳的水中流淌、游荡，熠熠闪光。在他握住杯子的那个时候、在我观望那轻微闪动的杯中之水的那个时候，我突然明白了那种踏踏实实的、活在当下的真实感和力量。\n\n![Photo by Prchi Palwe on Unsplash](https://images.mirror-media.xyz/publication-images/7vbAWtqZDigwVXervIkca.jpg?height=6000&width=4000)\n\n## 题外话\n\n### 我们常常羞于提及自己的恐惧，觉得自己的恐惧不值一提，是“低级的恐惧”；更甚者，对他人所表达的恐惧嗤之以鼻。我们绝口不提恐惧，觉得说了便是软弱的表现；但事实上，说出恐惧不也需要勇气吗？\n\n### 几年前看到法国作家卡缪(Albert Camus)在《鼠疫》(《La Peste》)里写的一段话，分享一下：\n\n> 倘若我们当中哪一位偶尔想与人交交心或谈谈自己的感受，对方无论怎样回应，十有八九都会使他不快，因为他发现与他对话的人在顾左右而言他。他自己表达的，确实是他在日复一日的思虑和苦痛中凝结起来的东西，他想传达给对方的，也是长期经受等待和苦恋煎熬的景象。对方却相反，认为他那些感情都是俗套，他的痛苦俯仰皆是，他的惆怅人皆有之。\n\n### 在我眼中，恐惧不因地位、背景、种族等等而有高级和低级之分。它值得被听见、被看见、被理解、被化解。\n\n![Photo by Christopher Campbell on Unsplash](https://images.mirror-media.xyz/publication-images/JEcTBR6P5m__QqdNUiZrK.jpg?height=4657&width=3105)\n\nCover photo by Raimond Klavins on Unsplash", "timestamp": 1657887727, "digest": "PkK5neonmQXeq5vxyGq9NuiX8c9HutyJXV8NNELqRUI", "contributor": "0x72D993FE281118fE8F9509A65800014025546616"}
{"id": "DeXUTsKjnlMFRWVQXK1ENSDqfy-V7TvPly30-fRhkNg", "title": "收获的超凡物品", "body": "“双天赋？这又是个什么玩意儿？” \n  \n 　　苏伦缺少对这个世界的基本认知，所以哪怕看到了多出来的这个天赋，也不知道到底有什么用。 \n  \n 　　而且，他发现自己的精神力数值也从“26”变成了“18”。 \n  \n 　　精神力少了8点，之前那种耳旁有呓语的感觉也彻底消失了。 \n  \n 　　苏伦心中推测道：“这座祭坛的原理是祭献物品，等价交换获得某种超凡天赋。之前是以眼换眼。现在精神力变少了，难道是...原主的残缺在体内灵魂被彻底祭献了，然后获得了一个新天赋？” \n  \n 　　他没在这个问题上多纠结，反正也无从证实。 \n  \n 　　但这时候，苏伦脑子里又冒出了一个奇葩的念头：要是自己不是穿越者，正常人该拿什么祭献获得这天赋，在祭坛上自杀，然后祭献自己的灵魂？ \n  \n 　　“这【天赋S-004-死亡收割者】到底有什么用？” \n  \n 　　终究不是玩游戏，现实没有技能使用说明。 \n  \n 　　苏伦看了片刻，还是完全没有头绪，身体也没有任何增幅变化。 \n  \n 　　他想了想，没再纠结，而是又继续测试起自己眼睛获得的能力来。 \n  \n 　　转眼，他把目光转向了几尊石雕上，上面就冒出一串文字。 \n  \n 　　【残破的石雕】 \n  \n 　　详解：失去了超凡力量的石雕，没有什么观察意义； \n  \n 　　这一次，苏伦大概知道这天赋有什么用了，“这不就是游戏里的‘鉴定术’嘛...” \n  \n 　　这天赋要说对战斗力的增幅话...不说增幅不大吧，可以说是完全没用。 \n  \n 　　这基本可以定位是一个辅助功能。 \n  \n 　　至少，真打起来，和之前光头那【钢化骨骼】完全不在同一水平上。 \n  \n 　　“大概是我没弄懂这‘全知之瞳’的用处，或许还有未开发出来的能力。这么复杂的觉醒仪式，应该不是这么简单...” \n  \n 　　苏伦看着，倒也没多少失望。 \n  \n 　　至少，目力增强了，对他的枪法来说，似乎准头能更强了。 \n  \n 　　而这时候，他突然想到了什么，走下祭坛，拿出了之前佩斯托娅送给他的符文人偶，鉴定了一下。 \n  \n 　　这一看，发现这才是个好宝贝。 \n  \n 　　【诅咒物：符文诡偶】 \n  \n 　　品质：黄金", "timestamp": 1657887847, "digest": "jEebS6L1tsG16tOP-J9Hg490iEIAWK6DY5RvM_zdiWs", "contributor": "0x5A4a8E92803CC2d749b40198bA053a7b22D19D65"}
{"id": "eyWklHg1T1jPTNJOnE51YCXlQ2PxysUKRx8-zxunuuU", "title": "7月15日要闻", "body": "7月15日要闻\n恐慌指数15（极度恐慌）\n当前币安多空比 0.93\n今日币圈要闻：\n1\\.BNB Chain周四宣布推出生态系统的dApp中心DappBay，内置反诈骗工具以保护用户。DappBay的红色警报功能将允许用户通过输入合约地址并查看逻辑缺陷和欺诈风险的标志来评估项目风险。开发人员将能够在平台上列出他们自己的dApp，并通过最快的用户增长和最佳性能代币等指标来跟踪项目。它还将在启动前分析和编制有前途的即将开展的项目的清单。（这个项目还是刚需，就不知道运行的如何）\n2\\.赵长鹏发布五周年公开信：用户量超过1.2亿，希望成为Web3的门户（加油，看好币安）\n3\\.Voyager Digital宣布申请破产后，纽约 Loeb & Loeb 律师事务所合伙人 Daniel Besikof 表示，Voyager Digital客户有可能成为无担保债权的债权人，因为用户协议是考虑如何持有资产的方式，以及公司实际持有或使用这些资产的方式是确定这些资产在破产中可能如何处理的关键点，但根据 Voyager 用户协议中，他们可以将客户的存款借给了少数借款人，其中最大的是三箭资本，而大多数客户可能没有意识到他们签署的协议有比简单投资加密货币资产更高的风险，因为 Voyager  可以将客户资产被借给可能没有进行承保的人。（没有人去仔细看协议的）\n4\\.巴西最大的私人银行 Itaú Unibanco 计划推出资产代币化平台，将传统金融产品转化为代币，并为其客户提供加密托管服务。（发展中国家对于加密货币的接受度反而更容易些）\n[5.DeversiFi宣布更名为rhino.fi](http://5.xn--DeversiFirhino-8w7v363eip3ay6ivy6b.fi) 并转型为多链DeFi的Layer2网关（本人最讨厌就是这些时不时换个名字的项目方）\n6\\.法院文件显示 Celsius Network 资产负债表漏洞约为 12 亿美元（还差12亿啊）　\n7\\.瑞穗分析师：Coinbase 全球市场份额跌至仅 2.9%，7 月份的平均交易额约为 12 亿美元，排名第 14 位，币安仍然是全球交易量最大的交易所，7 月份的平均交易额接近 110 亿美元（持仓BNB还是稳稳地）\n8\\.NFT市场OpenSea裁员约20%（Opensea都开始裁员了，还是那句话，如果寒冬很快过去，为啥要裁员？一拉盘就说牛回的韭菜们细品）\n9\\.受Celsius破产影响，比特币矿机价格暴跌至近 2 年低点（还未到论斤卖的时候）\n10\\.Circle发布了第一份月度报告，详细说明了其美元支持的稳定币的储备，显示6月底有557亿美元的现金和三个月的美国国库券。报告说截至6月30日有555.7亿美元的USDC流通。（差不多1：1，USDC还算是比较稳定的）\n11\\.Celsius通过抵押4.03亿美元资产从FTX获得约1亿贷款　（这对于12亿的缺口还是远远不够啊，而且话说4亿资产是啥呢？）\n12\\.瓶身印有BAYC等NFT图像的香槟以250万美元成交（这就属于炒作了）\n13\\.巴哈马总理：将转向加密货币进行创新以弥补GDP损失（又是发展中国家）\n14\\.Ripple报告：85%的全球金融业支付领导者认为他们的国家在4年内将发起数字货币（看看中国啥时候开放）\n　\n全球其他要闻：\n1\\.美国银行策略师在报告中表示，美国将于2022年下半年开始温和衰退，将年末标普500指数目标点位下调20%至3600点，并下调EPS增长预期。策略师们指出，经济衰退期间该指数的平均跌幅为31%，标普500指数年底前可能出现3000-3200点的水平。（可以参考）\n2\\.壳牌首席执行官本·范伯登周四在能源会议上表示，由于对俄罗斯天然气供应的担忧，欧洲今年冬天可能需要对能源供应实行配给。\n3\\.美国驻乌克兰大使馆网站发布消息称，出于安全考虑，呼吁美国公民离开乌克兰。（想想美国在阿富汗）\n4\\.朝鲜外务省称，乌克兰无权谴责朝鲜承认顿涅茨克人民共和国和卢甘斯克人民共和国的决定。（朝鲜也是刚）\n5\\.拜登周五前往沙特，在那里他将寻求促进石油流通，并试图重新与这个关键的阿拉伯国家建立关系。拜登曾在不到两年前承诺让世界最大石油出口国沙特阿拉伯成为国际舞台上的“贱民”，这次访问是一种微妙的平衡行为。（啪啪打脸）\n6\\.在俄罗斯削减对欧洲的天然气供应后，由于面临现金短缺，德国能源巨头Uniper开始使用其为过冬而储存的天然气，这加大了德国政府加快达成救助协议的压力。（搞不好也要破产，那就是大地震了）", "timestamp": 1657887333, "digest": "Ol4WGlExUs5yNCVsl1r3ZTOR0EXyNrVf1A3jlCM19tU", "contributor": "0x4b7fbdA253a17ce4499A8180A37221727755d14F"}
{"id": "gWXktJ_vmZYP30qpCZWfUb4tFLApo1seAQoJvkfRRiE", "title": "长恨歌", "body": "汉皇重色思倾国，御宇多年求不得。 \n 杨家有女初长成，养在深闺人未识。 \n 天生丽质难自弃，一朝选在君王侧。 \n 回眸一笑百媚生，六宫粉黛无颜色。 \n 春寒赐浴华清池，温泉水滑洗凝脂。 \n 侍儿扶起娇无力，始是新承恩泽时。 \n 云鬓花颜金步摇，芙蓉帐暖度春宵。 \n 春宵苦短日高起，从此君王不早朝。 \n 承欢侍宴无闲暇，春从春游夜专夜。 \n 后宫佳丽三千人，三千宠爱在一身。 \n 金屋妆成娇侍夜，玉楼宴罢醉和春。 \n 姊妹弟兄皆列土，可怜光采生门户。 \n 遂令天下父母心，不重生男重生女。 \n 骊宫高处入青云，仙乐风飘处处闻。 \n 缓歌慢舞凝丝竹，尽日君王看不足。 \n 渔阳鼙鼓动地来，惊破霓裳羽衣曲。 \n 九重城阙烟尘生，千乘万骑西南行。 \n 翠华摇摇行复止，西出都门百余里。 \n 六军不发无奈何，宛转蛾眉马前死。 \n 花钿委地无人收，翠翅金雀玉搔头。 \n 君王掩面救不得，回看血泪相和流。 \n 黄埃散漫风萧索，云栈萦纡登剑阁。 \n 峨嵋山下少人行，旌旗无光日色薄。 \n 蜀江水碧蜀山青，圣主朝朝暮暮情。 \n 行宫见月伤心色，夜雨闻铃肠断声。 \n 天旋地转回龙驭，到此踌躇不能去。 \n 马嵬坡下泥土中，不见玉颜空死处。 \n 君臣相顾尽沾衣，东望都门信马归。 \n 归来池苑皆依旧，太液芙蓉未央柳。 \n 芙蓉如面柳如眉，对此如何不泪垂。 \n 春风桃李花开夜，秋雨梧桐叶落时。 \n 西宫南苑多秋草，落叶满阶红不扫。 \n 梨园弟子白发新，椒房阿监青娥老。 \n 夕殿萤飞思悄然，孤灯挑尽未成眠。 \n 迟迟钟鼓初长夜，耿耿星河欲曙天。 \n 鸳鸯瓦冷霜华重，翡翠衾寒谁与共。 \n 悠悠生死别经年，魂魄不曾来入梦。 \n 临邛道士鸿都客，能以精诚致魂魄。 \n 为感君王辗转思，遂教方士殷勤觅。 \n 排空驭气奔如电，升天入地求之遍。 \n 上穷碧落下黄泉，两处茫茫皆不见。 \n 忽闻海上有仙山，山在虚无缥缈间。 \n 楼阁玲珑五云起，其中绰约多仙子。 \n 中有一人字太真，雪肤花貌参差是。 \n 金阙西厢叩玉扃，转教小玉报双成。 \n 闻道汉家天子使，九华帐里梦魂惊。 \n 揽衣推枕起徘徊，珠箔银屏迤逦开。 \n 云髻半偏新睡觉，花冠不整下堂来。 \n 风吹仙袂飘飖举，犹似霓裳羽衣舞。 \n 玉容寂寞泪阑干，梨花一枝春带雨。 \n 含情凝睇谢君王，一别音容两渺茫。 \n 昭阳殿里恩爱绝，蓬莱宫中日月长。 \n 回头下望人寰处，不见长安见尘雾。 \n 惟将旧物表深情，钿合金钗寄将去。 \n 钗留一股合一扇，钗擘黄金合分钿。 \n 但教心似金钿坚，天上人间会相见。 \n 临别殷勤重寄词，词中有誓两心知。 \n 七月七日长生殿，夜半无人私语时。 \n 在天愿作比翼鸟，在地愿为连理枝。 \n 天长地久有时尽，此恨绵绵无绝期。", "timestamp": 1657887883, "digest": "_7N8eMeC8Tnq6UoeHPK_aDKdZlR5_CuDuA3uODbSGmc", "contributor": "0x79e68338Ddf980939995ec5b30Ab53465E041fa1"}
{"id": "itQOW3TcMXj2oH1u0PsOpxjGrSywhipmzu82EGMlBqo", "title": "The opening system will explode, Li Yixi uneasy", "body": "\"Master, my time is at an end, farewell...\"\n\n\"What can teach you, I give you, I hope the master live happy.\" The sound of the system suddenly came to Li Yixi's mind.\n\nThe sudden change made Li Yixi hard to accept.\n\nWhat do you mean taught me? I haven't practiced yet?\n\nThis sudden sound, frighten Li Yixi roar.\n\n\"No, no.\"\n\n\"System, I need you...\"\n\nDressed in white, Li Yixi's face changed greatly, a face of panic.\n\n\"Boom!\"\n\nBut in Li yixi's desperation, boom, the system completely exploded.\n\n\"Fried, finished son of a calf.\"\n\nRemember the url [m.42zw.com](http://m.42zw.com)\n\n\"What to do?\n\n\"Now what?\"\n\n\"This place is extremely dangerous.\"", "timestamp": 1657887759, "digest": "iQxorf6MAPcXMX49h4HKcFrDn7glcjPHWYFPjyfvdBw", "contributor": "0x8e79926074DF52b7FbAA504D30A68a20241ACe54"}
{"id": "jT97mA9ZE4qLVQVqRhdk-HbBDvCXLKpKpDtpawKwxKY", "title": "币安注册没有中国怎么办", "body": "目前币安现在注册有点麻烦，注册地址没有中国了怎么办。很多人注册不成功，下面我教大家如何快速注册币安，并且能在国内正常使用。\n\n1\\.首先需要注册一个邮箱号 你才能去注册币安户 推荐大家使用海外邮箱outlook邮箱或者Gmail邮箱（现在国内的邮箱也可以注册的了像qq邮箱163邮箱都是可以使用的）！\n\n2\\.需要打开梯子🪜：注意要避开美国地区，选择台湾或者香港地区的节点。\n\n3\\.然后我们打开币安的注册链接：\n\n[https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW](https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW)\n\n![](https://images.mirror-media.xyz/publication-images/S5TUfS7AT2a5SAJQ2eKjj.png?height=1080&width=2606)\n\n![](https://images.mirror-media.xyz/publication-images/8XkZRo7wjTq8hrP3RWQ-P.png?height=668&width=874)\n\n![](https://images.mirror-media.xyz/publication-images/7X8rYjguqncqA7QaOlfC9.png?height=1242&width=1144)\n\n点击注册 会发送6位数验证码到你的邮箱，去邮箱查找填写在这里。\n\n![](https://images.mirror-media.xyz/publication-images/cPkbMrRqrayiMT9_FUMSs.png?height=840&width=1538)\n\n填写完之后进入到这个页面就是注册成功了。\n\n![](https://images.mirror-media.xyz/publication-images/2nHewCnL0VVAkEet0k__m.png?height=1146&width=2444)\n\n是以上就是咱们币安的注册教程了，非常简单，大家可以去操作一下～", "timestamp": 1657887451, "digest": "CtjQhBkdesU9Tl7VOD3b4YCkUjhL8cA-yBkthetbx64", "contributor": "0xeE0974e1f9C1826c4B9389b4f532c1de5bb9F41E"}
{"id": "K4jKt39w3iPHb68VIXJ7LpFgX3juAFiabtu2HB6RBeE", "title": "入门Web3文化的工具集", "body": "全球 Web3 社区中的每个人都很熟悉 MetaMask 小狐狸钱包，但其背后的创建想法却不为太多人所知。\n\n在产品文化的营销上，创始人 Dan Finlay 和 Aaron Davis 对社区建设采取了一种更加低调的方式。在创建 MetaMask 的六年里，他们没有接受很多采访，甚至从来没有一起接受采访。他们承认：“我们更愿意把时间集中在赋予社区力量上。我们不是这个项目的唯一支持者，整个社区都是。”\n\n他们是谁？背景是什么？他们如何相遇？MetaMask 的想法是如何产生的？\n\n本文记录了 Aaron 和 Dan 的独特故事。一段意想不到的旅程，引导他们创造出今天数百万人访问 Web3 的入口。\n\nAaron Davis和Dan Finlay \n\n### 两位\n\nDan 是英国文学专业的学生，而 Aaron 是日语兼汉语的学者。2013 年，Aaron 和 Dan 在苹果公司工作，在参与 VoxelJS 项目（一个翻版《我的世界》的开源项目）时认识的，该项目旨在创造帮助孩子们在浏览器中学习编程的环境。他们都有自己的职业规划，当时谁也无法预想到有一天他们会一起创造出 MetaMask。\n\nDan 出生在底特律，住在纽约一段时间，现在和他的妻子定居在加利福尼亚的太平洋海岸。虽然他不是一个热衷旅行的人，但他喜欢日本和土耳其。另一方面，环游世界的 Aaron 喜欢经常搬家，他像一个真正的冒险家，受好奇心驱使，他对文化的历史和社会根源有着深刻的理解。\n\n童年时期，Aaron 只想玩电子游戏，而 Dan 一开始想住在冰屋里，后来想做航天员。他们的梦想自然地萌发，Dan 放弃了冰屋和火箭飞船的想法，转而从事艺术、视频制作和即兴表演。\n\n长大后，Aaron 学习日语，希望成为一名同声传译。当被问及他的职业抱负时，Aaron 解释说：“要想成为专心做翻译，你必须把大脑中的一切都排除在外，我发现纯粹的思维方式非常能够启发灵感。”人们说软件工程就像学习另一种语言，两者都需要对细节的敏感性，逻辑构建的能力，以及对符号学的适应。在他们 20 岁出头的时候，他们就已经走在编程生涯的路上了。\n\n对 Dan 来说，编程始于 10 多年前一个搞笑应用的想法：一个放屁声合成器 Fartomin。“我不知道如何编程，所以我读了一本书来学习如何编程，”他回忆道。Aaron 仍然坚持着他童年的梦想，尝试开发电子游戏——“我没有任何指导，所以我试着从别人的作品中学习，阅读，然后修改。”\n\nDan 曾做过各种各样的工作，包括肖像画家、摄像师、博物馆讲解员、游戏厅主管、象棋教练和打印员。2013 年，Dan 在苹果公司遇到了 Aaron。他们都想从事点对点计算的工作。\n\n这种分享欲、建立社区和创建安全合作平台的意识是由社会不平等和关心他人权利所驱动的。Dan 痴迷于人权和社交。他的社会正义感是由他的家庭在底特律汽车工业崩溃和加州农场工人运动中的亲身经历形成的。“我讨厌我们在多年的商业基础上，故意将其影响外部化，利用一切可能的牟利手段的基础继续发展。” Aaron 不想依赖他不信任的人去做事情。他说：“我讨厌被剥夺代理的权利。”他们关于技术的雄心壮志和哲学思想正在融合，MetaMask 的想法正在慢慢变成现实。\n\n2014 年，第二大区块链诞生了，这让他们感到不安。“当我听说以太坊和关于它的想法时，我认为它们符合我想要打造模块化民主或更好的辩论系统的一些东西。我想用电脑来帮助人们筹集资金，发送小额支付等，”Dan 解释道。他们知道有一个由以太坊网络支持的网站会很酷，但登录将如何运行尚不清楚。基于网络的众筹还是一种新事物。Aaron 对以太坊上的众筹项目很感兴趣。他花了一段时间做一个复杂的账户管理器，就像浏览器中的浏览器，然后，Dan 参与进来。\n\n虽然有很多早期的面对面黑客会议，但他们也开发了一种跨时区工作的方式，在某种程度上代表了构建像以太坊这样去中心化技术的协作方式。他们一起缩小了 MetaMask 的最初发展定位。这使得它能够很好地开始在黑客松 上使用，并让开发人员使用它。\n\n### 2016 年，MetaMask 诞生\n\n为什么是一只狐狸标志？因为 Aaron 想要一个动物吉祥物，于是有了一个多边形狐狸的想法。“对我来说，狐狸让我想起了很多东西，迪士尼罗宾汉中的民间英雄、对传统的反抗、自我负责的聪明又孤独的生物、黑暗森林中的一次偶然相遇，以及解决安全合作问题或我们如何相互信任的问题。”当 Dan 看到这个想法时，他和当地的一个建模师一起把它做成 3D，然后把它做成交互式，但他们还需要一个名字。\n\nAaron 喜欢给东西起名，他花了很多时间思考起了 MetaMask 这个名字。MetaMask 的意思是“你的元身份”，或者“你用来管理你的许多身份的东西”。考虑到 Facebook 的重新定位（改名 Meta），MetaMask 这个名字显得相当有远见。\n\n对团队来说，这是一段忙碌而独特的旅程。回顾过去，留下很多难忘的回忆，包括在 2017 年 CryptoKitties 兴起的时候，MetaMask 团队熬夜想出一种缓解交易停滞的方法。2018 年第一次开始谈论将如何扩大产品规模，并让用户添加新的网络。2019 年，推出了用于创建 Dapp 和 Web3 网站的 Snaps 项目。2020 年是一个巨大的戏剧性的一年，骗子以新的钓鱼方式骗取 MetaMask 用户的密匙，但随后推出了 Swap 交易功能，给 MetaMask 带来了第一个实际收入，让 MetaMask 可以更有把握地招聘。\n\n2021 年是快速增长的一年，为 MetaMask 最雄心勃勃的计划奠定了基础。2022 年是构建 MetaMask 所需的系统和团队更全面地满足用户需求的一年。\n\nDan 和 Aaron 都认为应该建立新的信托基金。Dan 说：“今天，大多数人既不知道如何信任电脑，也不知道如何彼此信任。互联网粉碎了我们的团结感。我想让人们觉得，他们能够再次信任更多的东西，但要有正确的理由。”展望未来，**Aaron 确信，“Web3 中现在流行的大多数东西在 20 年或 30 年后都不会出现”，所以他只关注主题和形式，而不是细节。他对 Web3 的目标是构建一个“入门 Web3 文化的工具集”。**\n\n他们都深信，MetaMask 是一个通过 MetaMask Snaps 创建钱包未来功能的社区。如果他们要给开发者一个建议，Dan 说：“那就是找到一种为人类服务的方法。关注别人的问题，倾听别人的意见，了解事情是如何运作的，然后看看你是否能让别人的生活更轻松一些。在这个过程中，你可能会发现这让你和他人的事情变得更容易，这些也是有效的方式，但你必须从你所关心的，且为别人而服务的事情开始。”Aaron 希望开发者尝试更多东西，“要有信心，只要你投入时间，你就能想出怎么做成某事。”\n\n本文翻译自https://consensys.net/blog/metamask/how-did-metamask-come-to-life-the-origin-story-revealed/。如若转载请注明出处。", "timestamp": 1657887503, "digest": "kWrwaeon_29v3muoC1ZCcmlCcVoggxvvrx_k9ZM2aWg", "contributor": "0xca8B1B7d35F5859EcE9138b753b801996A75Fa48"}
{"id": "kps9mhZjctkdIi9WezaKlJXj7SasGbcMgW-HQHoQOY4", "title": "Azra games", "body": "EAキャピタルゲームの元ゼネラルマネージャーであり、後にEA自体に買収されたゲームスタートアップ「KlickNation」の共同創設者の1人が率いるweb3ゲームプロジェクト/会社について簡単に説明します。 \n  \n 彼の手がけた最後のゲームは Star Wars: Galaxy of Heroesでした。 このゲームは大成功を収め、リリース以来EAのトップモバイルゲームです。そして、チームは業界内の評判の良いゲーム企業で働いてきた人たちで構成されています。 \n  \n 興味が湧いてきましたか？ 彼らの投資家について話せば、あなたの興味は興奮に変わります！ \n\na16z,solbigbrain,NFX\n\n をはじめとする名だたるVCが投資をしています \n  \n 私が話しているプロジェクト/ゲーム会社は何ですか？ \n\nmarkoteroによって主導されている \n\n 「Azra games」です!! \n  \n  Azra gamesは、 「ブロックチェーン上で高品質でユニークなコレクタブル＆コンバットゲームを提供すること」をミッションとする ブロックチェーンゲーム会社です。 彼らが最初にローンチするゲームは「PROJECT ARCANAS」と名付けられています。 \n  \n これは、SFの世界を舞台にした、戦闘と収集品のRPGであり、軍団を指揮したり、戦闘に参加したり、戦闘機を作成したり、NFTを収集して交換したり、報酬を請求したりできます。 \n  \n 彼らはゲームに2つのモードを持たせたいと考えています。 ・ステーキングのような受動的な参加 ・積極的な参加→実際のゲームの部分 どのチェーンを使用するかはTBA \n  \n Genesis PFPコレクションは、Azra Games初のNFTです。これを保有することで、同社がリリースするすべてのゲームにおいて、永久的な効用と限定的な報酬へのアクセスが付与されます。このコレクションのキャラクター（Genesis Explorers）は、Project Arcanaの伝承においてユニークな役割を担います。 \n  \n Genesis Explorersは、ステークしてクラフトや他のプレイヤーへの販売に使用する報酬を獲得することができます。また、将来のゲームで限定的な報酬にアクセスすることもできます。PFPは全ゲームで継続される予定。 5000の供給はチームが計画しているもので、最終的なものではないとのこと。 \n  \n チームは、非常に異なった持続可能なゲーム経済のモデル化に長い時間を費やしてきました。ですから、トケノミクスとゲーム内経済が興味深いものになり、私はそれを楽しみにしています。  \n  \n 要するに、私は Azra games には非常に興奮しています。 彼らにはweb3ゲームの将来のベンチマークとなる高品質のゲームを作成できるワールドクラスのチームがいるからです。 \n  \n ミントの日付はまだ発表されていませんが、夏頃予定だそうです。 ミントまでの日数が少なくなっているので参加する方はお早めに \n\nDiscord [https://discord.gg/eZKGczhuCD](https://t.co/SF0oQt6BQ3)  \n  \n HP [https://azragames.com](https://t.co/uhSk6yLoRz)  \n   \n  \n ", "timestamp": 1657887771, "digest": "aoiCF9LXK5qefH7RzKwLcLBM-SmI_FWfVcBEKGIaCa0", "contributor": "0x07Be1d15A904D7A033E31CFD517a14Bb553AFa1e"}
{"id": "WV_77ZBFCG3CAiIdvM7KbqENASc-ZaBQVtbZsrHtAmM", "title": "『Mail3』Web3時代のメールアプリのスタートガイド", "body": "こんにちは。薬学生です。\n\n今回は最近登場した『**[Mail3](https://mail3.me/)**』というプロジェクトについて紹介したいと思います。こちらのプロジェクトは、簡単に言うと**Web3用のメールサービス**で、ウォレットがあれば従来のメールのように簡単にメールをできるサービスです（なお、現在はENSホルダーのみ対象です）。\n\nなお、Gmailなどを普段から使われている方は、感覚的に使い方が分かると思いますので、まずは何も見ないでMail3の操作性を試してみるのもありだと思います。\n\n## Mail3の始め方\n\nそれでは早速Mail3を使ってみましょう！\n\nなお、この記事を書いている7月14日時点では、ベータ版が公開されている状態ですので、**ENSを所有している人が主な対象**となります。\n\n### 1. Wallet接続\n\nまず[Mail3のアプリ](https://app.mail3.me/)を開きます。「Connect Wallet」を選択しましょう。\n\n![Connect Walletを選択](https://images.mirror-media.xyz/publication-images/BcOREy5uNzKrE1ISfsqKu.png?height=1032&width=1920)\n\n以下のように接続できるウォレットの選択肢が表示されますので、お好きなウォレットを選択しましょう。なお、**現時点ではMetaMaskとWalletConnectのみ選択可能**ですが、将来的には**PhantomやKeplr、Polkadotなど、非EVM系のブロックチェーンも対応する見込み**です。\n\n![ウォレットを選択](https://images.mirror-media.xyz/publication-images/TOf95E_GXTrkJ40HSqz2-.png?height=1032&width=1920)\n\n以下の「Check」を選択することによって、Mailを送信する時などに毎回Signする必要なく、Mail3を利用することができます。\n\n![Checkを選択](https://images.mirror-media.xyz/publication-images/7KuxXI4CSIFbpjgyptPzA.png?height=1032&width=1920)\n\n以下の画面が表示されればログイン完了です！\n\n![ログイン後の画面](https://images.mirror-media.xyz/publication-images/wVK348LR6bPElUs6isIXj.png?height=1546&width=2470)\n\n\n---\n\n### 2. メール作成\n\nそれではメールを作成していきましょう！\nまず画面右にある「Write」を選択します。\n\n![Writeを選択](https://images.mirror-media.xyz/publication-images/7KDwUykSOQLG1c25EH3_o.png?height=1080&width=1728)\n\n以下の通り、通常のメールアプリと同じように下書きが表示されますので、必要事項を記載しましょう。\n\n![メールの作成](https://images.mirror-media.xyz/publication-images/GhcZeAQVts7gKtpwFpszY.png?height=1080&width=1728)\n\nメールを作成し終えたら、「Send」を選択してメールを送りましょう。これでメール送信完了です！\n\nなお、メールの宛先に困りましたら、**yakugakusei.eth@mail3.me**までメールしてもらっても大丈夫です（返信は保証しかねますが、、）。\n\n![Sendを選択](https://images.mirror-media.xyz/publication-images/fDG_DVVYvZdAWFAe63Pwk.png?height=1080&width=1728)\n\nなお、新しいメールを受け取ったときは、Inboxの中のNewという欄に、以下のようにメールが表示されます。\n\n![](https://images.mirror-media.xyz/publication-images/MmBdCexa_EqOJfSOrcI9P.png?height=1546&width=2470)\n\n\n---\n\n### 3. Mail3の注目機能\n\nMail3の注目機能として、署名カード機能があります。以下のように、メール作成画面の右側の「no signature card」を選択すると、署名カードの選択肢が表示されます。ここで「mail3.me」を選択してみましょう。\n\n![署名カードの選択](https://images.mirror-media.xyz/publication-images/m0DyRCoVSOmD5xOesjoOj.png?height=1080&width=1728)\n\nすると、以下のように自分のENS固有の署名カードが表示されます。これによって、**メールの送り主がユーザー自身であることを証明することが可能になります**。\n\n![署名カードの見た目](https://images.mirror-media.xyz/publication-images/Rdh9lUYPQP5-kmYgy7-9J.png?height=1080&width=1728)\n\nためにし、自分自身にメールを送ってみたところ、以下のように表示されました。なお、こちらのメールは従来のGmailなどに送信することも可能であり、その場合には**pngファイルとして添付される**こととなります。\n\n![署名カードの見た目](https://images.mirror-media.xyz/publication-images/YTjCHckxKQtxjqFqGsaku.png?height=1546&width=2470)\n\n\n---\n\n### 4. 署名のカスタマイズ\n\n最後に、署名のカスタマイズの仕方について紹介します。\n\n![こちらのカスタマイズです](https://images.mirror-media.xyz/publication-images/5J99wThTHfPjHmFS4nojo.png?height=1080&width=1728)\n\nまずトップ画面右上のアカウントを選択し、ポップが表示されたら「Settings」を選択しましょう。\n\n![Settingsの選択](https://images.mirror-media.xyz/publication-images/X2XkmQDQLmFNh1cCaHZSx.png?height=1080&width=1728)\n\n以下のような画面が表示されますので、「Add Text」の欄の中を自由に変更することで、署名をカスタマイズできます。なお、署名・署名カード共に、右側のボタンのオンオフを切り替えることで、デフォルトでメールに追加するかどうかを選択することができます。\n\n![署名のカスタマイズ](https://images.mirror-media.xyz/publication-images/UZ5ch_sbqdNy-ZXmHeo99.png?height=1080&width=1728)\n\n\n---\n\n以上で、Mail3の使い方の紹介を終了します。もっと詳しくMail3について知りたいという方は、**Takaさんがライトペーパーを和訳**していますのでそちらをチェックしましょう！\n\n[https://twitter.com/taka_eth/status/1545972513142091776](https://twitter.com/taka_eth/status/1545972513142091776)\n\n[https://taka-eth.notion.site/Mail3-f81352d411064b87878156c3bea5b0e0](https://taka-eth.notion.site/Mail3-f81352d411064b87878156c3bea5b0e0)\n\n\n---\n\n## Mail3\n\nBuild valuable connections in the decentralized society\n\n[Website](https://mail3.me/) | [Twitter](https://twitter.com/mail3dao) | [Discord](https://discord.com/invite/equB6RTCHR) | [Blog](https://mirror.xyz/mail3.eth)\n\n## Yakugakusei\n\nCrypto enthusiast / researcher / blogger / ambassador / translator 🇯🇵 Feel free to contact me in English😉\n\n[Twitter](https://twitter.com/_Yakugakusei_) | [Notion](https://yakugakusei.notion.site/Yakugakusei-63ab3bd85b5d4e709d65cfc5c59fc64c) | [Discord](https://discord.com/invite/H6YyK2gwYt)", "timestamp": 1657887449, "digest": "v2MJo5RyQLHqWnLXvUXp8V-e1EYomSZbU2npJT1reZE", "contributor": "0xF222f955Ecced246f3181d14fB4629469cEB7681"}
{"id": "yk-AqsG2KG4fXdtN2tFr3q10_-zkjcq8frme9ss7tjo", "title": "符文诡偶", "body": "　苏伦目光也渐渐变得有些凝重。 \n  \n 　　因为他自己的手也拿起叉子叉起了一大块带血的肉，正往嘴边送。 \n  \n 　　如果不想想办法，他大概会第一次品尝人体脏器的滋味。 \n  \n 　　他知道，如果不找到破局点，迟早都会被那“幽灵种”给玩儿死。 \n  \n 　　恐怖的庄园，诡异的人偶，一个喜欢虐杀人类的幽灵种... \n  \n 　　苏伦的思绪飞速转了起来。 \n  \n 　　突然，他想到了什么，灵光一闪：“这屋子里的诡异既然有轻易杀掉我们的能力，却偏偏没有...这说明那‘诡异’有智慧可言，而且不低。” \n  \n 　　怪物有智慧，这对他来说是件好事儿。 \n  \n 　　就怕怪物只懂得本能地杀戮，那才是绝境。 \n  \n 　　打，肯定是打不过的。 \n  \n 　　但从他千场恐怖游戏和恐怖电影的经验来看，只要是有智慧的NPC，都能通过交谈，获得剧情转机（线索）。 \n  \n 　　书房、走廊、宴会厅...脑中的线索突然首尾相连。 \n  \n 　　苏伦觉得，他大概找到了破局的关键！ \n  \n 　　“呼...” \n  \n 　　心中呼出了一口气。 \n  \n 　　苏伦决定尝试一下。 \n  \n 　　这时候，他神情突然一凛，朝着虚空处说了一句莫名其妙的话：“佩斯托娅小姐，我能和你谈谈么？” \n  \n 　　这一开口，仿佛时间都禁止了。 \n  \n 　　苏伦自己正在往嘴里送肉右手，也停在了半空中。 \n  \n 　　听到这话，不远处正吃得满口是血的光头明显一愣，不明白为何苏伦为何突然说出这么莫名其妙的话。 \n  \n 　　不过，这时候，虚空中却传来了回应，“咦...你怎么知道我的名字的？” \n  \n 　　依旧是之前那个低沉诡异的老太太声音。 \n  \n 　　猜对了！ \n  \n 　　苏伦听到这话，立刻意识到自己的推理没有毛病。 \n  \n 　　之前那个马库斯的家伙说过，这个“幽灵种”发现了他们，却没直接杀死，而是玩了几个游戏，躲猫猫、弹弹珠、保龄球... \n  \n 　　只要遵守游戏规则，就能暂时活下去；而违反规则，立刻就会被杀死。 \n  \n 　　同现在的情况一样，这诡异明明能轻易杀掉他们，却选择了“玩儿”。 \n  \n 　　这也证明，这个“幽灵种”的年纪不大；或者说，心理年纪不大。 \n  \n 　　而这餐桌上，除了尸体，一共只有三具人偶，一个西装绅士，一个贵妇人，一个妙龄女子。绅士坐在主位，显然这是一家三口。 \n  \n 　　而苏伦之前上桌观察的时候就觉得这三人很眼熟。 \n  \n 　　再一细想，就会想到之前在书房的墙壁上，他看到过一张全家福照片。", "timestamp": 1657887455, "digest": "7Fn7qG6Q-fiRwQh_kDJaybzyUWt0HKGfsHgwXDQUE7w", "contributor": "0xF792e09704A053Fa35E1997aB7558185e23370C6"}
{"id": "EBa5IRYDYqCrXSMdUP3eRhD7U4SH-bgjfvZkzLWg4wo", "title": "地窟世界", "body": "复杂的地窟通道，一处幽暗的坑洞中。 \n  \n 　　苏伦尽可能压低了自己的呼吸声，而他的目光，正凝重地瞧见数百米外。 \n  \n 　　在那里，有一头正在游荡的人形怪物，正漫无目的再洞窟里猎食。 \n  \n 　　它身上还有一些人类的衣服和装备，可模样已经完全变成了像是巨人观一样肿胀的怪物。 \n  \n 　　苏伦看着这怪物，手指已经搭在了填装了炼金子弹的火枪扳机上。 \n  \n 　　只要过来过来，就会一枪打爆它的脑袋。 \n  \n 　　【畸变的人类】 \n  \n 　　详解：承受不了诅咒力量侵蚀人类畸变后变成的魔物，拥有很强的听觉感知。它们没有多少智慧，只有猎食和杀戮的本能。 \n  \n 　　幸运的是，没多久，那头怪物游荡着朝着另外的方向离开，并没有靠近苏伦藏身的地方。 \n  \n 　　苏伦也松了一口气：“呼...这地底到底还有多少奇怪的生物啊...” \n  \n 　　这不是他第一次遇见这种怪物。 \n  \n 　　三天前，他从那密道中走出来的时候，就遇到了一头。 \n  \n 　　因为那时候完全不知道这地窟的险恶，并不知道走路踩石的细碎声响，也会吸引了这种听觉极其灵敏的怪物。 \n  \n 　　幸亏目力增强后，他发现及时。 \n  \n 　　这东西就像是肉山一样横冲直撞而来，差点没把他给当场GG。 \n  \n 　　畸变怪根本不能近身，否则随便破个伤口，就能崩你一脸巨恶心的腐肉烂泥。 \n  \n 　　腐蚀性超强，还恶臭。 \n  \n 　　普通子弹根本没多少用处，打在它身上，就像是打在了一滩烂泥里。 \n  \n 　　“波儿\\~”冒一个泡，没任何作用。 \n  \n 　　也幸亏苏伦有所准备，消耗了几颗那种“高爆”炼金弹。 \n  \n 　　精准射击，像是榴弹炮一样剧烈爆炸，才把那怪物打得稀巴烂。 \n  \n 　　可他身上的炼金子弹数量并不多，而这些洞窟里，并不只有这一种怪物。 \n  \n 　　如果不是他觉醒了“全知之瞳”，夜视能力得到了极大的增强。单靠那简陋的炼金夜视仪，这一路他早就死了很多次了。 \n  \n 　　苏伦之前以为这地窟世界是一个大型矿洞，又或者溶洞。 \n  \n 　　但地底的空间面积大的有些让人难以置信了，不仅有人类城市遗迹，而且地底还有完整的生态系统，各种动物、植物、怪物...藏在阴暗的各个角落。 \n  \n 　　发着数十米高的荧光蘑菇森林见过么？ \n  \n 　　恐龙大小的蜥蜴见过么？ \n  \n 　　像是蝗虫过境的红眼老鼠见过么？ \n  \n 　　十多米长，真正长着一千条腿的蜈蚣见过么？ \n ", "timestamp": 1657887957, "digest": "F1WcBF8pqU9bqPLMLgm1C0T4TS8GH6vP4zw0-KLp-X4", "contributor": "0x9f5Fdd8DCA536E23bfe952A6AF998fa087F82C9D"}
{"id": "PmUOTEEN0D4fzmQH70lkN-tXokEdUnP598AGOxQ5Npc", "title": "迟到的外挂比草轻贱！", "body": "“叮！欢迎您加入聊天群！” \n  \n 　　“叮！您已自动成为群管理！” \n  \n 　　“叮！欢迎莫名其妙在修仙加入聊天群！” \n  \n 　　“叮！欢迎我只是一个想退休的法师加入聊天群！” \n  \n 　　“叮！欢迎行走的大骨汤加入聊天群！” \n  \n 　　“叮！欢迎这不是我想要的外号加入聊天群！” \n  \n 　　正在感悟天心印记奥妙的孟川睁开眼，神念铺天盖地的探出，扫过北斗，然后冲进宇宙星空，探查了数个星域，除了惊动了一些禁区至尊之外，一无所获。 \n  \n 　　“聊天群？”孟川收回神念，略微思索，然后直接借助天心印记，强行探查整个宇宙，毫无疑问的，没有得到任何有用的信息，天心印记也没有任何反应。 \n  \n 　　“这是我的，金手指么？”孟川神色古怪，回想起了一些久远记忆中的事情。 \n  \n 　　“可就算你是金手指，这来的怕是也太晚了一些吧……” \n  \n 　　“让我来看看你究竟是什么东西。”孟川打开随着提示音一起出现的聊天群面板，额…… \n  \n 　　大企鹅集团已经把业务开展到别的世界了嘛…… \n  \n 　　看着熟悉的群聊面板，孟川有些叹然，这是自己曾经多么熟悉的东西啊。 \n  \n 　　现在的聊天群还没有人说话，看着包括自己在内的五人都显示在线，孟川决定主动打个招呼，身为当世大帝，义不容辞！ \n  \n 　　一位内心骚动的大帝:萌新三连（我是谁，我在哪，我要干什么）.JPG \n  \n 　　淦！孟川看着自己的群昵称，震怒！你才内心骚动呢，你全家都内心骚动。 \n  \n 　　行走的大骨汤:不是吧，我怎么又遇到这些奇奇怪怪的事情了，不是都已经结束了嘛！ \n  \n 　　我只是一个想退休的法师:联通多元宇宙的产物吗？我没有在任何一条时间线上见过，奇怪。 \n  \n 　　这不是我想要的外号:原来真的有金手指！写小说的果然都是隐藏大佬！ \n  \n 　　莫名其妙在修仙:贫道武当张三丰，见过诸位道友！ \n  \n 　　孟川看着聊天群的最后一条消息，眼睛一亮，这是一个熟人啊！ \n  \n 　　一位内心骚动的大帝:@莫名其妙在修仙，原来是张三丰张真人。 \n  \n 　　孟川看着自己的昵称直接就去找改名功能，这破名字一点也不符合他本人！ \n  \n 　　武当山上，断崖边，张三丰看着眼前的面板，饶是以他那么多年的心境，都出现了许多波动。 \n  \n 　　当今武林，他早已天下无敌，连能与他痛快一战的人都少之又少，更别说对他用出如此手段了。 \n  \n 　　“我都不用把话说出来，只要在心里面想到，就能出现在这个……聊天群上面吗？”张三丰看着最后一条消息，眉头一挑，“有人认识我？我该怎么像他一样，用这个符号加他的名字呢？” \n ", "timestamp": 1657888051, "digest": "frr-BGEcUcD1doqHOqFzFp6LGoKG-ZfdF7UiSdbhF8c", "contributor": "0xFB973C32a7EbEe9616B6150D17394CAdce6384f6"}
{"id": "tTUcJ1ApRtBLLDMkp-vS-X1yhoCd_rGW6Wu4t2O5cqg", "title": "是谁在白嫖？", "body": "　系统提示：管理员孟奇上传了群红包——罗汉拳 \n  \n 　　孟奇：我看见有红包功能，先给大家发个红包！ \n  \n 　　孟川无语，你不止在说尼玛，你还在忽悠人。 \n  \n 　　我堂堂大帝，会要这凡间的功夫？ \n  \n 　　系统提示：管理员孟川领取了罗汉拳。 \n  \n 　　反正是白嫖来的！ \n  \n 　　系统提示：管理员张三丰领取了罗汉拳。 \n  \n 　　…… \n  \n 　　一卷罗汉拳，引无数群友竞折腰！ \n  \n 　　系统提示：管理员张三丰上传了群红包——武当心法 \n  \n 　　系统提示：管理员张三丰上传了群红包——纯阳无极功 \n  \n 　　…… \n  \n 　　系统提示：管理员张三丰上传了群红包——太极剑法 \n  \n 　　张三丰：不知道这些东西能不能对各位有所帮助，若是有需要的，大家都可以领取。 \n  \n 　　张三丰很豁达，武当有的，基本上都上传了。 \n  \n 　　刚才他们看了孟奇的命运副本后，其他三人的也在删减过后选择了开放，大家都算知根知底的人了。 \n  \n 　　张三丰：小孟你如果要修炼老道上传的武功，切记先问问聊天群能不能遮掩一下。 \n  \n 　　张三丰的意思，群里的每个人都明白，以孟奇的处境，你无缘无故的使用一些自己根本不可能得到的武学，那可真的是找死了。 \n  \n 　　并且还不是一世之尊的武学！ \n  \n 　　系统提示：管理员孟川领取了管理员张三丰的所有红包。", "timestamp": 1657888157, "digest": "Ac_AsBsYYqfI-sUxIkNWSq4XYCbVQdwb_ICFB86YXXY", "contributor": "0x08D35CE64bB2B947B9C4D9A53e0E5cAd56e74B18"}
{"id": "V7u2afsrHCi5MfKUh9uUoqNiMhL4x2g0kpbQjbstuIM", "title": "写给深陷恐惧的我，以及你", "body": "全文约4900字，阅读大约需时13分钟\n\n* 开始的开始\n* 什么是恐惧？我们恐惧什么？\n* 不在恐惧中灭亡，就在恐惧中爆发？\n* 我看、我看、我看恐惧\n* 题外话\n\n## \\~开始的开始\\~\n\n### 去年10月份，偶然在一次活动上见到了OneDegree的联合创始人Alvin Kwock。那时候他坐在我右边，而在场的还有一些港大可爱的同学们。其实单凭回忆有点忘了他具体长什么样了哈哈，不过印象很深的是，戴着方形黑框眼镜的他，眉眼间透露着一种令人亲切的刚毅和睿智。在Alvin请求下，我们挨个给Alvin做了个简单的自我介绍。接着，他突然抛出一个让我有些措手不及的提问，他很认真地问了这样一个问题：“大家講下，你地最驚d咩？”，意思就是让我们一个个来讲讲我们害怕的一些东西，可以是任何情况下的任何事物。万万没想到了，在场子还没暖起来的时候就要回答这个有点点深层的问题。当时觉得怪有意思的，但也没有细想。后来才知道，Alvin和团队开会的时候，他也试过以这种方式去认知彼此。\n\n### 现在回头想想，忽然发现这个问题还挺有得考究的。我之所以觉得那个问题在当时有点突兀，某种程度上，或多或少也是因为我将恐惧——这个像影子一样每天尾随我、与我共存的东西，佯装视而不见、习惯性忽略了吧。还有另一个原因就是，谈论恐惧多多少少带有一点神秘的私人属性，就像谷爱凌在纽约时报的采访中提到的，\"I don't talk about it (my fear) with people who I'm not superclose to”（我不会和我不是非常亲密的人讨论恐惧这件事）。的确，自揭恐惧的时候，就像是脱下自我保护的面具和衣甲，向大众做一个真实自我的袒露。无怪乎Alvin会和他的团队们聊这个话题。作为一个创始人和CEO，毋庸置疑的是，对团队伙伴们的担忧和恐惧了然于胸关乎成败。一个对团队成员没有深层了解的创始人又如何能够为团队提供更好的福利安全网？又如何能够奠定和巩固团队的信任基石呢？像Alvin这样已经在大风险的湍流中激流勇进的人，洞悉自我的恐惧、团队的恐惧、竞争对手的恐惧方能知己知彼百战不殆；而对于尚未身处巨大风浪和漩涡的我而言，或者我们而言，为什么要花时间来谈论恐惧、了解恐惧呢？\n\n### 当然，补充个前提，这里所提到的恐惧，准确而言是心理上的恐惧；生理上的恐惧，比如怕蛇等等之类生理本能式的恐惧反应，我这就暂且不谈了。\n\n### 回答上一个问题之前，可以先讲讲另一个问题。追根溯源，我对恐惧这个话题感兴趣是什么时候开始的呢？具体我也忘记了时间，但是过去这一年多来，我确确实实地感受到，我内心蛰伏的恐惧会突然在关键时刻跑出来作祟。那种很难一下子消退的恐惧就像是物理学上的向心力一样，牵引着我不停地围绕着一个无意义的中心重复着心理内耗的活动，而迟迟无法做出一个良好的决策和行动。这种状态很容易被日常的忙碌所巧妙掩盖，但是，一旦情况有所突变，新的机会或者危机涌现之际，这种状态就露出马脚来，我也因而陷入了一种无谓的挣扎之中。这种无端的消耗内心意志力的恐惧，可能不单单是我，读到这里的你，是否也曾经感同深受呢？著名的普鲁斯特问卷（the Proust Questionnaire）里就有一道这样的问题：What is your greatest fear？（你最惧怕的是什么？）这个问卷的意义旨在深入理解一个人的价值观和自我认知。可见，谈论恐惧是认知自我的其中一步，而认知自我是一个需要长期复盘的课题。所以，这大概是谈论恐惧的原因和意义吧。而除却死亡之外，大大小小的恐惧、担忧、焦虑等如影随形。事实上，我们到底在害怕些什么呢？\n\n![Photo by Sasha Freemind on Unsplash](https://images.mirror-media.xyz/publication-images/lmR7_5SPlqeWqXfjDrI-3.jpg?height=1910&width=2865)\n\n## \\~ 什么是恐惧？我们恐惧什么？\\~\n\n### 我们所害怕的究竟是什么呢？是过去和未来。比如此刻，我安坐于此输出文字的当下，四周波澜不惊，没有任何需要恐惧或顾虑的东西，没有任何会直接威胁到我的事物。然而，写着写着，可能脑子会不听使唤，自顾自开起小差，“内心深处可能正在挂虑着未来可能发生的事，或者担心过去发生的某件事会卷土重来”（《重新认识你自己》）。正因为我难以完完全全践行活在当下，所以自然而然被过去的经验和记忆所牵扯，为未来的不确定性而忧心忡忡。克里希那穆提(Jiddu Krishnamurti)在《重新认识你自己》(《Freedom from the Known》)中发问：\n\n> 我们现在必须要问自己，人心可不可能完全地、彻底地存活于当下？只有在这种心智状态下，恐惧才无从生起。若想深入了解这种状态，就必须先了解念头、记忆及时间的结构才行。这种了解不是出自理性或口头上的，而是发自内心和肺腑的了悟，然后你才能从恐惧中解脱出来，那时我们的心才能自由无惧地思想。\n\n### 而再深入一层去思考，我们的恐惧是由念头或者说我们对于一个事实的看法而衍生的。很简单举个例子，小L同学明天要向潜在客户推销研发的新产品，他一想到这件事，就七上八下坐立不安，开始不由自主地害怕被拒绝，被别人冷眼相待，甚至被恶意嘲讽。他害怕的不是向别人推销产品这件事本身，而是害怕自己强行脑补的N种坏结果，是他对这件事背后延伸的负面看法和想象。正如著名的斯多葛学派作家塞内卡(Seneca)所言：“We suffer more often in imagination than in reality\"(折磨我们的往往是想象，而不是真实)。\n\n### 克里希那穆提也说到：\n\n> 因此，该为恐惧负责的就是念头，道理就是这么简单，你不妨亲自观察一下。当你正在专心应付某种危机时，你并没有恐惧，等到念头一起，恐惧才由心生。\n\n### 回归我自身。比如说我现在作为一个半路出家的不定期更新的内容创作者，若是放在之前，可能也会有很多不必要的犹豫和顾虑吧。比方说，在日常一地鸡毛的琐碎中，我会害怕自己慢慢丧失足够的敏锐观察力和灵动的思考力，害怕写着写着可能会有一段时间脑回路堵塞、灵感枯涩，写不出什么有新意的内容。还有就是，现在其实已经慢慢脱离那种需要经常性写文、有持续性内容输入的环境，写文质量可能暗地里已呈螺旋式下跌，可能会害怕写出来达不到自己的期许而失望。又或者说，内容难以得到共鸣和回响，只是一个人的狂欢那也没有意思。\n\n### 与此同时，我越来越感受到不同的背景可以导致的视角的巨大差异，而这种巨大差异让我有一阵子产生了一种混乱，到底哪些是预先需要知道的“常识”？不同的背景导致我们站在不同的维度看待事物，横看成岭侧成峰。在我眼中可能像新大陆一样存在的所谓见闻，可能在另一个人眼中早已是那个环境和背景下常识一样的存在。反之亦然。这种对于自我观点输出得到的反馈的高度不确定性和怀疑，让我曾经在某段时间里战战兢兢。\n\n### 以上反面教材，欢迎大家前来吐槽。很明显，这真实演绎了什么是庸人自扰作茧自缚了哈哈哈。\n\n### 诚然，很多恐惧来源于对自我潜在的威胁，而趋利避害是人的本性，懂得防患于未然也是好事。但是，更多的时候，这些恐惧是多余的想象的结果，这种过度的内心戏码只会搅乱了专注生产的当下。让我们看看克里希那穆提是怎么说的吧：\n\n> 思想在生活的某些层面确实是必要的，然而它一旦变成一种瞻前顾后的心理反射以后，就会造成恐惧和快感，心智便因此而迟钝下来，于是怠惰就难免了。\n\n![Photo by Leslie Wong on Unsplash](https://images.mirror-media.xyz/publication-images/9wwVCNvvgGOBxel34b87R.jpg?height=4000&width=6000)\n\n## \\~ 不在恐惧中灭亡，就在恐惧中爆发？\\~\n\n> 我们唯一值得恐惧的就是恐惧本身——这是一种难以名状、盲目衝动、毫无缘由的恐惧，可以使人们转退为进所需的努力全都丧失效力。—— 富兰克林罗斯福(Franklin Roosevelt)\n\n### 真的如此吗？的确，上文所讲的各种恐惧就是值得恐惧的恐惧。\n\n### 但有另外一种恐惧。\n\n### 这是另一个故事了。一次偶然的聚会上，对面刚好坐了一家健康营养品公司的创始人。餐厅里，刻意营造的昏黄灯光轻微摇曳，把整个场子渲染出一种朦胧的不真实感。我对面的这位创始人缓缓道来他曾经所经历的恐惧。“你们知道吗？我那时真的好害怕，整晚整晚地睡不着觉，觉得好像一切都失去了意义”。说到这，他双眼中的某种东西似乎和餐厅内扑闪的灯光对上了频率一样，也开始迷离扑朔了起来。其他桌的人们兀自觥筹交错，我们这里却好像突然掉入了一个异时空里、一个生死无常的宏大命题里。“我害怕我的太太就这么匆匆、这么突然地离开我，那个时候，我才发现自己曾经心心念念的一些东西都不重要，我当时唯一祈求的就是，让她活下去”。那种对命运不由分说、分分钟可能强夺自己所珍爱东西的恐惧，逼使他重新审视自己的人生。所幸他的太太后来手术成功。但那种切肤的恐惧感从此给他埋下了深深的危机意识。你能感受到吗？他以为他的生活被自己安排得井井有条，直到突如其来的无常撞碎了他的想法。他开始恐慌、焦急、害怕，害怕在下一次的无常来临之前，他无法真真正正地过一次自我掌舵的人生。于是，你可以想象到的励志故事来了，他毅然裸辞、创业，第一次真正意义上做了自己渴求的事。当然，他是幸运的，也是被命运所祝福的。想说的是，这种恐惧本质上和前面所讲的无异，这是对未来的恐惧，是自我看法和想象的衍生物。然而，这种恐惧的感觉就像是把我们关在一个全密闭的镜子屋，没有缝隙可以让我们钻进去以逃避镜中可能有些狼狈的自己。置身于其中的我们被无数的自我镜像彻头彻尾地包围，我们被逼着360度无死角地面对自己、看清自己，然后，我们被倒逼着改变。\n\n### 《爱，死亡，机器人》(Love, Death & Robots) 第一季第一集《桑尼的优势》，主角桑尼对那个图谋不轨的坏女人说：\n\n> You don’t come into this world with hate, but fear.\n>\n> That fear is my edge.\n>\n> That fear of death.\n\n### 桑尼对死亡的恐惧就是她的优势，其他人只是把脑意识与魔兽连接上场格斗比赛，而桑尼则是与魔兽连为一体。别人输了，就只是输了一局游戏而已；而她输了，就意味着死亡。对死亡的恐惧倒逼她爆发，恐惧给了她破釜沉舟的力量，恐惧是她战无不胜的法宝。\n\n![Photo by Leslie Wong on Unsplash](https://images.mirror-media.xyz/publication-images/8O5rUWs_fl9rsNQPeOgZP.jpg?height=3669&width=2446)\n\n## \\~我看、我看、我看恐惧\\~\n\n### 我们在面对恐惧的时候，消耗了很多能量。\n\n### 最经常见到的是这三种模式。勇者直面恐惧，他不允许自己被别人称为懦夫，于是，他大声对自己身上的恐惧放话：“我要了解你，控制你，除掉你。”勇气小一点的，姑且叫小勇士吧，不希望被恐惧绑架的，但又常常有所顾虑，他们不停地和恐惧展开拉锯战，有的时候恐惧占了上风，有的时候小勇士占了上风。勇气再小一点的，直接闭上眼假装看不见自己身上这个庞然大物般的恐惧。\n\n### 除了这三种，有没有一种可能，我们能够以第三者的角度去平静地观察我们的恐惧并与之和平共存？“既不加以判断，也不以你所积累的知识来干预它”？\n\n### 克里希那穆提如是说：\n\n> 你通常能平静地观赏一片云、一棵树或河水的流动，只因为它们对你无关紧要。然而观察自己就不是那么容易了，因为自我的要求过于具体，反应又太过于迅速，因此，当你赤裸裸地面对恐惧、绝望、孤独、嫉妒或其他丑陋的心态时，你能不能心平气和地透视它？\n\n### 如果我们能够以这种置身事外的状态观察恐惧，而不是不停地设法克制或逃避恐惧，就不会形成自我与恐惧之间无止境的斗争。而一生的精力也就不会在这种无止境的斗争中耗尽了。\n\n### 事实上，我们和恐惧并非二元对立的关系，我们既是恐惧的观察者，同时也是产生恐惧经验的整体。\n\n> 你会发现原来观察者本身就是恐惧，你一旦了悟这个事实以后，就不会再枉费精力去斩除恐惧了，于是观察者与被观察者之间的时空距离，顿时消失于无形。你一旦认清自己就是恐惧，和恐惧无二分别，自然会停止所有的斗争，然后恐惧就会完全止息下来。\n\n### 我即恐惧，恐惧即我。于是乎，再不需要刻意地用蛮力去抵御恐惧的降临。\n\n### 不单单恐惧是如此，万千情绪也是同样道理。\n\n### “不用牵挂过去，不必担心未来。踏实于现在，就与过去未来同在“，这句话来自圣严法师，和当晚那位创始人告诉我的意思差不多。他一边向我们解释，右手一边不由自主地放到没有盖的玻璃杯上，不松不紧地、由上而下把杯口握住。摇曳的灯光在他握着杯子的手上流淌，然后顺着他手指间的缝隙稳稳当当地流到杯子里面去，在杯中缓缓摇曳的水中流淌、游荡，熠熠闪光。在他握住杯子的那个时候、在我观望那轻微闪动的杯中之水的那个时候，我突然明白了那种踏踏实实的、活在当下的真实感和力量。\n\n![Photo by Prchi Palwe on Unsplash](https://images.mirror-media.xyz/publication-images/7vbAWtqZDigwVXervIkca.jpg?height=6000&width=4000)\n\n## \\~题外话\\~\n\n### 我们常常羞于提及自己的恐惧，觉得自己的恐惧不值一提，是“低级的恐惧”；更甚者，对他人所表达的恐惧嗤之以鼻。我们绝口不提恐惧，觉得说了便是软弱的表现；但事实上，说出恐惧不也需要勇气吗？\n\n### 几年前看到法国作家卡缪(Albert Camus)在《鼠疫》(《La Peste》)里写的一段话，分享一下：\n\n> 倘若我们当中哪一位偶尔想与人交交心或谈谈自己的感受，对方无论怎样回应，十有八九都会使他不快，因为他发现与他对话的人在顾左右而言他。他自己表达的，确实是他在日复一日的思虑和苦痛中凝结起来的东西，他想传达给对方的，也是长期经受等待和苦恋煎熬的景象。对方却相反，认为他那些感情都是俗套，他的痛苦俯仰皆是，他的惆怅人皆有之。\n\n### 在我眼中，恐惧不因地位、背景、种族等等而有高级和低级之分。它值得被听见、被看见、被理解、被化解。\n\n![Photo by Christopher Campbell on Unsplash](https://images.mirror-media.xyz/publication-images/JEcTBR6P5m__QqdNUiZrK.jpg?height=4657&width=3105)\n\nCover photo by Raimond Klavins on Unsplash", "timestamp": 1657888174, "digest": "7cLwcWJyf-Eh6Bm3KhecI92NqOnuNaX0wvbgnXv6EWY", "contributor": "0x72D993FE281118fE8F9509A65800014025546616"}
{"id": "2qHu0h2kgZHDpqY6qem8LyQf6Y7lPMmu4MALxyEewSs", "title": "animal", "body": "Mostkidslikeanimals。Girlslikecats，andboyslikedogs。However，myfavoriteanimalisthehorse。Thehorsesarestrong，notlikethetamecatsorpuppydogs。Theylookwildandhardtogetclose。Yet，theywillbeverytimidandfriendlyaftertheygettoknowyou。Horsesrememberthewayhome。Theyarealsofaithfultotheirmasters。Theyevenunderstandwhatyouaretryingtotellthem。I'veheardmanystoriesabouthowahorsesavedhismaster'slife。That'salsothereasonwhyIlovehorses。Theyneverbetrayyou。", "timestamp": 1657888686, "digest": "zUpECZDdqX5UyFWZecfDMIFy2Q7WggRnd5bjDqxRj7c", "contributor": "0x5A5159863A6836991fc2c4CB0718c57e940eBEFB"}
{"id": "4cH-paQTIKabnSqbakLQ49ueLMviRXW6NIi47Y6i6ho", "title": "Take your first look at what the Motorola Edge 30 Ultra's 200MP camera can do\n\n", "body": "Motorola is readying the first smartphone to bring a 200MP Samsung ISOCELL HP1 sensor to the average consumer. Although the sensor has been around for a while, a recently released sample image may give you buyer's remorse for picking up that expensive mirrorless camera.\n\nMotorola [teased a big image sensor](https://www.androidpolice.com/motorola-x30-pro-frontier-camera-size/) earlier this month, but we weren’t expecting Lenovo’s General Manager Chen Jin to share a sample so soon. As reported by [91Mobiles](https://www.91mobiles.com/hub/motorola-edge-30-ultra-200mp-camera-sample-revealed-launch-specs/), the photo in question was shot on the Motorola Edge 30 Ultra (that's the Moto X30 Pro in China). It was posted on the Chinese social media platform [Weibo](https://m.weibo.cn/status/4791070728130396), along with a few technical specifications.\n\n**ANDROIDPOLICE VIDEO OF THE DAY**Close\n\nJin says the 50MP image was shot using camera's auto mode. The 200MP sensor created the image using four-in-one [pixel binning](https://www.androidpolice.com/what-is-pixel-binning/); this is expected to be the camera’s default image resolution to help economize storage space without compromising too much clarity.\n\nThe photo of a bouquet with a sunflower, a rose, and other flowers flecked with droplets of water is strikingly detailed, and the colors seem realistic, although there are some soft edges and shadows seem to have been lifted slightly. Despite Weibo’s compression, the image retains its quality, as is evident from the 13MB file size. We sure hope Motorola equips the phone with ample storage or a dedicated SD card slot to store the giant image files.", "timestamp": 1657888520, "digest": "-2RApOggZ-s4mqVrHtuVxdi2Go_kJ7e4PSZhFfHMUnM", "contributor": "0x4374aCdD2d1D413856C45cA284F33e01D0Ddd533"}
{"id": "7OPQy2Rt8i6HnRmpCDF3a7Ngx5cqBxF68TeqpgzFuG4", "title": "为什么中文拼音ENS域名值得收藏", "body": "## 原因1：ETH是公链龙头\n\nETH目前来说，是公链的龙头，它的龙头地位如果一直持续下去，那么在这条公链上唯一一个域名系统ENS将在WEB3扮演非常重要的角色。\n\n借鉴传统互联网的域名服务，如.com .cn .vip .cc .xyz~~等等等~~\\~ 做过网站的朋友都知道，.com域名是传统互联网的龙头域名，曾经一度一个双拼域名二级市场价格最少6位数人民币，好一点的双拼域名至少7位数人民币。最高峰weixin.com这个域名被腾讯拿下，腾讯为此付出了3000万人民币的代价。\n\n如果.com是传统互联网的龙头域名，那么ENS就是web3世界的龙头域名。\n\n## 原因2：中国网民的习惯\n\n中国网名习惯与拼音域名，如传统互联网大企业的网站域名，baidu.com(百度)、weibo.com（微博）、douyin.com(抖音)、douyu.com（斗鱼直播）、zhihu.com(知乎)、tianya.com（天涯）、weixin.com（微信）等等等\\~\\~\\~\\~这些互联网大企业用的都是双拼域名，非常好记，基本上一眼就能记住他们的网址，所以中国网名已经习惯拼音域名。\n\n## 原因3：未来价值\n\n目前来说，ens域名的价值还远远没有发挥出来。想象一下，未来web3普及，元宇宙，社交，gamefi等一些应用普及，人们对ens域名需求会有多高？我想没有人原因用一长串的区块链地址来当作你的网名吧？\n\n还有未来，当人们可以用ens建设去中心化网站的时候，用ens域名+ipfs存储搭建一个去中心化网站，那么ens域名需求量将会是多少？\n\n所以呈现在，web3还没普及的时候，去注册一点好记得拼音域名囤着，目前来说长度>=5字母的域名，一年才只需要5美金，这将是一笔万倍或者千万倍的回报。。。", "timestamp": 1657888466, "digest": "8pI6W4Uge97A9iCyIvX4H1B9YEMYUUNq5YrImUedpOs", "contributor": "0xE9811aA06E8AEf0B4485f8BfD08d52E4E0FBDc7E"}
{"id": "ba_-cGACldShTkk8DgfEinrQdgGyayBYXPZKeK9AEs8", "title": "7 principles for the top-1% at Numerai Signals", "body": "This article is aimed at the audience that has already participated in the Numerai competition or prepares for it. In two words, Numerai gives you an opportunity to generate signals for weekly asset movements, stake cryptocurrency, and earn rewards based on your performance. You can get their encrypted data and focus only on ML models or you can get your own data for the predefined universe, generate your own features, and train ML models over it. We will cover [the second version of the tournament](https://signals.numer.ai/) in this blog. The learnings and ideas can be extended to more regular trading and investment management setups. You can follow the performance of some of our models here:\n\n* <https://signals.numer.ai/vh_ai>\n* <https://signals.numer.ai/l1nkoln>\n* <https://signals.numer.ai/rachnogstyle_ds>\n\n## 1 Survivorship bias\n\nNumerai provides a list of traded tickers as a part of the competition. The most straightforward idea for utilizing them is just to go to your favorite data provider (as it’s shown in the tutorials with Quandl and Yahoo Finance), download the historical data, and start extracting features and modeling them with respect to the provided target. This is where the very first mistake is hiding. **The traded stocks today are subject to survivorship bias!** You cannot just download the historical data for them and start training models, because it’s 2022 when you know your companies survived, but in 2015, 2010, 2000, and before there were other tickers who were delisted for one or another reason or your current companies in the universe are simply too young. You want to model historical data based on the historical universes. We are using [the data provider](https://eodhistoricaldata.com) to build the correct survivorship bias-free datasets and this is the #1 step of our setup.\n\nAdditional useful resources:\n\n* <https://www.investopedia.com/terms/s/survivorshipbias.asp>\n* <https://teddykoker.com/2019/05/creating-a-survivorship-bias-free-sp-500-dataset-with-python/>\n* <https://www.quantshare.com/sa-435-getting-accurate-backtesting-results-survivorship-bias-free-s-p-500>\n\n## 2 Large feature space\n\nThis is something that is shown correctly in the official tutorials, however, we took this idea further. First, we utilize the whole candle space (high-open-low-close-volume-open interest) and it gives us the opportunity to work with the big space of technical indicators as features. Moreover, we also leverage fundamental data and macroeconomic data in our models. It is rather hard to collect it for the whole Numerai universe but for the US-traded tickers, it boosts the performance. We create original features via a combination of market and fundamental data. **Unique features are one of the most important things**. Try to develop new orthogonal features for your dataset. Last but not least, we use the combination of lags for all our features for several weeks and months back which all together creates for us a very large space of features for the model. We don’t calculate the difference between the lags since we think that this is redundant and our models should capture the difference by themselves.\n\nWe recommend taking a look at the following resources to dig further:\n\n* <https://arxiv.org/pdf/1601.00991.pdf>\n* <https://www.amazon.es/Statistically-Learning-Algorithmic-Financial-Instruments/dp/148950771X>\n* <https://ta-lib.org/>\n* <https://www.investopedia.com/terms/f/fundamentalanalysis.asp>\n\n[https://corporatefinanceinstitute.com/resources/knowledge/finance/financial-ratios/](https://corporatefinanceinstitute.com/resources/knowledge/finance/financial-ratios/)\n\n## 3 Ranking as stationarizing\n\nSince we aim to create a market-neutral portfolio, it’s only logical to assume that our targets in the competition are relative performances of the instruments with respect to each other or to some other benchmark or value. Hence, our features also have to reflect such relative values within the trading universe. Some [tutorials on Kaggle](https://www.kaggle.com/code/carlolepelaars/getting-started-with-numerai-signals/notebook) just calculate features in a straightforward way, like each asset is independent by itself, but the smarter way is to apply the ranking procedure to turn the raw feature value into the relative one.\n\nIn the [Numerai tutorials](https://github.com/numerai/signals-example-scripts), it’s offered to do ranking time-wise over the 5 bins and generate the quintiles. Be careful when you’re grouping the data for the procedure. Grouping by ticker you will introduce look-ahead bias (i.e. you will rank along the time series axis). You should group by date because you’re interested in the relative performance of instruments within a single day, not of relative days within a single instrument. We recommend you take this approach further and be creative - **what else you can group your data around apart from the date today?**\n\n## 4 Models are not a priority\n\nHere we will be brief. We experimented with many things from era-boosting to VAE+GAN+siamese network embeddings in our search for superior performance. Our current baseline model is a simple LGBMRegressor without even a hyperparameter search. I think this already tells a lot about what’s important and what isn’t in the competition (at least in the Signals one).\n\n## 5 AFML validation routines\n\nWe don’t rely on any train-validation-live splits as it is proposed in the classic Numerai tournament. We have fixed a testing protocol on the same amount and timeliness of the data, the same cross-validation splits using **combinatorial cross-validation setup and time-series cross-validation setup**. We don’t change the setup for around a year already to keep track of all our experiments to be able to compare them without introducing any bias. Also, we compute a slightly wider setup of metrics also introduced in the AFML:\n\n* **Performance metrics** (correlation, Sharpe, drawdowns, Sortino, hit rate)\n* **Outperformance metrics** (information ratio, correlation with baseline, probabilistic Sharpe)\n* **Overfitting metrics** (probability of failure, overfitting probability)\n\nFor us, building such a pipeline was a game-changer that allowed us to evaluate hypotheses fairly. We started to choose models not with higher correlation or Sharpe, but with stronger outperformance and overfitting metrics that aim for stability and reliability.\n\nThe recommended reading is obvious here:\n\n* <https://www.amazon.com/Advances-Financial-Machine-Learning-Marcos/dp/1119482089>\n\nAnd shameless promotion of my blog:\n\n* <https://towardsdatascience.com/ai-in-finance-how-to-finally-start-to-believe-your-backtests-1-3-1613ad81ea44>\n* <https://towardsdatascience.com/ai-in-finance-how-to-finally-start-to-believe-your-backtests-2-3-adfd13da20ec>\n* <https://towardsdatascience.com/ai-in-finance-how-to-finally-start-to-believe-your-backtests-3-3-2f3b4d875842>\n\n## 6 Feature importance as the ultimate test\n\n![How market, fundamental and macro features merge together and influence our predictions](https://images.mirror-media.xyz/publication-images/CTosK145aF_FXGoawqwi3.png?height=1447&width=3314)\n\nApart from the purely numerical performance measurement, we calculate the feature importance (FI) to double-check if our improvements in the features and our introduction of the new ones have an **economic interpretation.** For example, in our first good models, it was very reassuring to see the “sell high - buy low” interpretation of the feature importance of such features as RSI. Or we could spot the importance of the volume traded with some specific lag. Later on, we saw how volume features and fundamental features contributed to the numerical performance and appeared on the top of the feature importance rating as well. We calculate FI using MDA, clustered MDA, and SHAP values.\n\nCheck out the following resources to dive deeper:\n\n* <https://www.amazon.com/Machine-Learning-Managers-Elements-Quantitative/dp/1108792898/>\n* <https://alexrachnog.medium.com/ai-in-finance-advanced-idea-research-and-evaluation-beyond-backtests-d4d7bb185854>\n\n## 7 We don’t look at Numerai’s dashboard\n\nLastly, we would like to mention that we don’t look at Numerai dashboard metrics or at the public leaderboard as the ultimate source of truth. Of course, it represents the live performance, but over a rather very limited time period. We are focused on our pipeline and working to make it as robust as possible to make it a single source of truth for our experiments. We are constantly studying its limitations and working on understanding and mitigating our pipeline's risks by design. One of such directions is data and targets simulation, which we take inspiration from the [Crowdcent](https://github.com/crowdcent/numerblox) repository.\n\n## Next steps\n\nWe are currently working on the improvements related to better and more unique feature space to target the true contribution (TC) metric and information ratio (IC) metric to make our models more valuable for the Numerai Fund. We also are experimenting with alternative targets (that’s why ranking is mentioned) and optimizing our code and infrastructure to scale our experiments. We are open to collaborations both in the development and investments space, hit us up on any socials to discuss further.\n\nP.S. If this topic is of interest, we will disclose more details on the feature space and some principles around it, let us know about this as well.", "timestamp": 1657888557, "digest": "QK5n09XOvmkQ6iuC0z4nHno4jKkdtWJRU-9WgzQ6IR8", "contributor": "0xDE1BEEcCa1467d428fA44250298f55A78743F6EF"}
{"id": "jE1PuX8MxJMOegoSoazHNwpRRyb5aijm-PIlsbxzRPA", "title": "命运副本", "body": "张三丰:这位小孟道友，是遇到什么危险了吗？ \n  \n 　　孟奇:说来心里苦，家里逼我当和尚，头发都给我剃了，我现在是一个光头啊！ \n  \n 　　古一：…… \n  \n 　　孟奇:啊！古一大师我不是针对你，实际光头也挺好的，只是各人有各人的爱好对吧！ \n  \n 　　看着在群里面耍宝的孟奇，孟川笑了笑，逼他做和尚，那应该只是剧情刚开始，连六道轮回都没有进入呢，现在的小孟还是个渴望还俗，想要练就绝世武功，人前显圣的小光头。 \n  \n 　　孟奇:不过大帝你怎么说出了遮天？难道你…… \n  \n 　　孟川:没错，我是穿越者，和你一样。 \n  \n 　　孟川:@圆大古，大古先生，在我穿越前的世界，有一部影视作品，叫迪迦奥特曼，你的名字和里面的迪迦奥特曼人间体一模一样，不过作品已经完结了，那里面的大古已经去了火星。 \n  \n 　　孟川:@张三丰，张真人你应该是某一部武侠作品里面的存在，前世我也看过一些包含你的影视或者小说作品。 \n  \n 　　孟川:@古一，大师你应该是最能理解这一切的。 \n  \n 　　圆大古：我是电视剧里的人？和那个迪迦一模一样？ \n  \n 　　古一：我明白你的意思，我在遨游时间线的时候，也曾见过类似的情况。 \n  \n 　　孟川:各位不用多想，你们并不是被人虚构出来的人物，那些小说，作品只是碰巧记录了你们的世界，你和你们的世界，都是真实的存在。 \n  \n 　　孟川:我在我原来的世界已经死亡了，可是因为不知道的原因，又在这个世界活了过来，这个世界在我前世被一本叫遮天的小说记录过，可是这七百年来，我肯定现在的世界是真实存在的，所以各位不用为自身而担忧。 \n  \n 　　孟川并没有把事情藏着掖着，而是直接开诚布公的告诉大家，到了他这一步，已经不屑于用些小手段了。 \n  \n 　　孟奇:原来大家都是被作品记录过的人物啊！ \n  \n 　　孟奇:@孟川，大帝那我呢，我是不是也是这样的情况啊！ \n  \n 　　孟川:没错，我也看过关于你所在的世界的小说，你是主角。 \n  \n 　　孟奇:太好了！看来注定要我横行武林，风月同行了！ \n  \n 　　风月你的头！ \n  \n 　　孟川无语，真是乐观的小光头。 \n  \n 　　孟川:大家应该有很多问题，我们可以开诚布公的聊一聊，相信能解决大家的很多疑惑。 \n  \n 　　张三丰:道友请讲。 \n ", "timestamp": 1657888335, "digest": "Y0LvbQcvjDtNDOFstuaHr_ZweN8ZahehpeSzuupBvMY", "contributor": "0x85eAe3Eed672B4c5fB10eCeDb1cb45972f076159"}
{"id": "-ln9Vv3nHhmwkVxpdGUNWfb2CkIJbHbOdhQQfYPLOoQ", "title": "币安注册登陆-币安注册流程", "body": "1、先在网页端注册好账号。（下面这个是我的邀请链接哈）\n\n[https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW](https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW)\n\n2、全程开着梯子，IP选台湾的，不要选新加坡，美国，香港。\n\n![](https://images.mirror-media.xyz/publication-images/jGmETfkYE8DSijTD5y_Hz.png?height=1080&width=2606)\n\n3、选择用邮箱注册，用海外邮箱gmail或者是outlook注册，国内邮箱使用qq邮箱或者163邮箱。\n\n![](https://images.mirror-media.xyz/publication-images/xdn0lLLC1H1mjt6aVNRGN.png?height=668&width=874)\n\n![](https://images.mirror-media.xyz/publication-images/tibqPjZ_yWF8BKkhgHQyQ.png?height=1242&width=1144)\n\n4、创建账户时居住地选择台湾，认证时国籍选中国。\n\n把我们刚注册好的邮箱填在这里 在填写一下密码 大家注意这里的推荐人id 我们填写我这个 输入推荐码能让你获取20%的交易手续费优惠 不填是没有优惠的，然后我们点选同意接受来自币安的电子邮件 注册  他会发一个六位数的验证码到我们的邮箱 我们去查找一下填在这里\n\n![](https://images.mirror-media.xyz/publication-images/ChglT2RE6ii6KILhU4zmc.png?height=840&width=1538)\n\n![](https://images.mirror-media.xyz/publication-images/JvvMy6_5c2ylNLly7cWFm.png?height=1146&width=2444)\n\nok现在币安账户就注册成功了  大家去进行身份验证 就在可以在币安进行交易了  还没有注册币安账户的中国大陆朋友  快根据我得方法去注册一个吧", "timestamp": 1657888423, "digest": "5VWDDa_lE9m2CDzcjdHZb-3bCrH88MNPYaYH6ZyWdnE", "contributor": "0xeE0974e1f9C1826c4B9389b4f532c1de5bb9F41E"}
{"id": "lsquRHzDYwjNMD9KIcXJxwhJ0dG_QMENpCUuV__84b4", "title": "小小元始，速来迎接", "body": "“张三丰世界的武学，主要就是练气，这股气在那里被成为内力，真气。” \n  \n 　　孟川眼中不停的闪过神光，他已经在推演后面的武功了。 \n  \n 　　“或许可以一直熬练真气，真气再反哺肉身，最终或许可以练成先天之气，由后天及先天！也可以凝真气金丹……” \n  \n 　　想到这里，孟川摇了摇头，一切都是猜想而已。 \n  \n 　　这个世界的武学，对他来说，意义太小，太过基础了，哪怕他推演出来后面的具体修炼，可对他现在这个级别，毫无帮助。 \n  \n 　　“罗汉拳……” \n  \n 　　又看向另外一本武学，个中奥妙，孟川一眼就能看穿。 \n  \n 　　“可惜现在得不到什么高深的经典，一世之尊世界的那些法门，真是让人眼馋。” \n  \n 　　一想到那些直指传说造化，乃至彼岸的绝世神功，孟川就心痒痒，在他的估计中，彼岸哪怕放在自己所在的世界，也绝对是仙帝一级的人物，甚至在仙帝之中也不是弱者！ \n  \n 　　直指彼岸，不就是直指仙帝！ \n  \n 　　“一世之法，先是百日筑基。”孟川看着罗汉拳，直接动手优化了一下，然后在心间构想出一个小人，开始演法。 \n  \n 　　“百日筑基之后，便是禅定蓄气，这只是个积蓄真气的过程，倒是和张三丰他们世界的武学心法颇为相似。” \n  \n 　　“前面两个境界的战力，实在太低，若是与遮天对比一下，顶天就在苦海了。” \n  \n 　　不过一想到这一修炼体系前期江湖味满满，后期直接爆炸式的变强，孟川就不由咋舌。 \n  \n 　　看着心间小人快速的走过蓄气期，然后便按照孟川推演的打通天生九窍。 \n  \n 　　“九窍之后就就要调整自身与外天地，内天地和外天地，有些类似于人身小宇宙和外界大宇宙。” \n  \n 　　孟川毁去了心间小人，他只推演到九窍这一地步，后面的外景还好说，到了法身，就不是那么简单的了。 \n  \n 　　反正不久后孟奇别说外景，法神了，直指彼岸的神功都能弄到，聊天群如果按照现在的气氛走下去的，分享一下功法应该不是问题。 \n  \n 　　“对我来说，这次收货最大的，还是孟奇记忆副本中所见到那些强者啊……” \n ", "timestamp": 1657888481, "digest": "YwPCtj3NBcZ-Iu9fLmXAOu3gCzgrP1t1Eeg2EGovhG8", "contributor": "0xe258d103D6e0F67Cf36d99904DBB4f11D3DEd87A"}
{"id": "mj1njF6e0bfSfJ0T1Na97Tcb8OmOVwoG-psrxs0x3IM", "title": "这波不是开挂？", "body": "孟川的故事很简单，没有无敌，结局的平平淡淡。 \n  \n 　　副本里面的孟川，出身和现在的孟川一模一样，都是开局一方小势力，修炼的是东荒人手一本的道经轮海篇残卷。 \n  \n 　　值得一提的是，孟川是先天道胎，两个孟川都是。 \n  \n 　　不过孟川穿越过来后，天资悟性不知道为什么，得到了史诗级的强化。 \n  \n 　　在孟川即将去往圣地修炼的时候，孟川穿越了过来，转折就是发生在了这里。 \n  \n 　　副本里的孟川进入圣地后，展露锋芒，逐渐成为了圣地的最强年轻高手，在整个北斗年轻一代，都是搅动风云的人物，和各种王体血战后，孟川都是胜者，然后原孟川踏上了星空古路。 \n  \n 　　上百载的征战，孟川在古路上也颇有名气。 \n  \n 　　时间推移，帝路之争越发残酷，整个宇宙的天骄的骨和血都铺满了各族古路，。 \n  \n 　　等到诸多天骄纷纷踏入准帝境的时候，所有人都以为此世将会诞生一尊帝。然而，可悲的一幕出现了。 \n  \n 　　黑暗动乱！ \n  \n 　　毫无征兆的，黑暗动乱爆发了，禁区至尊出世，收割人世大药。 \n  \n 　　此世无帝，诸多天骄也不过刚刚踏入准帝，怎么可能是至尊的对手。 \n  \n 　　整个宇宙哀鸿遍野，血流成河，无数星空都被染成了血色。 \n  \n 　　黑暗动乱结束了，不过是禁区至尊主动的停下来的，绝大部分准帝，以及圣境的天骄强者都被至尊当做了血食。 \n  \n 　　很不幸的，原孟川就是其中之一，他也想守护古星上的生命，却连至尊一指都没有接下。 \n  \n 　　故事到这里结束了，可以看出来这本书的作者想写的就是宇宙在黑暗动乱下的百态。 \n  \n 　　众人在看完孟川的命运副本之后。 \n  \n 　　张三丰：哪怕亲眼所见，都不敢相信竟然还有以众生为食之人。 \n  \n 　　圆大古：这个世界，真的太悲惨了。 \n  \n 　　古一：幸好大帝穿越过来，一切都改变了。 \n  \n 　　孟奇：大帝你死的好惨啊！被人家一根指头就戳死了！ \n  \n 　　孟川：…… \n ", "timestamp": 1657888245, "digest": "-tQsAZMghVMF10QfWWr66avjAai4v9qii_silq5KijM", "contributor": "0xFAc7713A83C0EbFEfc983096E5222d2F028f2A58"}
{"id": "OgeDVLR8e8UzrI7STtgUgGmDRGZsxtz0YA9EX-d_75M", "title": " 人均大帝", "body": "　孟川在闭关这三百年当中，在聊天群是处于断开连接的状态，对于聊天群中唯有一个没有下线过的古一来说，只不过过去了一个月才。 \n  \n 　　这个时间流速相当混乱，和世界等级毫无关系，有时张三丰刚下线一天，孟奇那边就已经过了五天，有时又是反过来的情况。 \n  \n 　　让人摸不着头脑。 \n  \n 　　群时间过了一个月，仅剩的四名管理员也水了一个月的群，连大龄老人都已经熟练的运用着表情包了。 \n  \n 　　若是让不知情的人和张三丰聊天，绝对想不到这是一个已经近百岁的古人。 \n  \n 　　张三丰：大帝威严.JPG \n  \n 　　古一：大帝威严.JPG \n  \n 　　圆大古：大帝威严.JPG \n  \n 　　孟川看着这张表情包，哈哈大笑，还他么把他在记忆碎片里的表情给截了下来。 \n  \n 　　孟川：好活，当赏！ \n  \n 　　系统提示：群管理孟川上传了群红包——者字秘。 \n  \n 　　圆大古：这就是小孟给我们说的九秘吗？者字秘好像是修炼成了生命力很强对吧？ \n  \n 　　在大古发言的时候，张三丰和古一直接就第一时间领取了红包。 \n  \n 　　张三丰：大帝大气，可惜老道身无长物，只能白嫖了！ \n  \n 　　古一：说起来，我倒是给大帝准备了一些礼物。 \n  \n 　　孟川看着古一的话，心中一动，漫威世界还是有些好东西的啊，不知道什么时候能提供穿越世界的服务。 \n  \n 　　系统提示：管理员古一上传了群红包——纬度魔神之尸x4", "timestamp": 1657888576, "digest": "XVJC_OFtmz4__dimksOcPoR05ZSSrkesH2-3aYyCrds", "contributor": "0x7A11792Be351fb80e6B0d580268134F5185727dA"}
{"id": "PHIP2A_MWFSdhTniK-KExyGNB_e_w1yj2sV5SOL9FiU", "title": "长恨歌", "body": "汉皇重色思倾国，御宇多年求不得。 杨家有女初长成，养在深闺人未识。 天生丽质难自弃，一朝选在君王侧。 回眸一笑百媚生，六宫粉黛无颜色。 春寒赐浴华清池，温泉水滑洗凝脂。 侍儿扶起娇无力，始是新承恩泽时。 云鬓花颜金步摇，芙蓉帐暖度春宵。 春宵苦短日高起，从此君王不早朝。 承欢侍宴无闲暇，春从春游夜专夜。 后宫佳丽三千人，三千宠爱在一身。 金屋妆成娇侍夜，玉楼宴罢醉和春。 姊妹弟兄皆列土，可怜光采生门户。 遂令天下父母心，不重生男重生女。 骊宫高处入青云，仙乐风飘处处闻。 缓歌慢舞凝丝竹，尽日君王看不足。 渔阳鼙鼓动地来，惊破霓裳羽衣曲。 九重城阙烟尘生，千乘万骑西南行。 翠华摇摇行复止，西出都门百余里。 六军不发无奈何，宛转蛾眉马前死。 花钿委地无人收，翠翅金雀玉搔头。 君王掩面救不得，回看血泪相和流。 黄埃散漫风萧索，云栈萦纡登剑阁。 峨嵋山下少人行，旌旗无光日色薄。 蜀江水碧蜀山青，圣主朝朝暮暮情。 行宫见月伤心色，夜雨闻铃肠断声。 天旋地转回龙驭，到此踌躇不能去。 马嵬坡下泥土中，不见玉颜空死处。 君臣相顾尽沾衣，东望都门信马归。 归来池苑皆依旧，太液芙蓉未央柳。 芙蓉如面柳如眉，对此如何不泪垂。 春风桃李花开夜，秋雨梧桐叶落时。 西宫南苑多秋草，落叶满阶红不扫。 梨园弟子白发新，椒房阿监青娥老。 夕殿萤飞思悄然，孤灯挑尽未成眠。 迟迟钟鼓初长夜，耿耿星河欲曙天。 鸳鸯瓦冷霜华重，翡翠衾寒谁与共。 悠悠生死别经年，魂魄不曾来入梦。 临邛道士鸿都客，能以精诚致魂魄。 为感君王辗转思，遂教方士殷勤觅。 排空驭气奔如电，升天入地求之遍。 上穷碧落下黄泉，两处茫茫皆不见。 忽闻海上有仙山，山在虚无缥缈间。 楼阁玲珑五云起，其中绰约多仙子。 中有一人字太真，雪肤花貌参差是。 金阙西厢叩玉扃，转教小玉报双成。 闻道汉家天子使，九华帐里梦魂惊。 揽衣推枕起徘徊，珠箔银屏迤逦开。 云髻半偏新睡觉，花冠不整下堂来。 风吹仙袂飘飖举，犹似霓裳羽衣舞。 玉容寂寞泪阑干，梨花一枝春带雨。 含情凝睇谢君王，一别音容两渺茫。 昭阳殿里恩爱绝，蓬莱宫中日月长。 回头下望人寰处，不见长安见尘雾。 惟将旧物表深情，钿合金钗寄将去。 钗留一股合一扇，钗擘黄金合分钿。 但教心似金钿坚，天上人间会相见。 临别殷勤重寄词，词中有誓两心知。 七月七日长生殿，夜半无人私语时。 在天愿作比翼鸟，在地愿为连理枝。 天长地久有时尽，此恨绵绵无绝期。", "timestamp": 1657888424, "digest": "ao7Mjijvn_Q4X1u1WjgscZa1dq-rtUm3A0D7l3Rx3fs", "contributor": "0x79e68338Ddf980939995ec5b30Ab53465E041fa1"}
{"id": "QGfUcKqsQzq_LOIHdyPz5aUDOTYW7bu0zR90LQtBxUk", "title": "白嫖饶过谁", "body": "孟川刚离开瑶池不久就看到孟奇在群里大呼小叫的。 \n  \n 　　孟川：我的快递怎么了？ \n  \n 　　孟奇：你的快递员要凉了。 \n  \n 　　孟川：喔 \n  \n 　　孟川：那我的快递呢？ \n  \n 　　孟奇：？？？ \n  \n 　　孟奇：人也？ \n  \n 　　圆大古：新的风暴已经出现。 \n  \n 　　孟奇：大古你还学会自己的主题曲了？ \n  \n 　　孟川：好活，当赏！ \n  \n 　　系统提示：管理员孟奇上架了《八九玄功》筑基篇、蓄气篇、开窍篇、外景篇 \n  \n 　　系统提示：管理员孟奇上架了《浑天宝鉴》筑基篇…… \n  \n 　　孟川：拿我的快递打赏唱歌主播，还要主播付费才能领取？ \n  \n 　　孟川：好一手空手套迪迦 \n  \n 　　张三丰：大帝蔑视.JPG \n  \n 　　古一：大帝蔑视.JPG \n  \n 　　系统提示：孟川购买了《八九玄功》前四篇 \n  \n 　　系统提示：孟川购买了…… \n  \n 　　孟川：真人五百年不见，真是老当益壮啊 \n  \n 　　孟川：大师看着也是愈发亮人了，妙极，妙极 \n  \n 　　卡玛泰姬，古一面前泡着一杯清茶，正在给莫度回答问题，看见孟川的话，脸抽动了一下。 \n  \n 　　“莫度。”古一叫道。 \n  \n 　　“怎么了，大师？”莫度有些疑惑，好好的讲着魔法，怎么突然叫自己？ \n  \n 　　“我亮吗？” \n  \n 　　莫度：？？？ \n  \n 　　“大师，挺亮的……”莫度看了看大古一的头，又摸了一下自己的头，最终还是诚实的说道。 \n  \n 　　张三丰：大帝那边已经过去五百年了吗？恐怖如斯！ \n  \n 　　圆大古：恐怖如斯！ \n  \n 　　古一：恐怖如斯！ \n  \n 　　孟奇：五百年我都脚踢阿弥陀，拳打金母了 \n  \n 　　系统提示：管理员孟川禁言了管理员孟奇 \n  \n 　　系统提示：管理员张三丰禁言了管理员孟奇 \n  \n 　　系统提示：管理员古一禁言了…… \n  \n 　　圆大古：小孟刚才不是说需要帮助吗？把他禁言了是不是不太好？ \n  \n 　　孟川：没事，他大概率是被抓去说偷练绝学了，最多就挨两刀，小问题。 \n  \n 　　圆大古：喔 \n  \n 　　系统提示：管理员圆大古禁言了管理员孟奇 \n  \n 　　大古开心的笑了起来，惹得他对面的丽娜瞅了他好几眼。 \n  \n 　　“大古最近总是莫名其妙的就笑了起来，是不是病了……”丽娜有些担心 \n  \n 　　孟川：没想到你是这样的大古！ \n  \n 　　张三丰：大古没想到你是这样的！ \n  \n 　　古一：大古你是这样的没想到！ \n  \n 　　各个管理员世界的时间并不统一，五个人当中也就古一基本保持在线，孟川又是常年闭关。 \n  \n 　　接下来又聊了一会，不过孟川基本都是在水，听着另外四人分享自己的经历，在知晓剧情的情况下，又是如何改变剧情的。", "timestamp": 1657888734, "digest": "f-yYRULsfiUBkAVFe-ZQ6OllCblUjR_vpFmd-mO2k1Y", "contributor": "0x9d66D06ea752c0C9de5084371D9315f1e25CBFDe"}
{"id": "znyQ4hbjxgY0XUwUZBDwZgC223hcsurAYnbAuG3Xd2s", "title": "s", "body": "Look，Ihaveaniceroom。Comeandhavealook。Itssmallandnice。Thereisabigbed，asmalldesk，ashelfandacloset。Thebedisnearthedesk。Thereisashelfneartheclosettoo。Manygoodbooksareintheshelf。Ilikethebooksverymuch。Oh，yes，Thereisabigboardonthewall。Ioftenwriteanddrawpicturesontheboard。Oh，Mybedroomistoobeautiful。Ilikeitverymuch。Doyoulikemybedroom?Canyoutellmeaboutyourberoom，please看，我有一个舒适的房间，过来看一看，它小而漂亮，那有一张大床，一张小桌，一个书架和衣柜，床在桌子旁边，书架也在衣柜旁边，很多好的", "timestamp": 1657888923, "digest": "ywF_YYYHjtLbYpO6Zj3mYyeEphSyc3I9Q8VkpgXKL1o", "contributor": "0xDA120679F4b1522267D395Aa66C745fb732C6E8e"}
{"id": "10BCOHJXyhyhJPhmSMhVaicUJPQTU4X0q_Qfogwif8E", "title": "君王", "body": "　除了新进群了五个新人，聊天群还新开启了三个功能，分别是群直播，这个已经被孟川提前开启了，还有群聚会，群任务。 \n  \n 　　孟川他们体验了一下群聚会这个功能，发现是每个人都会生成一道投影，可以在聊天群提供的空间里见面，算是从线上发展到了线下。 \n  \n 　　然后几位新的老的群友第一次集体见面了，仙风道骨的张三丰，笑嘻嘻看上去很惹人喜欢的小光头孟奇，帅气和善的大古，还有永远都给人一种淡然感觉的古一。 \n  \n 　　英武不凡的飞蓬，豪迈的燕赤霞，普普通通的路明非，潇洒出尘的药尘，还有整个群最靓的女孩，比比东，这个年纪的比比东，真的很美。 \n  \n 　　以及最后，群里最靓的仔，孟川！ \n  \n 　　这次聚会大家气氛很好，无论是新群员还是老群员，每个人都有话说，毕竟这里的人，某种程度上可以说是一类人。 \n  \n 　　不过有些尴尬的是，比比东老是缠着大古问，他是怎么从那么小的一个，变成那么大的一只的…… \n  \n 　　另外一个群任务，现在只有一个引导，不过已经完成了，这个任务很简单，只要给每个群员看看命运副本，增加一下对聊天群的认同感就算完成了。 \n  \n 　　至于奖励，孟川的奖励是自己的聊天群权限又增加了一点。 \n  \n 　　九个人在群里灌了一会水，就陆陆续续下线了，除了永不下线的古一…… \n  \n 　　孟川看着自己眼前这滴血，心中早有了方案。 \n  \n 　　神念探入这滴血中，直接从浅到深进行分析。 \n  \n 　　“路明非的血统果然很特殊，里面有种对龙族世界来说，极为强大的规则蕴藏在里面，纯粹至极的黑色规则之力。”孟川若有所思，除了那道规则，还有一种强大的生机，很像植物的生机，非常旺盛，可惜这两种力量都被封印了。 \n  \n 　　“血液中还有一些会诱发人狂暴好战心理的的因子，这些可以剔除了。” \n  \n 　　“唔，还有另外一道规则，不过这道规则倒是没有被封印，这道规则看样子是专门用来撬动外界自然力量好像？言灵吗？不过没有被封印的那道强大，同时和外界沟通的渠道也被截断了。” \n  \n 　　如果能去到路明非的世界，孟川从这滴血里一眼就能看出全部。 \n  \n 　　“这样的话，我大概知道具体该怎么做了。”孟川起身，离开自己的帝宫，一步之下，跨越星海，来到了永恒星域。 \n  \n 　　永恒星域可以说是遮天世界里比较另类的的地方，这里走的是修炼科技的道路，不过对于大帝来说，都是殊途同归罢了。 \n  \n 　　孟川直接就借用了永恒星域最好的设备，材料这些东西，孟川自己就有。 \n  \n 　　几天的时间，孟川就彻底改造完成了这滴血液，不良因子全部被剔除，属于言灵的那道规则之力与外界沟通的通道被孟川打通了。 \n  \n 　　那两道被封印的力量也被孟川解开了封印，最重要的还有，孟川直接给这滴血植入了一团能量源，等到路明非重新融合这滴血后，龙族该有的能力他都会有，并且还会得到源源不断的强化！ \n  \n 　　这些东西，孟川不用仪器也能做到，可是，搞实验，就要有搞实验的仪式感嘛！ \n  \n 　　“完美，这下我们的衰仔可是究极进化了！”孟川满意的看着自己的成果，果然，自己是被大帝路耽误的科学家！ \n  \n 　　打开聊天面板，看着活跃的宝藏群友，孟川笑了笑，好几天没有好好的水群了！ \n  \n 　　孟川：@路明非，你外挂到了！", "timestamp": 1657889006, "digest": "jCMfqa2aMO9Gm5UZJEBzGM_9IKo44_q31z8b9zevZpw", "contributor": "0xA1dC3F0E95437f80D458531883859a2aB12b4E0A"}
{"id": "iASI534fdVwq2AYHoImpHndE7p10zqaqFweQ7gt5K-Y", "title": "Bundlr Validator Node", "body": "![](https://images.mirror-media.xyz/publication-images/Zf5fCBQTE-Q9IPBGG9c8X.png?height=334&width=1153)\n\nBundlr makes web3 data storage on Arweave accessible on multiple networks and currently accounts for over 90% of data uploaded to Arweave.\n\nBundlr is a Proof-of-Stake network that sits on top of Arweave. Approximately every 30 minutes, 10 validators are randomly chosen to run the network. Nodes (known as bundlers) are used to bundle multiple layer 2 transactions into a single Arweave (layer 1) transaction.\n\n# RUN A BUNDLR VALIDATOR ON TESTNET- JULY 2022\n\n[Bundlr Testnet](https://medium.com/bundlr-network/bundlr-launches-its-first-testnet-4bedd76e7c) is now live. You must use a domain or static IP, dynamic IPs will cause your validator to become undiscoverable. This guide is assuming a fresh install of Ubuntu 20.04 LTS. \n\nHardware Specs:\n\n* Memory: 8 GB RAM\n* CPU: Quad-Core\n* Disk: 250 GB SSD Storage\n* Bandwidth: 1 Gbps for Download/100 Mbps for Upload\n\n## 1. Install Pre-requisite Software\n\nUpdate and install the following packages which are required to continue\n\n```\nsudo apt update && sudo apt upgrade -y\n```\n\n```\nsudo apt install curl ncdu htop git wget build-essential libssl-dev gcc make libssl-dev pkg-config npm -y\n```\n\n### Install Docker\n\n```\ncurl -fsSL https://get.docker.com -o get-docker.sh\nsh get-docker.sh\n```\n\nGrant Permissions for docker and confirm it is installed\n\n```\nsudo usermod -aG docker $USER\ndocker --version\n```\n\n### Install Docker Compose\n\ndocker-compose is a way of saving the docker run command in a file, so that you can just start/stop/modify it easily. Going to be using this for this guide.\n\n```\nsudo apt install docker-compose -y\ndocker-compose --version\n```\n\n### Install Rust\n\nInstall Rust, the following installs cargo a package manager for Rust and rustc the compiler for Rust.\n\n```\ncurl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh\n```\n\n![run what your terminal tells you when it completes](https://images.mirror-media.xyz/publication-images/NYfSIdE5gQIYrSW5aqPRV.png?height=472&width=1264)\n\nrestart your terminal/ current shell and confirm its installed successfully by running the following commands\n\n![](https://images.mirror-media.xyz/publication-images/5JqQeHxTVnCyt96W4eOUT.PNG?height=340&width=1345)\n\n### Upgrade nodejs to v16.16\n\nwe need the latest version to run properly, I got a lot of errors with an older version installed, check current version with\n\n```\nnode -v\n```\n\nClear NPM's cache, Use n to install latest stable version\n\n```\nsudo npm cache clean -f\nsudo npm install -g n\nsudo n stable\n```\n\n![check node version again, if not correct try restart the shell](https://images.mirror-media.xyz/publication-images/K-57VVU4VQWgtJ52aS21u.png?height=297&width=1336)\n\n## 2. Download Repository and Set-up\n\n### Clone the validator repository\n\n```\ngit clone --recurse-submodules https://github.com/Bundlr-Network/validator-rust.git\n```\n\n### Create Arweave Wallet\n\nYou can generate a new one [here](https://arweave.app/), ensure you save the Seed and json file, Now create a file to save your Arweave wallet in the project root at `./wallet.json`.\n\n```\nsudo nano ./wallet.json\n```\n\nopen your .json file you created from the arweave wallet using notepad, copy the entire contents to the terminal, save/write out with ‘ctrl+O’ then exit with ‘ctrl+X’\n\nconfirm its there, you should see your wallet.json\n\n```\nls -la\n```\n\n**Copy Wallet to /validator-rust/ directory also**\n\n```\nsudo cp ./wallet.json /home/ubuntu/validator-rust\n```\n\nmake sure its the correct location (might be different from /home/ubuntu/, you can use ‘ls -la’ to find and also confirm its there once done.\n\n### Environment Variables\n\nchange directory\n\n```\ncd validator-rust\n```\n\nyou should have a example.env file in your /validator-rust/ copy the example.env file\n\n```\nsudo cp example.env .env\n```\n\nopen the file to edit\n\n```\nsudo nano .env\n```\n\nReplace the contents of the Example file in the terminal with the following\n\n```\nPORT=80\nVALIDATOR_KEY=./wallet.json\nGW_WALLET=./wallet.json\nBUNDLER_URL=\"https://testnet1.bundlr.network/\"\nGW_CONTRACT=\"RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKA\"\nGW_ARWEAVE=\"https://arweave.testnet1.bundlr.network/\"\n```\n\nThis is from the [docs](https://docs.bundlr.network/docs/participate/Types%20of%20Nodes/Validator/validator-join#environment-variables), Database_URL can be ignored, the 1st validator Contract for this Testnet is the following:RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKAbe sure to check the pinned messages on Discord, for any updates on this\n\n![](https://images.mirror-media.xyz/publication-images/4llzLBxvPhq4csJLPyLXH.png?height=294&width=1004)\n\n## 3. Build and Run the Validator \n\nchange to the correct directory\n\n```\ncd /home/ubuntu/validator-rust\n```\n\nonce in the Directory run to start docker file, -d to detach and run in the background\n\n```\ndocker-compose up -d\n```\n\nthis should start 3 docker containers, if successful we can confirm by running, which shows all running containers\n\n```\ndocker ps -a\n```\n\n![Check the Logs of all three, to confirm no errors](https://images.mirror-media.xyz/publication-images/TIbDt1Vl1Y7KmFsC5XJWH.png?height=84&width=1000)\n\n```\ndocker logs -f <container-name>\n```\n\nif you need to go back to make any changes such as checking your .env file or wallet.json file is correct (usually to culprit of errors) you need to stop and remove all three running containers\n\n```\ndocker stop <container-name> && docker rm <container-name>\n```\n\nNow we should have the validator running in the background, we can move on the registering and staking the validator \n\n## 4. Register Validator and Stake\n\n### Install Testnet CLI\n\n```\nsudo npm i -g @bundlr-network/testnet-cli\n```\n\n### Claim Tokens from the Faucet\n\nYou can claim Testnet tokens [here](https://bundlr.network/faucet), you will need a valid twitter account and the Arweave wallet address created earlier.\n\n**check balance**\n\n```\nnpx @bundlr-network/testnet-cli balance <YOUR-WALLET-ADDRESS>\n```\n\n![should see something like this, press y to confirm, it may take a while to output your token balance](https://images.mirror-media.xyz/publication-images/H0nM-5DuaM6OtzTXaElqG.png?height=78&width=859)\n\n### Register Validator and Stake\n\nto join the Testnet run the following \n\n```\n@bundlr-network/testnet-cli join <validator-contract> -w <path-to-wallet> -u <validator-url> -s <stake-tokens>\n```\n\n1st validator Contract (in pinned messages on discord): RkinCLBlY4L5GZFv8gCFcrygTyd5Xm91CzKlR6qxhKA \n  \n Path to wallet: ./wallet.json\n\nValidator URL: http://<your-static-IP-address>:80\n\nStake Tokens (amount claimed from Faucet): 25000000000000\n\nWhen successful it should say ‘done’ and this can take up to 20-30mins.", "timestamp": 1657888958, "digest": "t4QE2axpPLLyxHOTK0IrRjkNwePXHWUGLgRhZSChStY", "contributor": "0xf3bF9DDbA413825E5DdF92D15b09C2AbD8d190dd"}
{"id": "qe7Eq2zncbbr4MS8nDT-3QukRf5MDnT8j_1sZXIzsfc", "title": "friend", "body": "MyBestFriendMybestfriendis。He39;saveryfunnyperson。Forexample，hekeepshiswatchonehouraheadoftherealtime。Hesaysit39;sbecausehedoesn39;twanttobelate。isalsoveryhonestandintelligent。Hedoesn39;tneedtocheattogetahead。Inschoolhealwaysgetsthehighestscores，butheneverseemstostudy。Hesayshestudiesonlywhennobodyislooking。Everybodylikesmyfriendverymuch。 \n ", "timestamp": 1657889086, "digest": "8lYzJHKzqT0OjHSbeYCcekKqdcd-AqMDohn7KNTWm8U", "contributor": "0x046BF772FD777e30a257f086895bf289d0c61770"}
{"id": "zTuH_nbDgHFU0_bUsKTsMxGlq8HnRm67_K_UOPhqGx4", "title": "下个“拖累”加密市场的，会是Coinbase吗？", "body": "2021 年 4 月，加密货币交易所 Coinbase Global 顺利在纳斯达克上市，不久后，公司估值就飙升至 1000 亿美元区间，用 FundStrat Global Advisors 分析师 Leeor Shimron 的话说，“Coinbase 上市是开创性的，甚至可以算是加密行业的一个分水岭”。\n\nCoinbase 一直是全球加密实体的“风向标”，也得到了知名在风险投资公司 Andreessen Horowitz（a16z ）的大力支持，目前 a16z 持有 Coinbase 公司约 25% 的 A 类股份和 14% 的 B 类股份。\n\n然而在过去的 6 个月中，Coinbase 股价如自由落体般下坠，从 2021 年 11 月的 381 美元重挫至 2022 年 7 月 5 日的 48 美元，市值更是暴跌到 100 亿美元区间。目前，高盛（Goldman Sachs）已将该公司的评级从“中性”下调至“卖出”，并将其目标价从70美元下调至45美元。\n\n回顾过去半年Coinbase的业务运营情况不难发现，其在2022年第一季度的总交易量为3090亿美元，与2021年第四季度的5470亿美元相比下滑幅度达到惊人的44%；不仅如此，其零售交易量也下降了50%以上。与之相比，另外两家交易所FTX 和Binance的表现则要好得多。\n\n对于近期Coinbase股价的持续暴跌，一位前Coinbase员工认为非同寻常，因为通常当加密货币价格下跌时，交易所的交易量往往会大幅上升，而Coinbase在最近几个季度的表现却违背了这个规律。究其原因，恐怕不仅仅是受加密寒冬影响这么简单。\n\n作为一个在纳斯达克上市的加密货币交易所，Coinbase竟然在半年多的时间下跌了近10倍，这不仅引发了市场恐慌，也在世界各地引发了对于一些关键问题的思考：\n\n1、这次缩水会对全球的加密市场产生什么影响？\n\n2、对于未受监管的加密实体来说，选择IPO是一个正确的方向吗？\n\n### Coinbase 在股市的萎靡表现可能导致加密公司不再尝试 IPO 上市\n\n7 月 15 日，瑞穗（Mizuho）股票分析师 Dan Dolev 在提供给客户的一份报告中表示，预计 Coinbase 7 月份的交易量约为 12 亿美元，较 2021 年 11 月近 70 亿美元的高点下降了近 83%，其市场份额已从第一季度的 5.3% 跌至 2.9%。Dan Dolev 表示，Coinbase 7 月份的平均交易量排名第 14 位，而去年 11 月的排名为第 4 位。Dan Dolev 对 Coinbase 股票给出的评级为中性，目标价从 45 美元下调至 42 美元。\n\n实际上，Coinbase在去年本可以选择ICO（Initial Coin Offering，首次币发行），估值同样是1000亿美元，不过该公司希望能从机构投资者那里筹集资金，因此最终还是选择了IPO。然而，许多加密公司清楚，一旦选择了公开上市就必须要以结构化的方式进行运作，而且还意味着公司运作的透明度将会变大、需要得到更大的信任。\n\n另一方面，Coinbase在近期市场上如自由落体般的下跌走势，让原本想投资加密公司的人们都望而却步了。雪上加霜的是，美国证券交易委员会还不允许Coinbase发行其已经运行了几个月的多种产品。综合以上诸多原因，加密公司要想在如今的大环境下进行IPO的可能性几乎微乎其微，至少在一年内是这样的。\n\n### Coinbase 裁员在加密行业引发涟漪效应\n\n受运营情况不佳以及全球加密市场“熊市”影响，Coinbase率先做出了放缓全球招聘步伐的决定。据公司总裁兼首席运营官Emilie Choi介绍，原本今年计划将员工总数增加两倍，但考虑到目前的市场情况，公司认为放慢招聘步伐并根据公司最优先的业务目标重新评估人员需求是谨慎之举，所以该目标已被搁置。不仅如此，该公司还对海外的一些团队进行了精简，并将一些海外业务负责人召回了美国办事处。\n\n而作为加密领域雇员需求量最大的公司之一，Coinbase暂缓招聘的举措被许多同行效仿，那些加密公司也以即将到来的加密寒冬为由暂停了招聘计划。\n\n值得一提的是，Coinbase 不仅暂停了招聘计划，还放慢了海外投资速度。事实上，Coinbase一直专注于投资加密货币生态系统的各个领域，尤其是投资一些与其产品竞争的海外初创公司，期待共赢结果。在熊市之前，Coinbase 的投资力度非常大，以印度市场为例，Coinbase 在印度向十几家公司投资了 1.5 亿美元，包括 ZebPay、CoinDCX、CoinSwitch Kuber、Vauld 等，还收购了 Agara。不过由于Coinbase通常情况下参与的是种子轮融资，且不作为领投方，投资规模一般从10万美元到100万美元不等，因此对于海外加密生态系统的影响倒也不是很严重。\n\n最后一方面，由于涉及到行业规范问题以及受到海外监管机构的施压，Coinbase在一些国家的UPI支付业务被叫停了，这也打乱了他们拓展海外市场的计划。因此，如何在受监管的环境中正常运营对于许多加密公司来说仍然是门学问，此外关注客户数据、客户情绪和客户体验也是至关重要的，只有这样才会得到投资者和用户的信任。\n\n### 龙头公司萎靡，加密寒冬会再延续至少 12 个月吗？\n\n尽管行业萎靡，但比特币算力并未出现大幅走低，每个区块每秒的交易数量也维持在高位，比特币地址总数也突破 10 亿个关口，然而在价格层面上，比特币、以太坊和其他加密货币的表现却不太尽如人意，下跌趋势更是持续了长达近 9 个月的时间，不少业内人士认为，本次可能是自 2018 年以来最长的加密货币寒冬。\n\nTom Loverro 曾在 Coinbase 董事会任职到 2021 年，他认为加密货币市场的走低态势会在整个 2022 年持续，然后在 2023 年回归到“基本持平”状态，而宏观市场的改善可能需要到 2023 年下半年才能初见端倪。\n\n坦率地说，2022 年的熊市和 2020 年 Covid-19 后的市场暴跌有很大不同，后者只是一次黑天鹅事件，而且投资者都看到市场反弹，而目前则是一场寒冬，主因极可能是美联储持续升息导致，这意味着在美元利率稳定之前，投资者可能会面临持续亏损。Tom Loverro 建议加密公司需要储备足够的现金来面对接下来 30-36 个月的市场低迷，“**更重要的是，要有足够的信心度过冬天，不要轻易动摇或放弃，一旦市场复苏，加密货币将比以往任何时候都更大。**”\n\n另一方面，Coinbase 其实已经为漫长的跑道做好准备，虽然解雇了不少员工，但这些离职人员都获得了丰厚的补偿。不仅如此，Coinbase 也“低调”启动国际市场拓展推动增长，并在意大利、西班牙、法国和荷兰进行注册。那么，其他加密公司能熬得过这次的加密寒冬吗？也许只有时间能给我们答案。", "timestamp": 1657888974, "digest": "y8kIsLBXC9hBgJZA9BQ_qPO6snN84DBhTbDFxB7lSJU", "contributor": "0x89ddad6277Deff03F2666B66cFe66abD48197867"}
{"id": "zV7-jO2nyJHUP4PzgfqCF_yEIp0845Qo-jFYocVZLqo", "title": "要起飞", "body": "“我没有，你听错了，别瞎说。”药尘直接否认。 \n  \n 　　“你明明说了。”萧炎又不是老年痴呆，怎么会听错。 \n  \n 　　“你先说了，然后我跟着你说的啊。”药尘摊了摊手，示意自己只是一个简单的跟风。 \n  \n 　　“你明明就说的那么熟练！”萧炎狐疑的说道，他觉得有些奇怪。 \n  \n 　　“年纪轻轻的就问东问西！老人家救了你你也不感谢一下？”药尘又敲了一下萧炎的头。 \n  \n 　　“你救了我？你为什么要救我，你不是鬼吗？”萧炎现在也反应过来了，刚才那种情况没有人救自己的话，自己已经变成一滩肉泥了。 \n  \n 　　药尘有些无力的说道：“我不是鬼，我是灵魂，这个世界一些人死后是会有灵魂留下的，除了没有肉身，和生前基本没有什么区别，和鬼完全不一样。” \n  \n 　　“你不早说！”萧炎一个鲤鱼打挺从地上跃起，不是鬼就好办！ \n  \n 　　“谢谢你啊老前辈！没有你救我，我估计又要死了。”萧炎真心的感谢眼前这位只剩灵魂的老人。 \n  \n 　　他今天失足坠崖，若是死了，估计明天乌坦城就会传出流言，萧家少爷接受不了退婚跳崖而死！ \n  \n 　　“没事，今天救你一命，就当报你供养我三年斗气之恩了。”药尘言语带着笑意，眼里促狭。 \n  \n 　　“供养三年斗气？” \n  \n 　　“三年？！！”萧炎愣了，然后提高声音，冲着药尘喊道。 \n  \n 　　“这三年我的斗之气莫名其妙消失是你搞的鬼？！！” \n  \n 　　“我艹我现在斗之气又少了，你都出来了还吸？！！”萧炎出离的愤怒，以前自己不知道你吸就算了，现在你都在我面前了，还敢吸？这是明抢！ \n  \n 　　“我也是被逼无奈，没有你的斗之气，我三年前就已经烟消云散了。”药尘有些不好意思，这事的确是他干的不厚道，不过随后又有些奇怪，自己都出戒指了，什么时候又吸他的斗气了？ \n  \n 　　“刚才他的斗气消失我是拿的，研究一下。” \n  \n 　　一段传音被传进药尘耳朵里，药尘知道了这是怎么回事，看着萧炎，有苦说不出。 \n  \n 　　总不可能说你戒指里还有一个人在躲着，他又开始抽你的斗气了吧？也没有这样欺负人的啊…… \n  \n 　　孟川分出一丝神念关注着药尘和萧炎，自己则是研究，剖析这这团异火，至于萧炎斗气的事，药尘吸了三年，和我道始有什么关系？自己拿的这一丝，要不是主动给萧炎感受到，他都不会察觉。 \n  \n 　　“不过，这不是火焰，这是天地法则和本源啊……”看着古灵冷火，孟川眼中有秩序神链交织着。 \n  \n 　　…… \n  \n 　　“我艹你还我斗之气！”萧炎愤怒了，直接扑向药尘，可惜直接扑了个空。 \n  \n 　　“小子，你救我一命，我又救你一命，这不是扯平了嘛！” \n  \n 　　“扯个蛋！你不吸我斗气我今天会在这里？我这三年会受这么多屈辱？我今天会给父亲丢进脸面？”萧炎怒道。 \n  \n 　　“我会补偿你的。”药尘没有像原著一样说什么吸你斗气也帮你成长这种鬼话，这和我害了你但我是为你好有什么区别？ \n  \n 　　萧炎看着自己没有办法对药尘做些什么，逐渐冷静了下来。 \n  \n 　　“你能补偿我什么！不需要！”萧炎硬气的说道。 \n  \n 　　一想到自己的斗之气消失不是因为天赋出了问题，自己的天赋还在，萧炎就有些安慰感。 \n  \n 　　“放心小子，以后我就不需要在吸收你的斗之气了，刚才是最后一次！”药尘主动背了这个锅。 \n  \n 　　“至于我能补偿你什么，让你成为斗帝算不算补偿？”药尘自信的说道。 \n  \n 　　实际上药尘和萧炎的关系真的很复杂，药尘是萧炎这三年受尽屈辱的罪魁祸首，更让萧炎三年止步不前。 \n  \n 　　可如果没有药尘，萧炎按自己本身的天赋一路走下去，不要说斗帝，成斗皇估计都是大叔了，更别提后面的斗宗，至于斗尊估计够呛。 \n  \n 　　药尘可以说是萧炎一生中最重要的人了，当然这是在修炼上，不过在生活上，也能说是萧炎最重要的人……之一。 \n  \n 　　萧炎心头一跳，斗帝可是斗气大陆最强的存在了，虽然自己具体不知道有多强，但…… \n  \n 　　不过当萧炎看着眼前这个说能让自己成为斗帝的老人，那虚幻的声音，心逐渐平静了下来。 \n  \n 　　你能让我成为斗帝，你还会被搞成这幅鬼样？ \n  \n 　　“被你小子给看穿了。”药尘一幅你真聪明的模样，他没有办法，也不想给萧炎证明能让他成为斗帝。 \n  \n 　　萧炎翻了翻白眼，对药尘说道：“不管什么原因，你刚才也算救了我，既然你也不打算继续吸收我斗气了，那你就离开吧，我也不要你的补偿了。” \n  \n 　　“不过这个戒指你不能带走，这是我母亲的遗物！”", "timestamp": 1657889180, "digest": "ZiSGEQkxJ6DSHbsrrqOy9QC_cygUx2Olb0rrqmepIg4", "contributor": "0xf5B7519ADC4552Ba550Bad00B2e9808A5eA4b01c"}
{"id": "CSkKXdLU793TpQHZNcs3u0qksl2CKeI6uLsZGz7zdPc", "title": "15 July '22: Top Web3 funding rounds this week", "body": "Back again this week with the roundup of top funding rounds for web3 startups. As always I stay true to my view of the outlook of the crypto industry by looking at what smart people are working on (the proxy being where funding is flow):\n\n* Bravo Ready: $3M Seed\n  * Developer of indie blockchain games\n  * $3M Seed led by Solana Ventures, 6th Man Ventures and Sino Global Capital. Shima Capital and Justin Kan also participated\n  * Using funding to accelerate game and software development\n* LI.FI: $5.5M Seed\n  * Developer of cross chain bridge & DEX aggregator\n  * Led by 1kx. Dragonfly Capital, Coinbase Ventures, Lattice, 6th Man, AngelDAO, Scalar & BairesDAO participated\n  * Using funding to expand ecosystem via marketing & expand to add. blockchains\n* Quadrata: $7.5M Seed\n  * Developer of Web3 passport network for permission DeFi ecosystem\n  * Led by Dragonfly. Abra, GSR, Orange DAO, GreatPoint, August Capital, Balaji Srinivasan, Ryan Selkis & others participated\n  * Using funding to integrate 100s of dApps and scale userbase\n* Thalex: €7.5M Series A\n  * Developer of crypto derivatives trading platform\n  * €7.5M Series A led by Bitfinex, Bitstamp, Flow Traders. QCP Capital, Wintermute and IMC Ventures also participated\n  * Using funding to scale and partner with liquidity providers and major exchanges\n* Hang: $16M Series A\n  * Developed of membership program powered by NFTs\n  * Led by Paradigm. Warby Parker, Harry's, Tiger Global Management, Thirtyfive Ventures, Night Ventures, Leore Avidar and Alexandre Arnault also participated\n  * Using funding to scale product, eng and GTM teams\n* Morpho: $18M Token Sale\n  * Developer of DeFi lending protocol\n  * $18M led by a16z & Variant. Nascent, Semantic Ventures, Cherry Crypto, Mechanism Capital, Spark Capital, Standard Crypt, Coinbase participated\n  * Using funding to be the go-to coordidation layer between lending pools\n* Farcaster/Merkle Manufactory: $30M early stage\n  * Developer of social networking protocol\n  * $30M led by a16z. Standard Crypto, Elad Gil, 1confirmation, Scalar Capital, First Round Capital & others participated\n  * Using funding to build out the second version of it's protocol\n* Animoca Brands: $75M @ $5.9B\n  * Developer of video games and a VC\n  * $75M Growth from 10T Holdings, Alpha Wave Global, Liberty City Ventures, Ash Park Capital, SG Spring Limited Partnership Fund, Generation Highway Lt, Cosmic Summit\n  * Using funding for acquisitions and investments\n* Gnosis Safe: $100M token sale\n  * Developer of digital asset management platform / custodian\n  * $100M Token Sale led by 1kx. Tiger Global, A&T Capital, Blockchain Capital, Digital Currency Group also participated\n  * Using funding to build out an ecosystem of applications and wallets\n\nShameless plug, if you're an web3 investor looking for deal flow or a statup looking for funding check out: [www.doubleleap.xyz](https://www.doubleleap.xyz)", "timestamp": 1657889273, "digest": "4z2ejJuZhDX68n9-lPqkcfPGV_Z3T5spbeYvFRY30oo", "contributor": "0xfB446B48EC67352ca7695dE3C7f9c7a8bBAcB735"}
{"id": "M5CWwoGUODR7Pb8rCZaYbMCpnSGYy9N4a3IMo6qBpk8", "title": "dream", "body": "Dream，likearayofsunshineinmylife，Nosunsetmagnificent，notoweringmountainlike，Butinmylife，itisnot，itismyspirit。Dream，likeaseaofmylife，Noearthysimplicity，nocloudslikeelegant，Butinmylife，itisnot。Itisthedrivingforceformetomoveforward。Dream，likeatreeinmylife，Thereisnolikethevastsea，thereisnowaterfalllikethefly，Butinmylife，itisnot，itismystrongbacking。Dream，letmecarryyouinmyownskytofly!梦想，像我生命中的一缕阳光，没有落日般的瑰丽，没有大山般的巍峨，但我的生命中缺它不可，它，是我精神的寄托。梦想，像我生命中的一片海，没有泥土般的朴素，没有流云般的飘逸，但我的生命中缺它不可，它，是我前进的动力。梦想，像我生命中的一棵树，没有大海般的浩瀚，没有瀑布般的飞泻， \n ", "timestamp": 1657889242, "digest": "JFLkJxgGKCwgSpuOb9PbHJemQVw-9Xk-SxLtYipbuEw", "contributor": "0xABdDe30D771cb191d6Ebc0eDEe22EF2Bbd1AcD44"}
{"id": "YOrPPKABuWOAEWdzZsXYpTE-Hp9lS_XXmwiUxhLaFyg", "title": "15 July '22: Top Web3 funding rounds this week", "body": "Back again this week with the roundup of top funding rounds for web3 startups. As always I stay true to my view of the outlook of the crypto industry by looking at what smart people are working on (the proxy being where funding is flowing):\n\n* Bravo Ready: $3M Seed\n  * Developer of indie blockchain games\n  * $3M Seed led by Solana Ventures, 6th Man Ventures and Sino Global Capital. Shima Capital and Justin Kan also participated\n  * Using funding to accelerate game and software development\n* LI.FI: $5.5M Seed\n  * Developer of cross chain bridge & DEX aggregator\n  * Led by 1kx. Dragonfly Capital, Coinbase Ventures, Lattice, 6th Man, AngelDAO, Scalar & BairesDAO participated\n  * Using funding to expand ecosystem via marketing & expand to add. blockchains\n* Quadrata: $7.5M Seed\n  * Developer of Web3 passport network for permission DeFi ecosystem\n  * Led by Dragonfly. Abra, GSR, Orange DAO, GreatPoint, August Capital, Balaji Srinivasan, Ryan Selkis & others participated\n  * Using funding to integrate 100s of dApps and scale userbase\n* Thalex: €7.5M Series A\n  * Developer of crypto derivatives trading platform\n  * €7.5M Series A led by Bitfinex, Bitstamp, Flow Traders. QCP Capital, Wintermute and IMC Ventures also participated\n  * Using funding to scale and partner with liquidity providers and major exchanges\n* Hang: $16M Series A\n  * Developed of membership program powered by NFTs\n  * Led by Paradigm. Warby Parker, Harry's, Tiger Global Management, Thirtyfive Ventures, Night Ventures, Leore Avidar and Alexandre Arnault also participated\n  * Using funding to scale product, eng and GTM teams\n* Morpho: $18M Token Sale\n  * Developer of DeFi lending protocol\n  * $18M led by a16z & Variant. Nascent, Semantic Ventures, Cherry Crypto, Mechanism Capital, Spark Capital, Standard Crypt, Coinbase participated\n  * Using funding to be the go-to coordidation layer between lending pools\n* Farcaster/Merkle Manufactory: $30M early stage\n  * Developer of social networking protocol\n  * $30M led by a16z. Standard Crypto, Elad Gil, 1confirmation, Scalar Capital, First Round Capital & others participated\n  * Using funding to build out the second version of it's protocol\n* Animoca Brands: $75M @ $5.9B\n  * Developer of video games and a VC\n  * $75M Growth from 10T Holdings, Alpha Wave Global, Liberty City Ventures, Ash Park Capital, SG Spring Limited Partnership Fund, Generation Highway Lt, Cosmic Summit\n  * Using funding for acquisitions and investments\n* Gnosis Safe: $100M token sale\n  * Developer of digital asset management platform / custodian\n  * $100M Token Sale led by 1kx. Tiger Global, A&T Capital, Blockchain Capital, Digital Currency Group also participated\n  * Using funding to build out an ecosystem of applications and wallets\n\nShameless plug, if you're an web3 investor looking for deal flow or a statup looking for funding check out: [www.doubleleap.xyz](https://www.doubleleap.xyz)", "timestamp": 1657889294, "digest": "_AkR-UYACeqNKR4efr_DYRMoJdj1TT1-aIfFyBA7__g", "contributor": "0xfB446B48EC67352ca7695dE3C7f9c7a8bBAcB735"}
{"id": "-51yfb7gx5dnMv8WtztzGI8S2Ov6Bo_PlMW80HLM51U", "title": "TIME se asocia con Nelvana para dos series animadas para niños de NFT Creators.", "body": "![](https://images.mirror-media.xyz/publication-images/0mqsyAXUPTNcpk9tMVZ55.png?height=600&width=1000)\n\n**TIME Studios**, la división de producción de televisión y cine ganadora del premio Emmy de [TIME](https://medium.com/u/fa23fa8c6a14), y el estudio ganador del premio Emmy de Corus Entertainment, **Nelvana**, un productor, distribuidor y licenciante internacional líder mundial de contenido animado y de acción en vivo para niños, han entrado en una asociación de desarrollo y producción para dos nuevas series infantiles animadas originales de los popularesNFT creators [Pablo Stanley](https://medium.com/u/7f968435c6b9) (*Robotos*) and @**Will Lee** (*the littles*).\n\nLas dos nuevas series, que se coproducirán con Nelvana, son parte de tres proyectos derivados de NFT en la lista de ip web3 de la división TIME Studios Kids and Family, que también incluye un acuerdo con Toyboogers NFT creado por Doug.\n\n![](https://www.animationmagazine.net/wordpress/wp-content/uploads/ROBYN.jpg)\n\nStanely y Lee aprovecharán su experiencia creando sus queridas colecciones NFT para crear personajes originales para nuevos espectáculos para niños. Stanley, cuya nueva serie presenta a un grupo de amigos que emprenden aventuras fantásticas en un mundo ambientado en un futuro lejano, también está lanzando una nueva colección de NFT basada en el proyecto.\n\n[https://twitter.com/pablostanley/status/1547615423633313800?s=20&t=6bqNWcp3t1hWo-z1mF3-7Q](https://twitter.com/pablostanley/status/1547615423633313800?s=20&t=6bqNWcp3t1hWo-z1mF3-7Q)\n\nAthena Georgaklis, Directora de Desarrollo de Nelvana, dijo: “Nelvana está eufórica de colaborar con TIME Studios Kids and Family en su primera lista de ip web3 para entrar en producción. Web3 es un área prometedora para descubrir historias originales, innovadoras e inspiradas. Estamos entusiasmados de unir nuestra experiencia en producción de animación con el conocimiento de TIME de este nuevo espacio para dar vida a estas historias y unir los mundos de web2 y web3”.\n\nLos dos nuevos programas programados para entrar en producción son la última asociación entre TIME Studios y Nelvana.\n\nCreditos: Time y Animationmagazine.net", "timestamp": 1657889627, "digest": "jZj4vXVlXu27Lc4u6bQZ8i0-3EJXUoWqBSDE_du7RK8", "contributor": "0xFe1EED93E8BDD4582379552a55fEf3aB6aF7d762"}
{"id": "6wm-2wc0yWS_mP6Gf-1VWcYwG0yM1JkiwaONK3nlqzA", "title": "币安注册不了-币安注册教程", "body": "我是币安的一名粉丝，负责币安使用问题的解答。\n\n目前币安现在注册有点麻烦，很多人注册不成功，下面我教大家如何快速注册币安，并且能在国内正常使用。\n\n1\\.首先需要注册一个邮箱号 你才能去注册币安账号 推荐大家使用 海外邮箱outlook邮箱或者Gmail邮箱，国内邮箱可以使用qq邮箱或者163邮箱\n\n2\\.需要打开梯子🪜：打开注意避开美国地区 要使用 台湾、香港、新加坡或者日本的，这些国家和地区是不受限制的。\n\n3\\.币安注册链接\n\n[https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW](https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW)\n\n![](https://images.mirror-media.xyz/publication-images/jp9McieXr-DIF2mCHJdQD.png?height=1080&width=2606)\n\n![](https://images.mirror-media.xyz/publication-images/ocgbl8sh0S1kQ7dbxc_q_.png?height=668&width=874)\n\n![](https://images.mirror-media.xyz/publication-images/EkKBwXZ9ZRuCNDPk41Eqw.png?height=1242&width=1144)\n\n![](https://images.mirror-media.xyz/publication-images/5sYLV11bE6BIe6ceagCfI.png?height=840&width=1538)\n\n![](https://images.mirror-media.xyz/publication-images/_R1ksnreX5rLqWhEXU85e.png?height=1146&width=2444)\n\n之后我们去进行身份认证，认证之后就可以进行交易了\n\n![](https://images.mirror-media.xyz/publication-images/SUV0eC-loxgq-oBHAcPlr.png?height=984&width=1750)\n\n![](https://images.mirror-media.xyz/publication-images/IQk_OpxBpdDEW6et7SRlM.png?height=1156&width=2390)\n\n![](https://images.mirror-media.xyz/publication-images/8uDtMuv4qGQYDPTLf1iG_.png?height=790&width=992)\n\n一般12个小时就能认证成功了，我们等待审核成功就可以在币安进行交易了，就是这么简单，大家快操作起来吧。", "timestamp": 1657889574, "digest": "V-gDcfeoT6fhuk6d2qUBZWsHr5MZRwDA3fEd73rLh6Y", "contributor": "0xeE0974e1f9C1826c4B9389b4f532c1de5bb9F41E"}
{"id": "O2w9TNf6npZLTkSnh2rkwkZDxl_F5HSniQ5v42ll6Io", "title": "dfhfg", "body": "一个o you lai d", "timestamp": 1657889419, "digest": "-HK_V3ljMj1UGUhMHQeC_s4WXozdacuzne5my3ipuyA", "contributor": "0xa98d4130AfAF5cF4408388E56681f47C111FfCB5"}
{"id": "ONg6OOEQxucJDVj3v9Wv5tf9sRoQQgxy0TZAA4fHfLk", "title": "dfhfg", "body": "一个o you lai d", "timestamp": 1657889299, "digest": "h8zyABB-TkVYbdDz0mkL1Jm7JLBduTT3XxF1Qkfhs6M", "contributor": "0xa98d4130AfAF5cF4408388E56681f47C111FfCB5"}
{"id": "rzpV7uSpIcKA9STQtk3-HaTxhUtzHUhdqXV7aLGA6J8", "title": "币安注册不了-币安注册教程", "body": "我是币安的一名粉丝，负责币安使用问题的解答。\n\n目前币安现在注册有点麻烦，很多人注册不成功，下面我教大家如何快速注册币安，并且能在国内正常使用。\n\n1\\.首先需要注册一个邮箱号 你才能去注册币安账号 推荐大家使用 海外邮箱outlook邮箱或者Gmail邮箱，国内邮箱可以使用qq邮箱或者163邮箱\n\n2\\.需要打开梯子🪜：打开注意避开美国地区 要使用 台湾、香港、新加坡或者日本的，这些国家和地区是不受限制的。\n\n3\\.币安注册链接\n\n[https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW](https://accounts.binance.com/zh-TW/register?ref=RXKE7LXW)\n\n![](https://images.mirror-media.xyz/publication-images/jp9McieXr-DIF2mCHJdQD.png?height=1080&width=2606)\n\n![](https://images.mirror-media.xyz/publication-images/ocgbl8sh0S1kQ7dbxc_q_.png?height=668&width=874)\n\n![](https://images.mirror-media.xyz/publication-images/EkKBwXZ9ZRuCNDPk41Eqw.png?height=1242&width=1144)\n\n![](https://images.mirror-media.xyz/publication-images/5sYLV11bE6BIe6ceagCfI.png?height=840&width=1538)\n\n![](https://images.mirror-media.xyz/publication-images/_R1ksnreX5rLqWhEXU85e.png?height=1146&width=2444)\n\n之后我们去进行身份认证，认证之后就可以进行交易了\n\n![](https://images.mirror-media.xyz/publication-images/SUV0eC-loxgq-oBHAcPlr.png?height=984&width=1750)\n\n![](https://images.mirror-media.xyz/publication-images/IQk_OpxBpdDEW6et7SRlM.png?height=1156&width=2390)\n\n![](https://images.mirror-media.xyz/publication-images/8uDtMuv4qGQYDPTLf1iG_.png?height=790&width=992)\n\n一般12个小时就能认证成功了，我们等待审核成功就可以在币安进行交易了，就是这么简单，大家快操作起来吧。", "timestamp": 1657889622, "digest": "p5zQzlpcJ_pRupf5tg10y59xW6xWjZAEqx5TJTyDc_s", "contributor": "0xeE0974e1f9C1826c4B9389b4f532c1de5bb9F41E"}
{"id": "uS8W7mvzcnIRJ4Kk1pUBwuvmCApNeWacmLB7FDfTxyc", "title": "验灵草", "body": "幕上已经出现了视窗操作系统的熟悉桌面，他的目光第一时间落在了右下角的位置。 \n  \n 　　二零二一年六月二十日，二十三点四十八分。 \n  \n 　　杨青轻轻吁了一口气，他在洪荒仙界生活百年，在这个世界却只过了一个小时而已，他记得非常清楚，是因为跟随自己一起过去的，还要他的大米手机。 \n  \n 　　尽管不知道只是魂穿的他，怎么会有手机跟随，但当他第一时间开机的时候，那上面的时间就定格在二零二一年六月二十七日，二十二点四十八分，种种迹象，越发让人觉得那百年的生活就像一场梦。 \n  \n 　　也不知这应该算是庄周梦蝶，还是一枕黄粱，可是自己身上的变化也是真实不虚的，至少在以前的记忆里，闭上眼睛以后，绝对不会还能看到身体外面的景象的。 \n  \n 　　而且，在他的脑海里面，最熟悉的反而是他在洪荒仙界所生存的百年，而不是他从出生到上学毕业的短短二十几年。 \n  \n 　　犹记得当年因为自己有一丝灵性才被选入外门，然后一年年苦熬，修炼，哪怕经过了百年，可一切种种仿佛还是昨天。 \n  \n 　　反而地球上的事情，明明只过了一个小时而已，可许多事，尽管不能说完全忘怀，却也需要一段时间的回忆才能想起来。 \n ", "timestamp": 1657889349, "digest": "P1YGRBmxfWmeDCZ1DEzLQ51Na4tHNevkDR7qxc0cDKg", "contributor": "0xFfF384aD1cA11A9990F448ecb5AF1808D13387a4"}
